[{"jobID": "700136400", "origin_search": "https://www.usajobs.gov/", "posted": "01/17/2023", "jobTitle": "Information Technology Specialist (Network Services) 12 Month Register", "companyName": "InternalRevenueService", "link": "https://www.usajobs.gov/job/700136400", "jobLocation": {"remote": "not specified", "city": "Birmingham", "state": "AL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 46696, "max": 133236}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement/enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\nIf you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 200-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.\nMust be a U.S. Citizen or National and provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240))\nA 1-year probationary period is required.\nHave your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.\nUndergo a review of prior performance/conduct and an income tax verification. Refer to \"Get Your Tax Record\" at http://www.irs.gov/(https://www.irs.gov/individuals/get-transcript) to check the status of your account, balance owed, payment history, make a payment, or review answers to tax questions. If you are not in compliance, you will be determined unsuitable for employment with IRS.\n\n* Continues in Additional Information \n\n\n Qualifications\n\nFederal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-timework is considered on a prorated basis.\nTo ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.\n\nYou must meet the following requirements by the closing date of this announcement: \n\nBASIC REQUIREMENTS GS-5 AND All GRADES: Experience must include Information Technology (IT) related experience that demonstrates each of the following four competencies: 1) Attention to Detail, 2) Customer Service, 3) Oral Communication and 4) Problem Solving. \n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: \n\nSPECIALIZED EXPERIENCE GS 7: Specialized experience for this position must have been in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Interviewing subject-matter personnel to get facts regarding work processes, and synthesizing the resulting data into charts showing information flow; operating computer consoles where this involved choosing from among various procedures in responding to machine commands or unscheduled halts; scheduling the sequence of programs to be processed by computers where alternatives had to be weighed with a view to production efficiency; preparing documentation on cost/benefit studies where this involved summarizing the material and organizing it in a logical fashion; working directly with customers in obtaining information needed to establish or change accounts; translating detailed logical steps developed by others into language codes that computers accept where this required understanding of procedures and limitations appropriate to use of a programming language.\nOR\n\n EDUCATION: 1 full academic year of graduate education at an accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics or technology management OR 1 full academic year of graduate education in one or more of the fields identified above that required the development or adaption of applications, systems or networks. OR Superior Academic Achievementmay be met by having a bachelor's degree, with one of the following: A GPA of 2.95 or higher on a 4.0 scale for all completed undergraduate courses or those completed in the last 2 years of study, or a GPA of 3.45 or higher on a 4.0 scale for all courses in the major field of study or those courses in the major completed in the last 2 years of study, or rank in the upper one third of the class in the college, university, or major subdivision, or membership in a national honor society recognized by the Association of College Honor Societies. Note: Grade point averages should be rounded to one decimal point. For example, 2.95 is rounded to 3.0, and 2.94 is rounded to 2.9. If more than 10 percent of your undergraduate course work (credit hours) was taken on a pass/fail or similar basis, your claim must be based on class standing or membership in an Honor Society.\nOR\n\nCOMBINATION OF EXPERIENCE AND EDUCATION At least 1 year of combined graduate education and experience as defined in paragraphs above\n\nSPECIALIZED EXPERIENCE GS 9: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-7 grade level in the Federal service. Specialized experience for this position includes: Experience in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Analysis of the interrelationships of pertinent components of the system; Planning the sequence of actions necessary to accomplish the assignment; and Personal responsibility for at least a segment of the overall project.\nOR\n\n EDUCATION: A master's or equivalent graduate degree or two full years of progressively higher-level graduate education leading to a master's or equivalent graduate degree in computer science, engineering, information science, information systems management, mathematics, statistics, operations research, engineering or technology management. OR A master's or equivalent graduate degree or two full years of progressively higher-level graduate education leading to a master's or equivalent graduate degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\nOR\n\nCOMBINATION OF EXPERIENCE AND EDUCATION: At least 1 year of combined graduate education and experience as defined in paragraphs above\n\nSPECIALIZED EXPERIENCE GS 11: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-9 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrated an accomplishment of computer project assignments that required a range of knowledge of computer requirements and techniques. For example, assignments would show experience in developing modifications to parts of a system that required significant revisions in the logic or techniques used in the original development. Must have been in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Knowledge of the customary approaches, techniques, and requirements appropriate to an assigned computer applications area or computer specialty area in an organization; planning the sequence of actions necessary to accomplish the assignment where this entailed coordination with others outside the organizational unit and development of project controls; adaptation of guidelines or precedents to the needs of the assignment.\nOR\n\n EDUCATION: You may substitute education for specialized experience as follows: a Ph.D. or equivalent doctoral degree or 3 full years of progressively higher-level graduate education leading to a Ph.D. OR equivalent doctoral degree in computer science, information science, information systems management, mathematics, statistics, operations research, engineering or technology management; OR equivalent doctoral degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\nOR\n\nCOMBINATION OF EXPERIENCE AND EDUCATION At least 1 year of combined graduate education and experience as defined in paragraphs above\n\n\nAND\nMEET TIME IN GRADE (TIG) REQUIREMENT: For positions above the GS-05, applicants must meet applicable time-in-­grade requirements to be considered eligible. One year (52 weeks) at the next lower grade level is required to meet the time-in-grade requirements for the grade you are applying for.\n\nAND\nTIME AFTER COMPETITIVE APPOINTMENT: By the closing date (or if this is an open continuous announcement, by the cut-off date) specified in this job announcement, current civilian employees must have completed at least 90 days of federal civilian service since their latest non-temporary appointment from a competitive referral certificate, known as time after competitive appointment. For this requirement, a competitive appointment is one where you applied to and were appointed from an announcement open to \"All US Citizens\".\n\n* Qualifications Continue in Education\n\nFor more information on qualifications please refer to OPM's Qualifications Standards.\n\n\n\nEducation\n\n\nFor positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.\nA college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Click here for Foreign Education Credentialing instructions.\n\n* Continued from Qualifications\n\nSPECIALIZED EXPERIENCE GS 12:  You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-11 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. This knowledge is generally demonstrated through assignments that required the ability to analyze a number of alternative approaches in the process of advising management concerning major aspects of IT system design. This would include defining what system interrelationships must be considered, or what operating mode, system software, and/or equipment configuration is most appropriate for a given project.In addition to the above you must meet the requirements below: At this level you must have experience serving as a local area network (LAN) trainer and/or assisting others with agency-wide LAN systems; Identifying and controlling all LAN hardware and software configuration; Developing technical standards and procedures for LAN development, implementation, and management; Establishing performance management metrics; Evaluating overall LAN performance against relevant standards; and Providing technical advice and consultation to LAN administrators throughout the agency.\n\nAND\nMEET TIME IN GRADE (TIG) REQUIREMENT: For positions above the GS-05, applicants must meet applicable time-in-­grade requirements to be considered eligible. One year (52 weeks) at the next lower grade level is required to meet the time-in-grade requirements for the grade you are applying for.\n\nAND\nTIME AFTER COMPETITIVE APPOINTMENT: By the closing date (or if this is an open continuous announcement, by the cut-off date) specified in this job announcement, current civilian employees must have completed at least 90 days of federal civilian service since their latest non-temporary appointment from a competitive referral certificate, known as time after competitive appointment. For this requirement, a competitive appointment is one where you applied to and were appointed from an announcement open to \"All US Citizens\".\n\n\n\n\n\nAdditional information\n\n\nWe may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled.\nThe salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages.\nThis is a bargaining unit position.\nTour of Duty: Day Shift - Start and stop times between 6:00am and 6:00pm.\nAlternative work schedule, staggered work hours or telework may be available.\n\n\nIf the position(s) are no longer needed prior to the closing date, this announcement may be closed early.\nThis is an open continuous announcement which will be used to fill vacancies in the locations listed as they become available for the next 12 months contingent upon funding and space requirements. Applicants must apply and/or update their applications by 11:59 pm ET at the close of the following cutoff dates to be considered: Cutoff date(s): 1/30/2023, 5/23/2023, 8/21/2023, 11/20/2023. This announcement may be amended to include additional cut-off dates within the 12 month period if needed, not later than 10 days prior to the additional cut-off date(s). Eligible applicants in the highest quality group who apply by the initial cut-off date will be considered first. If additional vacancies exist, applicants who applied after the initial cutoff date who place in the highest quality group will be considered next. Selections from this announcement may be made no later than (NLT)  2/19/2024.\n\n* Continued from Requirements\n\nMust successfully complete a background investigation, including a FBI criminal history record check (fingerprint check).\nComplete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency.\nIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.\nGo through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpired original or certified copies. \nThe employment of any candidate, including a current employee or a new hire, selected for this position may be conditional upon classification and/or audit of federal tax returns. This audit may include up to 2 years of returns.\nFile a Confidential Financial Disclosure Report within 30 days of appointment and annually from then on.\nObtain and use a Government-issued charge card for business-related travel.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nWHAT IS THE INFORMATION TECHNOLOGY (IT) DIVISION?\nA description of the business units can be found at: https://www.jobs.irs.gov/about/who/business-divisions\n\nVacancies will be filled in the following specialty areas:\nInformation Technology\n\nThe following are the duties of this position at the full working level. If this vacancy includes more than one grade and you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and receive training to help you grow in this position.\n\nLead local implementation of a national project to provide network services that support business requirements; and plan, design, develop, and integrate network systems consistent with existing or planned network infrastructures.\nLead a significant local project to develop requirements for the acquisition of network hardware, software, and services.\nServe as network administrator on a large local system, including responsibility for: configuring hubs, switches, and routers; monitoring network performance; performing network diagnostics; analyzing network traffic patterns; and installing network software fixes and upgrades.\nDevelop and implement configuration management plans on a significant local project for complex LANs and WANs.\nLead significant local projects to create network maps, and troubleshoot network problems, e.g., outages.\n\n\n"}, {"jobID": "715490200", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Computer Engineer", "companyName": "DefenseContractManagementAgency", "link": "https://www.usajobs.gov/job/715490200", "jobLocation": {"remote": "not specified", "city": "LocationNegotiableAfterSelection", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 98496, "max": 151308}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. citizen\nSecurity Requirements: Non-Critical Sensitive with Secret Access\nAppointment is subject to the completion of a favorable suitability or fitness determination, where reciprocity cannot be applied; unfavorably adjudicated background checks will be grounds for removal.\nSelective Service Requirement: Males born after 12-31-59 must be registered or exempt from Selective Service.\n\n\n Qualifications\n\r\n                                        To qualify for a Computer Engineer, your resume and supporting documentation must support:\n\nA. Basic Requirement: A Bachelor's Degree or higher in professional engineering. To be acceptable, the program must: (1) be in a school of engineering with at least one program accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.\n\nOR\n\nA combination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying professional engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n\nProfessional Registration or Licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT), or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\nWritten Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE) examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico.\nSpecified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and in engineering that included the courses specified in the Basic Requirements above. The courses must be fully acceptable toward meeting the requirements of a professional engineering curriculum as described in the Basic Requirements above.\nRelated curriculum -- Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g. engineering technology physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions.\n\nB. Specialized Experience: One year of specialized experience that equipped you with the particular competencies to successfully perform the duties of the position and is directly in or related to this position. To qualify at the GS-13 level, applicants must possess one year of specialized experience equivalent to the GS-12 level or equivalent under other pay systems in the Federal service, military or private sector. Applicants must meet eligibility requirements including time-in-grade (General Schedule (GS) positions only), time-after-competitive appointment, minimum qualifications, and any other regulatory requirements by the cut-off/closing date of the announcement. Creditable specialized experience includes:\n\n\nGS 13: Planning, coordinating, facilitating, and managing software and engineering activities and providing support to CMO personnel; Assisting in the development of processes and indicators used to determine contractor risk and compliance to contract requirements; Understanding functional and technical interpretation and implementation of new and revised regulations, policies, and other direction for CMO personnel; Providing technical comments and recommendations during Software Requirements Reviews, Test Readiness, Reviews, Formal Qualification and Integration/Stage Testing and address the acceptability of Software Products being developed/delivered; Collecting, and analyzing complex data utilizing software tools and databases for contract information, software resource estimating, and logging software surveillance activities.\nGS 14: Planning, coordinating, facilitating, and managing software and engineering activities, providing support to CMO personnel; Developing of processes and indicators used to determine contractor risk and compliance to contract requirements; Providing functional and technical interpretation and implementation of new and revised regulations, policies, and other direction for CMO personnel; Providing technical comments and recommendations during Software Requirements Reviews, Test Readiness, Reviews, Formal Qualification and Integration/Stage Testing and address the acceptability of Software Products being developed/delivered; Collecting, and analyzing complex data utilizing software tools and databases for contract information, software resource estimating, and logging software surveillance activities.\n\n\n\n\nEducation\n\nSubstitution of education may not be used in lieu of specialized experience for this grade level.\n\nIf the position has a minimum education requirement and/or you are using education to qualify in lieu of specialized experience, you MUST provide transcripts (unofficial are acceptable at the time of application) to support your educational claims. The transcripts must include your name, the name of the college or university, class/course list, completed number of credits/hours, and the date degree conferred (if applicable). Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. Licenses must be current at time of application.\nGRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours that your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study.\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university.\n\n\n\nAdditional information\n\n\nThis position does not meet criteria for appointment of Reemployed Annuitants. The DoD criteria for hiring Reemployed Annuitants can be found at: https://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf\nTour of Duty: Flexible\nFLSA: Exempt\nBargaining Unit: Yes\nSelectee may be required to serve a trial/probationary period.\nRecruitment/Relocation/Retention Incentives are not authorized. \nAcquisition, Technology & Logistics (AT&L) NON-CAP: Position requires DoD Acquisition Engineering Technical & Management, Practitioner Level certification within required timeframes. Selectee must also achieve 80 hours of Continuous Learning Points (CLPs) every 2-years. Click here for more details and Resources.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you will be required to report to the official duty location and may be expected to temporarily telework. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a specific period of time determined by your supervisory chain. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nCollects and analyzes data from multiple sources to determine Region, CMO and contractor trends. Incumbent is skilled in using, developing, and maintaining data analysis tools.\nRepresents Region in discussions, meetings, and transactions with other Operating Units and DCMA HQ\nProvides assistance to the Technical Directorate in updates to the Agency Software Acquisition Management policies and procedures\nProvides assistance to the Technical Directorate in updates to the Agency Software Acquisition Management policies and procedures\nReviews and approves requests from personnel for Back to Basics and Agency-level software competency certifications.\nReviews surveillance plans, and evaluates results to determine consistency, effectiveness, and compliance with agency policies and procedures\nProvides assistance in training effectiveness and analyzes results for course improvements.\n\n"}, {"jobID": "714754300", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Systems Engineer", "companyName": "NationalGeospatial-IntelligenceAgency", "link": "https://www.usajobs.gov/job/714754300", "jobLocation": {"remote": "not specified", "city": "Springfield", "state": "VA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 100694, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nSecurity Investigation\n\n\nSPECIAL INFO:As a condition of employment at NGA, persons being considered for employment must meet NGA fitness for employment standards. - U.S. Citizenship Required- Security Clearance (Top Secret/Sensitive Compartmented Information)- Polygraph Test Required- Position Subject to Drug Testing- Two Year Probationary Period- Direct Deposit RequiredSPECIAL REQUIREMENTS:You must be able to obtain and retain a Top Secret security clearance with access to Sensitive Compartmented Information. In addition, you are subject to a Counterintelligence Polygraph examination in order to maintain access to Top Secret information. All employees are subject to a periodic examination on a random basis in order to determine continued eligibility. Refusal to take the examination may result in denial of access to Top Secret information, SAP, and/or unescorted access to SCIFs.Employees with SCI access and who are under NGA cognizance are required to submit a Security Financial Disclosure Report, SF-714, on an annual basis in order to determine continued eligibility. Failure to comply may negatively impact continued access to Top Secret information, Information Systems, SAP, and/or unescorted access to SCIFs.NGA utilizes all processes and procedures of the Defense Civilian Intelligence Personnel System (DCIPS). Non-executive NGA employees are assigned to five distinct pay bands based on the type and scope of work performed. The employee's base salary is established within their assigned pay band based on their unique qualifications. A performance pay process is conducted each year to determine a potential base pay salary increase and/or bonus. An employee's annual performance evaluation is a key factor in the performance pay process. Employees on term or temporary appointments are not eligible to apply for internal assignment opportunity notices. This position is a DCIPS position in the Excepted Service under 10 U.S.C. 1601.  DoD Components with DCIPS positions apply Veterans' Preference to preference eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are an external applicant claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you must self-identify your eligibility in our ERecruit application.\n\n\n Qualifications\n\nMANDATORY QUALIFICATION CRITERIA: For this particular job, applicants must meet all competencies reflected under the Mandatory Qualification Criteria to include education (if required). Online resumes must demonstrate qualification by providing specific examples and associated results, in response to the announcement's mandatory criteria specified in this vacancy announcement: 1. Demonstrated experience in IT asset management, especially software lifecycle management; information technology; systems planning; research; requirements development; engineering; or a related area that demonstrates the ability to successfully perform the duties associated with this position.2. Demonstrated experience coordinating and communication efforts across appropriate groups and organizations.3. Demonstrated experience using IT service provider tools such as Jira, Service+, ESAM (FlexNet Manager Suite & FlexNet Manager for Engineering Applications) or similar tools.4. Demonstrated experience leveraging verbal and written communication skills to relay information and/or ideas to others.5. Demonstrated experience providing advice on projects, design concepts, and/or design changes.EDUCATION REQUIREMENT: A. Education: Bachelor's degree or higher from an accredited college or university in Computer Science, Computer Engineering, Engineering, Engineering Management, Information Science, Information Systems Management, Information Technology, Mathematics, Operations Research, Statistics, Technology Management, System Engineering, or a degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems, or networks. -OR- B. Combination of Education and Experience: A minimum of 24 semester (36 quarter) hours of coursework in any area listed in option A, plus experience in Information Technology, systems planning, research, development, engineering, or a related area that demonstrates the ability to successfully perform the duties associated with this work. As a rule, every 30 semester (45 quarter) hours of coursework is equivalent to one year of experience. Candidates should show that their combination of education and experience totals 4 years. -OR- C. Experience: A minimum of 4 years of experience in Information Technology, systems planning, research, development, engineering, or a related area that demonstrates the ability to successfully perform the duties associated with this work. -AND- LICENSES/CERTIFICATIONS: DAWIA Certification may be required for this position; See Position License and Certification Requirements for additional details.   New Acquisition Workforce members or members transferring to a different or higher skill level will have, upon position entry, thirty-six months, forty-eight months, or sixty months, depending on the DAWIA Tier required, to achieve their certification.  Current Acquisition Workforce members must maintain their current certification by achieving 80 Continuous Learning hours every twenty-four months. -AND- Relevant Competencies: IT-related experience demonstrating each of the four competencies: Attention to Detail, Customer Service, Oral Communication, and Problem Solving.DESIRABLE QUALIFICATION CRITERIA: In addition to the mandatory qualifications, experience in the following is desired: 1. Experience creating draft papers, reports, and briefings.2. Experience in strategic planning, enterprise architecture, and/or system engineering.3. Experience with software licensing models and purchasing of software within the DoD and/or IC to include familiarity with major DoD and IC software vendors and their product lines.\n\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nADDITIONAL INFORMATION: The Software Asset Management (SAM) division is responsible for the acquisition documentation and strategy, delivery and management of the Agency's commercial off the shelf (COTS) software license inventory while reducing expenditures and risk. The SAM Software Lifecycle Manager Engineer develops standard operating procedures (SOP) and instructions for management of NGA's COTS software inventory and usage data. Duties include developing procedures, polices and Agency standards for SAM as well as various NGA IT capabilities such as eSAM (Flexera), Software Requirements Workflow (SRW) and Service+. As the Software Lifecycle Manager Engineer, you will assist colleagues in performing software inventory related tasks as well as assisting in agency self/vendor audits of software inventories by providing essential usage and inventory reporting to the various Agency stakeholder. You will also work closely with the SAM Integration Engineer to provide verification on data integration and automation between the SAM tools and other Agency Capabilities.The SAM Software Lifecycle Manager Engineer contributes to SAM process improvements, policy and governance and support NGA, CIO-T and TCS by communication, developing and implementing SAM improvement plans.Duties:1.\teSAM (Flexera) inventory tool data management and data entry workflows2.\tEnsuring COTS software inventory data is captured from the various Agency software provisioning tools3.\tData management workflows between data source(s) and eSAM4.\tLicense Management in coordination with SAM license managers5.\tSoftware Inventory reporting standards6.\tAssist with software vendor audits7.\tAssist with software Agency self-audits8.\tAssist with software provisioning coordination between software license managers and software service providers9.\tDecommissioned Hardware Software Inventory recover10.\tAgency Personnel Exit Requirement Criteria - Software Inventory recoverAdditional Application Requirement: You may be asked to complete one or more assessments in addition to the application you submit on this website as part of your application to NGA. These assessments may include but are not limited to: 1) Online questionnaires or assessments that require you to describe your job-related knowledge, skills, abilities, or other characteristics that are aligned with the mandatory and desirable qualifications of this job posting. The information you provide in the application you submit must support the response you provide to this questionnaire. You will receive an email to describe any additional assessments required. Please monitor your emails and complete any required assessments as soon as possible.This position may be eligible for a RECRUITMENT INCENTIVE: selected candidates may be offered an incentive as part of the offer of employment. To receive the incentive, selected candidates must be eligible under 5 CFR Part 575, Subpart A, upon issuance of the Final Offer Letter. Changes in federal employment status prior to issuance of the Final Offer Letter may affect eligibility. To receive the incentive, selected candidates will be required to sign a service agreement to stay within the position at NGA for the agreed upon time. If the service agreement is terminated before its completion, the employee may be required to repay a pro rata share amount of the incentive to the government. Additional information regarding recruitment incentives for current federal employees can be found in DoDI 1400.25, Volume 2006.\n\n"}, {"jobID": "715590900", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "IT SPECIALIST (SYSADMIN) (Title 5)", "companyName": "ArmyNationalGuardUnits", "link": "https://www.usajobs.gov/job/715590900", "jobLocation": {"remote": "not specified", "city": "OklahomaCity", "state": "OK", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 107680}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nFederal employment suitability as determined by a background investigation.\nMay be required to successfully complete a probationary period.\nParticipation in direct deposit is mandatory.\nThis position conducts information assurance functions and the incumbent shall comply with the requirements of the certification program and will be required to obtain and maintain certification.\nCertification requirements are outlined in DoD Instruction 8570.01-M.\nWork may require access to classified information. Must be able to obtain and maintain the appropriate security clearance.\nThe incumbent of this position description must have, at a minimum, a completed National Agency Check (NAC) prior to position assignment.\nIrregular and overtime (compensatory) hours may be required to support operational requirements or contingencies.\nThe employee may be required to travel in military and/or commercial aircraft to perform temporary duty assignments.\nThis position is designated as Essential Personnel and may be subject to duty in preparation for, or in response to, a state emergency or disaster declaration.\nThis designation will not exceed 14 calendar days per year unless otherwise approved in advance by the TAG.\nThe incumbent shall comply with the requirements of the certification program and will be required to obtain and maintain certification. Certification requirements are outlined in DoD Instruction 8570.01-M\n\n\n Qualifications\n\nSPECIALIZED EXPERIENCE: Must possess at least one (1) year of specialized experience at the next lower grade GS-11 or equivalent that provides a basic knowledge of data processing functions and general management principles and an understanding of the stages required to automate a work process.\n\nKnowledge of a variety of operating systems (i.e., Windows NT, Windows 2000, Windows XP, Unix, etc.) on desktop and server assets in order to administer user accounts and perform backup operations.\n\nKnowledge of project management techniques and tools sufficient to provide expert guidance on the implementation of emerging technologies to diverse dispersed locations.\n\nAbility to communicate effectively with members who are assigned to one or more locations via phone, email or other correspondence.\n\nKnowledge of, and skill in applying the principles and methods for planning, updating, and integrating information system components, including software and documenting information and physical characteristics of an information system or product\n\nSkill in troubleshooting problems in a data center and implementing changes on multifaceted and interdependent computer platforms.\n\nSkill in programming sufficient to assist in identifying problems or issues with applications, devise software patches or workarounds, document problems and advise the responsible vendor or other outside party on support issues.\n\nSkill in analyzing requests for new and modified applications with expert ability in system design, programming, hardware selection and adapting commercially available software.\n\nKnowledge of and skill in applying storage management practices and assignment of resources and file management techniques.\n\nSkill in using performance tuning tools and techniques to optimize systems functionality in order to meet installation systems requirements.\n\nKnowledge of the techniques and practices to implement fault tolerance on a diverse number of complex systems and applications in order to optimize functionality and service to the customer base.\n\nKnowledge of system diagnostic tools and structured techniques for the recovery of failed systems and data access.\n\nKnowledge of analysis and design techniques to develop system software modifications, systems administration policy and procedures for use across the organization.\n\nKnowledge of overall system architecture along with the systems being administered to integrate information systems components in order to install and maintain software and hardware configurations.\n\nKnowledge of state-of-art system software technology and related computer equipment to perform studies and evaluate whether changes in the system would be advisable.--Knowledge of a wide range of IT standards, principles, concepts, methods, policies, and authorized approaches.\r\n                                    \n\n\nEducation\n\r\n                                            There is no substitution of education for specialized experience for this position.\r\n                                        \n\n\nAdditional information\n\nIf you are a male applicant who was born after 12/31/1959 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency (https://www.sss.gov/RegVer/wfRegistration.aspx).\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        This position is located in an information management organization. The purpose of the position is to serve as the principle technical expert and project leader for information technology (IT) systems administration. The incumbent is responsible for the planning and coordinating the installation, testing, system security configuration and monitoring, operation, troubleshooting and maintenance of all server hardware and software.\n\nServes as project leader responsible for developing, assigning, and coordinating duties and project.\n\nDevelops, modifies, and tests overall system backup and recovery strategies for all systems.\n\nServes as the technical expert and focal point for installation, configuration and testing of hardware and software associated with multiple operating systems and computer platforms.\n\nProvides technical assistance and analysis to other IT personnel involved in system design, programming, database design, and adapting commercially available software.\n\nServes as the senior systems administrator responsible for planning, coordinating, modifying, implementing, and troubleshooting to support customer needs.\n\nWork pertains to the administration of all systems including ensuring the efficient integration between systems as well as compatibility with local area network (LAN) and wide area network (WAN) infrastructure.\n\nAnalyzes, evaluates, and recommends hardware/software changes to various computer systems.\n\nConsiders factors such as compatibility with standard systems, conversion or implementation costs, and impact on existing equipment.\n\nPlans and schedules the installation of new or modified hardware, operating systems, and software applications. Directs testing of vendor-provided software.\n\nDevelops, documents, coordinates, updates and validates the state Continuity of Operation Plan (COOP) procedures for system disaster recovery in collaboration with other Information Management and Enterprise Service providers.\n\nImplements, and or validates, operating system releases and maintains the operational status of systems.\n\nPerforms security management in accordance with DoD Instruction, Army, and NGB regulations.\n\nDevelops and analyzes local policies regarding system access, network rights, and physical access to systems and equipment.\r\n                                    \n"}, {"jobID": "713001600", "origin_search": "https://www.usajobs.gov/", "posted": "03/16/2023", "jobTitle": "IT SPECIALIST (SYSADMIN)", "companyName": "NavalAirSystemsCommand", "link": "https://www.usajobs.gov/job/713001600", "jobLocation": {"remote": "not specified", "city": "ChinaLake", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 80015, "max": 124677}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\r\n                                        Your resume must also demonstrate at least one year of experience at or equivalent to the GS-09 grade level or DS-03 pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Providing support for systems software installation, maintenance and security; 2) Installing new software, administer security procedures, ensure system back-ups and monitor system performance; 3) Assisting Laboratory users, diagnose IT problems, and implement solutions; and 4) Maintaining a documented inventory of IT assets including hardware, software, and licensing.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\nThe following education can be substituted for experience: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree, in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will manage and operate computer systems to include:  performing backups, software installations and/or modifications, system scanning and patching, security vulnerability remediation and documentation.\nYou will be required to support the planning, installation, configuration, testing, implementation, and management of digital information systems supporting the customers of the IT Support Services Branch of the Spectrum Warfare Department.\nYou will install new software, administer security procedures, ensure system back-ups and monitor system performance.\nYou will provide support for systems software installation, maintenance and security.\n\n"}, {"jobID": "714588000", "origin_search": "https://www.usajobs.gov/", "posted": "03/22/2023", "jobTitle": "INTERDISCIPLINARY (COMPUTER ENGINEER / COMPUTER SCIENTIST)", "companyName": "U.S.ArmyCommunicationsElectronicsCommand", "link": "https://www.usajobs.gov/job/714588000", "jobLocation": {"remote": "not specified", "city": "AberdeenProvingGround", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nIf selected, you will be subject to a Single Scope Background Investigation (SSBI) and must be able to obtain and maintain a Top Secret Clearance with Sensitive Compartmented Information (SCI).\nMust comply with Drug Abuse Testing Program requirements.\nU.S. Citizenship is required.  You will be required to provide proof of U.S. Citizenship.\nThis is an Army Acquisition, Logistics and Technology Workforce position. Selectee must meet position requirements for Engineering and\nTechnical Management Practitioner certification within 36 months as of entrance on duty.\nMale applicants born after December 31, 1959 must complete a Pre-Employment Certification Statement for Selective Service Registration.\nOne year trial/probationary period may be required.\nThis is a Defense Cyberspace Workforce Framework (DCWF) position as outlined in DoDD 8140.01 - Cyberspace Workforce Management, Encl 2, Par 9(c)(d).\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nUS Citizens\n\n\nIn order to qualify, you must meet the education and experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nExperience required: To qualify based on your work experience, your resume must describe at least one year of experience which prepared you to do the work in this job.\n\nSpecialized experience: To qualify, applicants must possess one year of specialized experience equivalent to the next lower grade/level (NH-02). Specialized experience is defined as: 1) Developing software systems using techniques such as operating system theory, architecture, and software engineering;2) Applying state-of-the-art software engineering expertise towards operating systems and software systems, using programming languages such as Java, C, C++, C# PowerShell, .NET, or SQL for design, testing, documentation, and deployment; 3) Assessing performance of existing systems to determine future requirements such as hardware/software upgrades, testing and new system capabilities; and\n4) Troubleshooting reported system anomalies to resolve configuration issues and software bugs.\n\nEducation cannotbe substituted for experience.\n\nIn addition to meeting the experience requirement above, applicants must also possess the following basic education requirement:\n\nBASIC EDUCATION REQUIREMENT (Engineering Series):\n\nDegree: Engineering. To be acceptable, the program must: (1) lead to a bachelor's degree in a school of engineering with at least one program accredited by ABET; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. NOTE: You MUST submit a copy of your transcripts.\n\nOR\n\n\nCombination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n\nProfessional registration or licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT), or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\n\nNOTE: You MUST submit a copy of your current registration as an Engineer Intern/Engineer In Training or a copy of your license as a professional engineer.\n\nWritten Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE) examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico. NOTE: You MUST submit a copy of your successful completion of the Fundamentals of Engineering examination or other written test for professional engineer registration.\n\nSpecified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in the basic requirements under paragraph A. The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A.\n\nNOTE: You MUST submit a copy of your transcripts.\n\nRelated curriculum -- Successful completion of a curriculum leading to a bachelor's degree in engineering technology or in an appropriate professional field, e.g., physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance.\n\nNOTE: You MUST submit a copy of your transcripts.\n\nNOTE: You must provide a letter of reference stating that you have at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. The letter must be signed by the engineer who provided the professional engineer supervision. It must also include their name, phone number, and engineer credentials (i.e. engineer education or professional certificates). Lack of this documentation will make you ineligible to be referred.\n\nNOTE: An applicant who meets the basic requirements as specified in A or B above, except as noted under B.1., may qualify for positions in any branch of engineering unless selective factors indicate otherwise.\n\nNOTE: A SF-50 reflecting that you currently or formerly served as an Engineer for the Federal Government is NOT qualifying supporting documentation for the basic requirement. You MUST submit either your transcripts, current registration as a professional engineer, EIT examination results, and/or supporting documentation based on your claim of the basic requirement, as applicable. Lack of this documentation will make you ineligible to be referred.\n\nOR\n\nBASIC EDUCATION REQUIREMENT - (COMPUTER SCIENTIST)\n\nBachelor's degree in computer science OR bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n\nNOTE: You MUST submit a copy of your transcripts.\n\n\n\n\nEducation\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nDirect Deposit of Pay is required.\nMay require overtime work.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 16 - Engineers and Scientists (non-Construction) position.\nPosition has a positive education requirement.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nThis is a DoD Acquisition Demonstration Project position. Under the Defense Authorization Act, personnel management demonstration programs are operating in numerous Army activities and various other organizations supported by Army civilian personnel centers. Under the streamlined personnel operations for demonstration projects, the familiar 15 General Schedule grade structure is replaced with broad pay bands that typically encompass a range of grades. Other initiatives under the demonstration projects include simplified classification, streamlined hiring process, and expanded developmental opportunities. This position is subject to the Command's policy regarding control points. The salary for this position ranges from the equivalent of GS12/step 1 to GS13/step 10.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDefense National Relocation Program will not be authorized.\nRelocation/Recruitment Incentive will not be authorized.\nAdvance hire maybe authorize.\nAdvance Leave maybe authorized.\nStudent Loan Repayment Program (SLRP) will not be authorized.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\nAll selections under an announcement must be made within 3 months from the issuance date of the certificate referral list.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nProvides software engineering expertise by defining system/software requirements; developing software architectures; overseeing software testing and system-based development; performing configuration management; and reducing life cycle support costs.\nAssesses the performance of existing systems against future mission requirements.\nDetermines the need for hardware/software upgrades or the initiation of new system developments.\nLeads and serves as a senior technical specialist on development teams consisting of in-house and contractor personnel to correct problems, upgrade capabilities or create software to support customer requirements.\nProvides Sustainment (Post Deployment Software Support (PDSS) and Post-Production Software Support (PDSS)) for assigned Army  Program of Record systems.\nProvides authoritative technical expertise on the application of computer systems engineering methodologies to the design of computer-driven systems.\nResponsibilities may include program management support; interfacing with stakeholders; reviewing technical proposals; managing property; Contracting Officers Representative duties; and collaborating with the Life Cycle Program Manager/staff.\n\n"}, {"jobID": "715402200", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (SYSTEM ADMINISTRATION)", "companyName": "UnitedStatesFleetForcesCommand", "link": "https://www.usajobs.gov/job/715402200", "jobLocation": {"remote": "not specified", "city": "Kittery", "state": "ME", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 93175, "max": 121128}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nGenerally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade.  Time-in-grade requirements must be met by the closing date of this announcement.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or pass the test. You will be subject to random testing.\nThis position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements (as required).\nThis position is eligible for part time, full time or ad-hoc telework at the discretion of management . This is not a remote position but telework may be authorized.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nRelocation expenses (i.e. PCS) or relocation incentives as described in 5 USC 5753 may be authorized in accordance with applicable travel regulations.\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.\nRecruitment incentives may be authorized to eligible new hires.\n\n\n Qualifications\n\nGS-12\nYour resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:\n\nInstalling and maintaining application software, control software, and documenting physical configuration of an information system.\nManaging the installation and integration of system fixes, updates and enhancements and/or ensuring the rigorous application of information secµrity, information assurance policies, principles, and practices in the delivery of systems administration services.\nResolving hardware/software interface and interoperability problems ensuring systems availability, functionality, integrity, and efficiency.\nUtilizing principles and methods for integrating information system components, performance tuning tools and techniques and systems diagnostic tools and faults identification techniques.\n\nGS-11\nYour resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:\n\nDevelop guidance and procedures for implementation of Applications. Including planning and scheduling the installation of new or modified hardware and operating systems and application software.\nEstablish and maintain user accounts and passwords.\nPerform Windows system management, including performance monitoring and tuning.\nPerfom storage system management, including monitor disk usage and space availiability.\nResolve hardware/software interface and interoperability problems.\n\n\n\nAdditional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/ OR https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-b/ .\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\nPh.D. or equivalent doctoral degree\nor\n3 full years of progressively higher level graduate education (that provided a minimum of 24 semester hours in one or more of the following fields: computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management); leading to a Ph.D. or equivalent doctoral degree.\n\n\n\nAdditional information\n\nCONDITIONS OF EMPLOYMENT:\n\nYou are required to comply with the DON Cyber Information Technology (IT) requirements to include:\n1. Earn and maintain appropriate credentials from the Cyber/IT Qualification Matrix associated with the specialty area and level commensurate with the scope of major assigned duties for position to which you are assigned.\n\n2. Participate in a continuous learning program. A minimum of 40 hours of Cyber/IT related continuous learning annually documented in a current individual development plan signed by both the employee and supervisor.\n\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will perform and develop system administration management program plans, policies and standards.\nYou will install and maintain application software , control software, and document the physical configuration of an information system.\nYou will optimize the functionality of applications and system and diagnose and recover failed systems.\nYou will ensure the integration of Information Technology programs and services; and develop solutions to integration/interoperability issues.\n\n"}, {"jobID": "713957400", "origin_search": "https://www.usajobs.gov/", "posted": "03/20/2023", "jobTitle": "Geographer", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/713957400", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 84546, "max": 109908}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/10/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-13 position you must have served 52 weeks at the GS-12. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade.\n\nNote: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nBasic Requirements:\n\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have a Ph.D. OR,\nCombination: Combinations of successfully completed graduate level education and specialized experience may be used to meet total experience requirements. Only graduate level education in excess of the amount required for the next lower grade level may be combined with experience.\n\nAnd \n\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-12 in the normal line of progression for the occupation in the organization. Specialized Experience is defined as concepts, techniques, and practices of professional geography and in-depth knowledge of digital data production and revision techniques to modify and/or develop standard practices, interpret complex source material, resolve ambiguous data, implement new technology into production procedures, assess compatibility of final products, and improve quality and integrity of end user products\n\n\nYou will be rated on the following Competencies for this position:\nAccountabilityInterpersonal SkillsProblem SolvingSelf ManagementTeamworkTechnical Competence\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical requirement: The work is primarily sedentary. There are no special physical demands for this position.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nCollects requirements for and builds business solutions that package complex analyses and data into easy-to-use geospatial web applications/tools that support program initiatives and legislative mandates\nLeads the prototyping, development, publication and dissemination of interactive maps, dashboards, and complex geospatial data and tools using on-line mapping (such as Portal for ArcGIS and ArcGIS Online) along with web application tools and scripting languages to create user controls for map applications\nApplies knowledge of the principles and methods of web technologies, tools, and delivery systems, including web security and privacy policy practices, when developing user interfaces or resolving interface issues.\nUtilizes knowledge and expertise to inform and support decision making and policy development\nDevelops and maintains strong collaborative relationships with directors and partners internal and external to the agency.\nProvides technical expertise to build business solutions that package complex analyses and data into easy-to use material.\nProvides advice, consults, and reviews of products and services.\nCollaborates with colleagues and GSSC staff to develop and incorporate more complex analyses, spatial data features, and visualizations into existing web app solutions.\nCollects requirements for and builds business solutions that package complex analyses and data into easy-to-use geospatial web applications/tools that support program initiatives and legislative mandates\nLeads the prototyping, development, publication and dissemination of interactive maps, dashboards, and complex geospatial data and tools using on-line mapping (such as Portal for ArcGIS and ArcGIS Online) along with web application tools and scripting languages to create user controls for map applications\nApplies knowledge of the principles and methods of web technologies, tools, and delivery systems, including web security and privacy policy practices, when developing user interfaces or resolving interface issues.\nUtilizes knowledge and expertise to inform and support decision making and policy development\nDevelops and maintains strong collaborative relationships with directors and partners internal and external to the agency.\nProvides technical expertise to build business solutions that packages complex analyses and data into easy-to use material.\nProvides advice, consults, and reviews of products and services.\nCollaborates with colleagues and GSSC staff to develop and incorporate more complex analyses, spatial data features, and visualizations into existing web app solutions.\nProvides administrative support for the enterprise web GIS (example: Portal for ArcGIS and ArcGIS Online). \nManages access and distribution of software licenses and accounts under the GIS Enterprise Agreement.\nEvaluates new spatial data products and capabilities for potential among VHA program offices and medical centers.\n\n\n\nWork Schedule: Monday - Friday 8:00 am- 4:30 pm\nTelework: VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\nPosition Description/PD#: Geographer/PD99190A\nRelocation/Recruitment Incentives: Not Authorized\nFinancial Disclosure Report: Not Required\r\n                                    \n"}, {"jobID": "714204400", "origin_search": "https://www.usajobs.gov/", "posted": "03/21/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (SYSANALYSIS/APPSW)", "companyName": "AirForceElements,U.S.TransportationCommand", "link": "https://www.usajobs.gov/job/714204400", "jobLocation": {"remote": "not specified", "city": "ScottAFB", "state": "IL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 38537, "max": 91840}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be  a U.S. Citizen\nOccasional Travel\nWork Schedule: Full-time\nMales born after 12-31-59 must be registered for Selective Service\nSuitable for Federal employment, determined by a background investigation\nMay be required to successfully complete a probationary period\nOvertime: Occasionally\nTour of Duty: Flexible\nRecruitment Incentives: May Be Authorized\nFair Labor Standards Act (FLSA): Exempt\nFinancial Disclosure: Required\nTelework Eligibility: This position is telework eligible\nCOVID19: Please see, additional information.\nMust obtain/maintain a Secret clearance\nThis is a Non-Critical Acquisition Position\nThis is a cybersecurity position\nMay be required to travel by military or commercial aircraft in the performance of TDY assignments\nMay be required to work overtime on an unscheduled or emergency basis\nCompletion of Professional Military Education (PME) - Primary Developmental Education (PDE) is highly desirable\nA Bachelor's degree in computer science or that includes 30 Semester Hours in a combination of mathematics, statistics, or computer science is highly desirable.\n\n\n Qualifications\n\r\n                                        You may qualify at the NH II , if you fulfill the following qualifications:\n\nA. One year of specialized experience equivalent to the NH-1 (GS-4)  grade level in the Federal service as listed below:\n\nTroubleshooting system hardware and software.\nDiagnosing and resolving customer reported system incidents, problems, and events.\nInstalling and configuring hardware, software, and peripheral equipment of system users in accordance with organizational standards. -\nPerforming asset management/inventory of information technology resources.\nMonitoring and reporting client-level computer system performance.\nDocumenting and refining functional requirements and specifications.\nAnalyzing IT systems and application software requirements, to support recommendations for software enhancements.\n\nB. I possess at least a Bachelor's degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.,\n\nOR\n\nC. You have some specialized experience as described in A, but less than one year; and you have more than one year but less than two years of education as described in B. You have computed the percentage of the requirements that you meet, and the total is at least 100%. (To compute the percentage, divide your total months of qualifying experience by 12. Then divide your semester hours of graduate education beyond the first year by 18. Add the two percentages. The total percentage must equal at least 100 percent to qualify.)\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\n\n\nEducation\n\r\n                                            ARE YOU USING YOUR EDUCATION TO QUALIFY? You MUST provide transcripts or other documentation to support your educational claims.\n\nAll materials must be submitted by the closing date of the announcement.\n\nGRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours that your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study.\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\nCOVID19 - To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\n\nDue to COVID-19, our organization is currently in a diverse telework posture. If selected, you are required to communicate with your supervisor to discuss established work schedules and the current telework posture of your work center. As reentry into the office progresses, you may be eligible to participate in a continued telework arrangement based on the terms of the work center's telework policy.\n\nOther Notes:\nRE-EMPLOYED ANNUITANT: This position DOES NOT meet criteria for re-employed annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at: https://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf\n\nAll applicants must meet qualifications and eligibility criteria by the closing date of the announcement.\n\nInteragency Career Transition Assistance Programs: This program applies to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet ICTAP eligibility criteria; 2) be rated well-qualified for the position; Well qualified is defined as possessing the type and quality of experience that exceeds the positions minimum qualifications. and 3) submit the appropriate documentation to support your ICTAP eligibility. For more information:\nhttps://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/\n\nMales born after 12-31-59 must be registered or exempt from Selective Service (see Who Needs to Register | Selective Service System : Selective Service System (sss.gov))\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        This position is being filled under the memorandum from the Under Secretary of Defense for Personnel and Readiness (USD(P&R)) \"Expansion of Direct Hire Authority for Certain Personnel of the Department of Defense,\" dated October 15, 2021.\n\nThis position is being filled under AcqDemo Direct Hiring Authority (DHA) for non-acquisition positions involving 51% or more of time in direct support of acquisition positions within Business and Technical Management Professional Career path.\n\n\nAs a INFORMATION TECHNOLOGY SPECIALIST (SYSANALYSIS/APPSW) at the NH-2210-2 some of your typical work assignments may include:\n\nServing as an IT Specialist with primary responsibility as the Directorate Functional Area Communications and Computer Systems Manager (FACCSM) providing level one technical support to customers requiring assistance utilizing client level hardware and software.\nMay perform duties as a Systems Analyst for information systems and is the point of contact for technical IT support to USTRANSCOM acquisition programs.\nDiagnose and assist customers with reported client and network incidents, problems, and events.\nDevelop, update, and/or maintain standard client operating procedures (SOPs).\nOversee and track all assigned IT hardware and software applications installed on Directorate assigned/owned network-connected and non-network IT devices.\nSubmit requests to add and delete user accounts via the Automated Account Request System.\nConduct analysis and participate with in-depth investigations to identify approaches to complex hardware/software networking and system design, development problems for cloud computing environments.\nParticipate in development of software system solutions using knowledge of techniques, procedures, and processes such as operating system theory, data structures, computer system architecture, software engineering, and computer communications.\nParticipate in developing acquisition and implementation plans to transition systems from the enterprise IT baseline environment to the target cloud computing\n\n\n"}, {"jobID": "712940400", "origin_search": "https://www.usajobs.gov/", "posted": "03/15/2023", "jobTitle": "Audiovisual Product Specialist", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/712940400", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": "FL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 57118, "max": 89835}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/04/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement.\n\nFor a GS-09 position you must have served 52 weeks at the GS-07.\nFor a GS-11 position you must have served 52 weeks at the GS-09.\n\nThe grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade.\nNote: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nAudiovisual Production Series 1071\nIndividual Occupational Requirements (IOR) \n\nEducation: Undergraduate and Graduate Education: Major study-Photography, radio or television production, motion picture production, or other fields related to the position. Or,\nAdvanced training in a vocational school, technical institute, or art institute above the high school level in one of the fields listed above is creditable as general experience on a month-for-month basis. Or,\nSpecialized Experience (for positions above GS-05): Experience in the actual type of work for which application is made. Unpaid experience is creditable, provided the work done was of a quality level and demonstrated the ability required for the position. This includes work directly connected with the production aspects of the field(s) of the position to be filled.\n\n\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: GS-09 You must have one year of specialized experience equivalent to at least the next lower grade GS-07 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: Captures, creates, and exploits visual images and sounds that provide timely, accurate, and highly accessible information for communication, assessment, training, and decision-making. Coordinates and integrates Medical Media services affecting the organization with a focus on exceptional customer service for both internal and external customers. Planning, coordinating, design and implementation of steps to accomplish assignments. Provides on-call support for issues that arise during events, special training events and conferences. Provides excellent customer service. OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have a master's or equivalent graduate degree or, 2 full years of progressively higher level graduate education leading to such a degree, or, LL.B. or J.D., if related. OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an an appropriate combination of specialized experience and education.\n\n\nSpecialized Experience: GS-11 You must have one year of specialized experience equivalent to at least the next lower grade GS-09 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: Consults and instructs clients and co-workers on proper use and operation of audiovisual equipment. Ensures instructional information is available for clients/staff to utilize audiovisual equipment for presentations or AV conference calls. Initiating procurement requests, preparing statements of work, serving on acquisition teams, participating in source selection processes, serving as a Contracting Officer Representative (COR), and maintaining all procurement and contracting records. Maintains accurate records for management for audiovisual equipment accounts ensuring accountability of audiovisual equipment. Manages procurement and contracting for Medical Media. OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have Ph.D. or equivalent doctoral degree, or 3 full years of progressively higher level graduate education leading to such a degree, or LL.M., if related. OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an an appropriate combination of specialized experience and education.\n\nYou will be rated on the following Competencies for this position:\nApplies Technology to TasksCommunications and MediaComputer Skills\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: The assigned work requires manual dexterity, hand and eye coordination, and the ability to accurately perceive and sense color and light. Requires periods of extended standing, bending, stooping, and kneeling to obtain properly composed photographs and productions. The employee, alone and assisted, will be required to lift, and transport, photographic and audiovisual production equipment weighing up to 50 pounds.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\nA transcript must be submitted with your application if you are basing all or part of your qualifications on education. \n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nCareer Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about CTAP eligibility is on OPM's Career Transition Resources Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Audiovisual Production Specialist duties of the position require extensive interrelationships across the Orlando VA Healthcare System (OVAHCS) with all Services to focus on continuous improvement following our Highly Reliable organization principles. Duties include but are not limited to:\n\nManages procurement and contracting for Medical Media.\nPerforms Audio Engineer duties alongside peers.\nServes as the point of contact for audio/visual expertise. \nEnsure security, as well as preventive maintenance of AV equipment in conference areas.\nMaintains accurate records for management of the audiovisual equipment accounts to ensure accountability of all audiovisual equipment for the OVAHCS.\nProvides excellent customer service and anticipates customer want and needs with each design piece needed by the OVAHCS.\nWorks closely with customers using conference/training space to ensure the appropriate state of art AV equipment is available and operational.\nConsults and instructs clients and co-workers on the proper use and operation of audiovisual equipment.\nSetup of all operations and equipment coordination of requested audiovisual equipment in support of educational, conferencing\n\t(include scheduling), and meeting activities throughout the OVAHCS.\nSupporting OIT network equipment, audiovisual equipment loan-out, maintenance, photography, videography, OVAHCS conferencing facilities, other conference room operational/scheduling support and Contracting Officer Representative (COR) responsibilities.\nSupports studio production systems including mixed-effects level HD production switchers, SMPTE fiber studio cameras, and camera control units. \nProvides Tier 1 support to HD video recorders, 2D and 3D character generators, compositing systems, file-based media playback, record systems, digital studio audio consoles, HD digital cinema cameras, video encoding, and streaming.\nFunctions as a technical expert for a variety of complex audiovisual and file-based media production equipment used in the creation of audiovisual products.\nServes as a subject matter expert regarding audiovisual production and is responsible for both sound and visual displays for high-level VA Leadership forums held within the VA.\nDevelops systematic and proactive processes to ensure that all systems are continuously updated with the required codecs, software versions, and technical components necessary to ingest video footage from all available products on the market, ensuring the uninterrupted ability to edit the highest quality video possible, minimizing time lost in conducting post-production services.\nOther duties as assigned.\n\n\nPromotion Potential: The selectee may be promoted to the full performance level without further competition when all regulatory, qualification, and performance requirements are met. Selection at a lower grade level does not guarantee promotion to the full performance level.\n\n\nWork Schedule: Monday - Friday 8:00 AM - 4:30 PM\nTelework: Ineligible\nVirtual: This is not a virtual position.\nPosition Description/PD#: Audiovisual Product Specialist/PD07349 A\nRelocation/Recruitment Incentives: Not authorized\nPermanent Change of Station (PCS): Not authorized\nPCS Appraised Value Offer (AVO): Not authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "714759300", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Computer Assistant (Hearings Operations System Administrator)", "companyName": "SocialSecurityAdministration", "link": "https://www.usajobs.gov/job/714759300", "jobLocation": {"remote": "not specified", "city": "CreveCoeur", "state": "MO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 42959, "max": 75907}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship required\nSelective Service Registration, if applicable (www.sss.gov)\nBackground and/or security investigation required\nJob offers are contingent on background / security investigation results\nSelectees are required to serve a 1 year probationary period\nRelocation expenses will not be paid\nAll qualification requirements must be met by the closing date of the announcement.\nSelections are contingent on the availability of funding.\n\n\n Qualifications\n\r\n                                        All qualification requirements must be met by the closing date of the announcement.\n\nYou may qualify at the GS-06 grade level (starting salary at $42,959) with at least one year of full-time work experience performing all of the\nfollowing tasks: (1) Install, configure, upgrade, and troubleshoot hardware and software within a networking system; (2) Provide advice and\nsupport to users regarding various hardware and software; and (3) Administer and manage various word processing, data processing, and\nsecurity programs. (Your resume must fully support these responses; otherwise, you will be found ineligible)\n\nYou may qualify at the GS-07 grade level (starting salary at $47,738) with at least one year of full-time work experience independently\nperforming all or most of the following tasks:(1) Install, configure, upgrade, and troubleshoot hardware and software within a networking\nsystem; (2) Provide advice and support to management in a multi-operating system environment and acts as a liaison with vendor\nrepresentatives; (3) Administer and manage various word processing, data processing, and security programs; and (4) Provide analytical,\ntechnical, and administrative support to users. (Your resume must fully support these responses; otherwise, you will be found ineligible)\n\nYou may qualify at the GS-08 grade level (starting salary at $52,867) with at least one year of full-time work experience independently performing all or most of the following tasks: (1) Install, configure, upgrade, and troubleshoot hardware and software within a networking system; (2) Provide advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; (3) Administer and manage various word processing, data processing, and security programs; (4) Provide analytical, technical, and administrative support to users; and (5) Prepare written instructions and provide training on use of software. (Your resume must fully support these responses; otherwise, you will be found ineligible)\n\nYou may qualify at the GS-09 grade level (starting salary at $58,392) with at least one year of full-time work experience independently performing all or most of the following tasks: 1. Installs, configures, upgrades and troubleshoots hardware and software within a networking system; 2. Provides advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; 3. Administers and manages various word processing, data processing, and security programs; 4. Provides analytical, technical, and administrative support to users; 5. Prepares written instructions and provides training on use of software; and 6. Develops and maintain databases. (Your resume must fully support these responses; otherwise, you will be found ineligible)\n\nNote: Part-time work is prorated in crediting experience (e.g., if you work 20 hours per week for a 12-month period), you will be credited with 6 months of experience.\r\n                                    \n\n\nEducation\n\r\n                                            Substitution of Education is not applicable for this position.\r\n                                        \n\n\nAdditional information\n\nThis is a career-ladder position offering the opportunity for annual promotion based on performance leading up to the GS-9 grade level.\n\nNormally candidates are hired at the step one unless they have prior federal experience with no break in service.\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you are registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. See www.sss.gov.\n\nThis is a bargaining unit position, represented by AFGE.\n\nRESUME: Your resume must provide specific details as to how your experience meets the qualifications for this position. When describing your experience in your resume, please be specific. We will not make assumptions regarding your experience. Please ensure that your resume includes the grade (if you are a current or previous federal employee) and month, day and year that you began and ended each position held. Without this information, the experience gained while in that position may not be credited toward meeting the qualifications requirements. The resume should indicate if the work is full-time or part-time. Part-time work is prorated (e.g., if you work 20 hours per week for a 12-month period, you will be credited with 6 months of experience).\n\nFor additional information see: What to include in your resume.\n\nExperience statements (i.e., duties, specialized experience, or occupational assessment questionnaire) copied from this announcement and pasted into your resume will not be considered as a demonstration of your qualifications for this position. You resume must provide context and sufficient detail of your experience. Failure to provide details will result in an ineligible rating.\n\nYour resume must also support your responses to the online questionnaire. Failure to provide support may result in a lower rating and/or you may be excluded from consideration.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The Computer Assistant (Hearings Operations Systems Administrator) serves as the primary adviser to management in the use of automated data processing (ADP) systems with responsibility for oversight, management and maintenance of ADP systems in a multi-operating system environment and as liaison with vendor representatives. This environment entails programming and processing, as well as administration and management of word processing, data processing, telecommunications, batch processing, database management/programming, electronic spreadsheet processing/programming and security.\n\n"}, {"jobID": "715754400", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "Computer Assistant (Hearings Operations Systems Administrator)", "companyName": "SocialSecurityAdministration", "link": "https://www.usajobs.gov/job/715754400", "jobLocation": {"remote": "not specified", "city": "Fargo", "state": "ND", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 46696, "max": 67231}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship required\nSelective Service Registration, if applicable (www.sss.gov)\nFingerprinting and background and/or security investigation required\nJob offers are contingent on fingerprinting and background / security investigation results\nSelectees are required to serve a 1 year probationary period\nRelocation expenses will not be paid\n\n\n Qualifications\n\nGS-7: At least one year of full-time work experience independently performing all or most of the following tasks:(1) Install, configure, upgrade, and troubleshoot hardware and software within a networking system; (2) Provide advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; (3) Administer and manage various word processing, data processing, and security programs; and (4) Provide analytical, technical, and administrative support to users.\n\nGS-8: At least one year of full-time work experience independently performing all or most of the following tasks: (1) Install, configure, upgrade, and troubleshoot hardware and software within a networking system; (2) Provide advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; (3) Administer and manage various word processing, data processing, and security programs; (4) Provide analytical, technical, and administrative support to users; and (5) Prepare written instructions and provide training on use of software.\n\n\n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. See www.sss.gov.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Serves as a Senior Computer Assistant and LAN Administrator in the Office of Disability Adjudication and Reviews' Hearing Offices (HO). Provides analytical, technical and administrative support, which includes independent decision making, for the HO Local Area Network (LAN) system. Performs expert troubleshooting. Serves as the primary adviser to management in the use of automated data processing (ADP) systems with responsibility for oversight, management and maintenance of ADP systems in a multi-operating system environment and as liaison with vendor representatives. This environment entails programming and processing, as well as administration and management of word processing, data processing, telecommunications, local area network, batch processing, database management/programming, electronic spreadsheet processing/programming and security. As a Senior Computer Assistant, the incumbent has primary responsibility over systems operations and automated case processing within the office.\r\n                                    \n"}, {"jobID": "689073000", "origin_search": "https://www.usajobs.gov/", "posted": "11/14/2022", "jobTitle": "OPERATIONS RESEARCH ANALYST", "companyName": "NavalAirSystemsCommand", "link": "https://www.usajobs.gov/job/689073000", "jobLocation": {"remote": "not specified", "city": "Coronado", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 50389, "max": 116202}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nPer the preliminary nationwide injunction on E.O. 14043, COVID-19 vaccinations will not be implemented or enforced.  For more information on vaccine status and workplace safety protocol requirements see Additional Information below.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA). Certification in the Acquisition Functional Area and category assigned to the position is required within established category timeframes.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\nGS-12: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Application of principles, methods in testing and evaluating codes to catch inconsistencies and taking corrective actions when identifying critical operational issues. 2) Analysis of systems to advise decision makers and inform system designers on ways to improve performance and efficiency; 3) Application of mathematical or statistical theory and methods to collect, organize, interpret, and summarize numerical data to provide usable information; 4) Use of statistical/mathematical theory on on-relevant information systems and/or software applications, such as spreadsheets, automated research tools, database applications, etc. 5) Programming mathematical formulas using software languages, such as Python, VBA, C++; and 6) Developing functional, physical, or prototype models and simulations for training, testing and evaluation, the prediction of behavior and phenomena, the evaluation of design alternatives, to support operational preparation, and to visually communicate concepts and/or validate requirements.\n\nGS-11: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Analysis of principles, methods in testing and evaluating codes to catch inconsistencies and taking corrective actions when identifying critical operational issues. 2) Analysis of systems to advise decision makers and inform system designers on ways to improve performance and efficiency; 3) Application of mathematical or statistical theory and methods to collect, organize, interpret, and summarize numerical data to provide usable information; 4) Use of statistical/mathematical theory on on-relevant information systems and/or software applications, such as spreadsheets, automated research tools, database applications, etc. 5) Programming mathematical formulas using software languages, such as Python, VBA, C++; and 6) Developing functional, physical, or prototype models and simulations for training, testing and evaluation, the prediction of behavior and phenomena, the evaluation of design alternatives, to support operational preparation, and to visually communicate concepts and/or validate requirements.\n\nGS-09: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-07 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Research of principles, methods in testing and evaluating codes to catch inconsistencies and taking corrective actions when identifying critical operational issues. 2) Collaboration with decision makers and compiling information to be distributed to system designers on ways to improve performance and efficiency; 3) Application of mathematical or statistical theory and methods to collect, organize, interpret, and summarize numerical data to provide usable information; 4) Use of statistical/mathematical theory on on-relevant information systems and/or software applications, such as spreadsheets, automated research tools, database applications, etc. 5) Programming mathematical formulas using software languages, such as Python, VBA, C++; and 6) Developing functional, physical, or prototype models and simulations for training, testing and evaluation, the prediction of behavior and phenomena, the evaluation of design alternatives, to support operational preparation, and to visually communicate concepts and/or validate requirements under the supervision of a lead or supervisor. \n\nGS-07: Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-05 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Assisting with the analysis of principles, methods in testing and evaluating codes to catch inconsistencies and taking corrective actions when identifying critical operational issues. 2) Application of mathematical or statistical theory and methods to collect, organize, interpret, and summarize numerical data to provide usable information as reviewed by senior analysts; 3) Use of statistical/mathematical theory on on-relevant information systems and/or software applications, such as spreadsheets, automated research tools, database applications, etc. 4) Programming mathematical formulas using software languages, such as Python, VBA, C++; and 5) Assisting in the development of functional, physical, or prototype models and simulations for training, testing and evaluation, the prediction of behavior and phenomena, the evaluation of design alternatives, to support operational preparation, and to visually communicate concepts and/or validate requirements.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:\nOperations Research Series 1515 (opm.gov)\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\nBasic Education Requirement: Degree: in operations research; or at least 24 semester hours in a combination of operations research, mathematics, probability, statistics, mathematical logic, science, or subject-matter courses requiring substantial competence in college-level mathematics or statistics. At least 3 of the 24 semester hours must have been in calculus.\n\nThe following can be qualifying in lieu of experience: \nGS- 07: 1 year of graduate-level education or superior academic achievement\n\nGS-09:  2 years of progressively higher level graduate education leading to a master's degree or master's or equivalent graduate degree\n\nGS-11: 3 years of progressively higher level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree\r\n                                        \n\n\nAdditional information\n\nCOVID VACCINATION INFORMATION:  To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement.  New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. \n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will utilize software languages such as using software languages, such as Python, VBA, C++ .\nYou will collaborate with a team in order achieve common goals.\nYou will seek/generate and evaluate alternative perspectives/solutions and make timely/effective recommendations, based on potential implications of findings or conclusions.\nYou will critically evaluate to identify the cause of problems, and choose courses of action that balance the interests of the mission and stakeholders.\n\n"}, {"jobID": "710696700", "origin_search": "https://www.usajobs.gov/", "posted": "03/09/2023", "jobTitle": "ELECTRONIC INTEGRATED SYSTEMS MECHANIC", "companyName": "AirNationalGuardUnits", "link": "https://www.usajobs.gov/job/710696700", "jobLocation": {"remote": "not specified", "city": "Westfield", "state": "MA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 3724, "max": 4582}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nNATIONAL GUARD MEMBERSHIP IS REQUIRED.  If you are not sure you are eligible for military membership, please contact a National Guard recruiter prior to applying for this position.\nThis is an excepted service position that requires membership in a compatible military assignment in the employing state's National Guard, required prior to the effective date of placement.\nSelectee will be required to wear the military uniform.\nAcceptance of an excepted service position constitutes concurrence with these requirements as a condition of employment.\nMales born after 31 December 1959 must be registered for Selective Service.\nFederal employment suitability as determined by a background investigation.\nMay be required to successfully complete a probationary period.\nParticipation in direct deposit is mandatory.\nFavorable background check is required.\nOptional Form 306 is a required form and must be signed and dated within the year, or you will be disqualified.\nReference Worksheet is a required form, and the link on this announcement must be used or you will be disqualified.\nIncumbent must possess or be able to acquire the appropriate level security clearance for this position.\n\n\n Qualifications\n\nMilitary Grades: \nENL: SrA to TSgt\n\nMilitary Assignments: \nAFSC: 2A051 / 2A071 / 2A354 / 2A374\nCompatible Military Assignment:\nAFSC: 2A0X1, 2A2X1, 2A2X2, 2A2X3, 2A3X4, 2A3X5, 2A8X1, 28AX2, 2A9X1, 2A9X2, 2A9X3\n\nAREA OF CONSIDERATION: Open to current members of the Massachusetts Air National Guard and those eligible/willing to transfer.\n\nNATIONAL GUARD MEMBERSHIP IS REQUIRED: This is an excepted service position that requires membership in a compatible military assignment in the National Guard. Selectee will be required to wear the military uniform. Acceptance of an excepted service position Constitutes concurrence with these requirements as a condition of employment. Applicants who are not currently a member of the National Guard must be eligible for immediate membership and employment in the National Guard in the military grade listed in this announcement. If you are not sure you are eligible for military membership, please contact a Massachusetts Army National Guard recruiter prior to applying for this position.\n\nGENERAL EXPERIENCE: Must have a validated understanding of the basic principles and concepts of the occupational series and grade.\n\nSPECIALIZED EXPERIENCE:\nWG-12: Must have at least a three-skill level in one of the compatible AFSCs, with 12 months of work experiences, that involved duties such as, inspecting, testing, troubleshooting, repairing and modifying software controlled automated and manually controlled test stations, electronic circuit maintenance pods, peripherals, support equipment and associated subsystems. \n\nKnowledgeable of stations that are used to repair and maintain all avionics line-replaceable units and pods. Skilled in analyzing performance, running tests, conducting inspections, troubleshooting, identifying and isolating malfunctions, disassembling, modifying or repairing and reassembling the test stations or electronic circuit maintenance pods and their associated peripherals. Skilled in reading the complex inter-related variables that resulted from a mix of computer hardware and software, stimulus and measurement systems, and special purpose test subsystems. Experiences involved analyzing malfunctions using schematics, logic and wiring diagrams, programming tables, computer program flow charts, software user guides, computer program listings and factory drawings. Skilled in diagnosing circuit operating characteristics using computer query, system peculiar test equipment, and computer diagnostics. Experienced in isolating problems to the failing part using equipment such as, self-test diagnostics, oscilloscopes, frequency meters, signal generators, digital, and differential voltmeters, computer registers and printouts and other special and standard tools and test equipment. Competent in removing and replacing components, assemblies, sub-assemblies, or parts using special and common hand tools, soldering devices and special electronic instruments. Experiences involved modifying and updating avionics pods; or, support equipment and support software according to applicable technical publications. Competent to analyze program data and determined if the criteria are sufficient to provide adequate testing and troubleshooting. Skilled in examining recurring malfunctions and software deficiencies and determined testing voids and initiated corrective action by submitting quality deficiency reports, software deficiency reports, or proposed modifications. Experiences included connecting associated testing equipment to interface the test station system to the aircraft system and pod; facilitated maintenance and repair of pod or line replaceable units from the avionics systems such as radar, fire control, instrument, flight control, inertial FWS navigation, malfunction analysis and recording equipment systems. Competent in determining if failures are caused by the unit under test. Skilled to identify a malfunction and isolated it to the specific component(s). Skilled in the task of disassembling and repairing or replacing solid state devices, micro miniature modules, gyros, sensors, transducers, and any other required parts; followed by the reassembly and performed operational tests. Experiences may have included the identification of test program malfunctions and informing engineers and/or Air Force Logistics Command of the problems. Experienced in the development and/or modification of software, interfaces, extender equipment, or additional items of test equipment or completed work in validating technical data concerning the repair, maintenance, and test of the test station and units under test. Competent in processing and accounting for due-in-from-maintenance supply assets. Skilled in documenting maintenance repair actions and man-hour accounting on maintenance forms and computer systems. Skilled in maintaining historical data of repaired components and of the test stations. Skilled in complying with safety, fire, security, and housekeeping regulations. Experienced in the procedures involved with the proper storage, protection, and maintenance of all work-related material and equipment.\n\nWG-13:\nMust have at least a seven-skill level in one of the compatible AFSCs, with 12 months of work experiences.\n\nExperiences involved duties such as, inspecting, testing, troubleshooting, repairing and modifying software controlled automated and manually controlled test stations, electronic circuit maintenance pods, peripherals, support equipment and associated subsystems. Knowledgeable of stations that are used to repair and maintain all avionics line-replaceable and pods. Skilled in analyzing performance results, running tests, inspecting, troubleshooting, identifying and isolating malfunctions. Experienced in how to disassemble, modify or repair and reassemble test stations or electronic circuit maintenance pods and their associated peripherals. Skills include the ability to consider the complex inter-related variables arising from a mix of computer hardware and software, stimulus and measurement systems, and special purpose test subsystems. Experienced in analyzing malfunctions using schematics, logic and wiring diagrams, programming tables, computer program flow charts, software user guides, computer program listings and factory drawings. Skilled in the diagnoses of circuit operating characteristics using computer query, system peculiar test equipment, and computer diagnostics. Experiences involved isolating problems to the failing part using self-test diagnostics, oscilloscopes, frequency meters, signal generators, digital, and differential voltmeters, computer registers and printouts and other special and standard tools and test equipment. Skilled in removing and replacing components, assemblies, subassemblies, or parts using special and common hand tools, soldering devices and special electronic instruments. Experiences involved modifying and updating avionics pods, support equipment, and support software according to applicable technical publications. Skilled in analyzing program data to determine if the criteria is sufficient to provide adequate testing and troubleshooting. Experienced in the examination of recurring malfunctions and software deficiencies to determine testing voids and initiated corrective action by submission of quality deficiency reports, software deficiency reports or proposed modifications. Skilled in devising repair procedures based on findings and recommending program changes, procedural changes, or data corrections to correct software deficiencies. Skilled in providing hands-on training instructions to lower-grade personnel concerned with repair of computer controlled automatic test equipment, manually controlled test equipment, line replaceable units and aircraft integrated systems. \n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of months/years.\r\n                                    \n\n\nEducation\n\r\n                                            The applicant's skill competencies earned while attending the technical schools are included in the one year work experience requirements. NOTE: To credit work experiences gained from completing the compatible AFSC technical training school program, the applicant must submit technical school certificate(s) and student evaluation(s) to support/verify AFSC work experiences and skills performed while attending the applicable Air Force technical school(s).\n\nARNG ENLISTED: To qualify an enlisted applicant for hire consideration into an ARNG Dual Status Technician FWS 2610 position, he or she must meet the ARNG position's compatible unit position assignment and rank. A high school diploma or GED, are mandatory requirements. Completion of high school courses in physics, algebra, trigonometry, and computer principles is desirable. Higher academic college courses and degrees, that are aligned within the FWS Series 2610 work tasks, are also desirable.\n\nFor the WG-13 ANG Dual Status Technician positions, the mandatory military education requirements are the completion of an Air Force Seven Skill Level Technical Training School and awarded a compatible Seven Skill Level AFSC, along with the successful completion of at least one military professional education course program.\n\nFor the WG-2610-12 ANG Dual Status Technician positions, the mandatory military training requirements are the completion of an Air Force Three Skill Level Technical Training School and successful On-the-Job training that will result or resulted in the award of a compatible Five Skill Level AFSC.\r\n                                        \n\n\nAdditional information\n\nIf you are a male applicant who was born after 12/31/1959 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency (https://www.sss.gov/RegVer/wfRegistration.aspx).\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nMILITARY INCENTIVES - BONUSES AND STUDENT LOAN REPAYMENT PROGRAM: If you are selected for this position, you may lose your eligibility for your National Guard Enlistment/Reenlistment Bonus and Student Loan Repayment Program incentives. In order to avoid losing your incentive eligibility, you should check with your incentives manager prior to accepting an offer for the position.\n\nFor M-Day/Traditional personnel who are currently receiving incentives to include Bonuses and the Student Loan Repayment Program incentive, the following termination rule applies:\n\nIncentive Termination without Recoupment:\nIf you accept an Active Guard Reserve (AGR) position or a Military Technician (Mil Tech) Permanent or Indefinite position after 25 February 2010 where membership in the National Guard is a condition of employment, your bonus will be terminated with no recoupment.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        1. On a day-to-day basis, analyzes performance, tests, inspects, troubleshoots, identifies and isolates malfunctions, disassembles, modifies or repairs and reassembles test stations or ECM Pods and their associated peripherals. Considers the complex interrelated variables arising from a mix of computer hardware and software, stimulus and measurement systems, and special purpose test subsystems. Analyzes malfunctions using schematics, logic and wiring diagrams, programming tables, computer program flow charts, software user guides, computer program listings and factory drawings. Diagnoses circuit operating characteristics using computer query, system peculiar test equipment, and computer diagnostics. Isolates problems to the failing part using self-test diagnostics, oscilloscopes, frequency meters, signal generators, digital, and differential voltmeters, computer registers and printouts and other special and standard tools and test equipment. Removes and replaces components, assemblies, subassemblies, or parts using special and common hand tools, soldering devices and special electronic instruments. (20%)\n\n2. May modify and updates avionics Pods, support equipment and support software according to applicable technical publications. Analyzes program data and determines if the criteria is sufficient to provide adequate testing and troubleshooting. Examines recurring malfunctions and software deficiencies to determine testing voids and initiates corrective action by submission of quality deficiency reports, software deficiency reports or proposed modifications. Devises repair procedures based on findings and recommends program changes, procedural changes, or data corrections to correct software deficiencies. Recommends revisions to intermediate maintenance directives. (20%)\n\n3. Connects associated testing equipment to interface the test station system to the aircraft system and or Pod to facilitate maintenance/repair of POD or line replaceable units (LRUs) from the avionics systems such as radar, fire control, instrument, flight control, inertial navigation, malfunction analysis and recording equipment systems. Determines whether failures are caused by the unit under test (UUT), the Pod, the test station, or the test program. If the malfunction is found to be in the UUT, Pod or the test station, isolates it to the specific component(s), disassembles and effects repair by replacing solid state devices, micro miniature modules, gyros, sensors, transducers, and any other required parts, and assembles after repair is accomplished and performs operational tests. If the malfunction is in the test program, informs engineers and/or Air Force Logistics Command (AFLC) of the problem and serves as subject matter expert in providing practical technical assistance in resolution. Ensures compatibility of items with each other and with extenders and interfaces. (20%)\n\n4. Works with engineers and technicians in the development and/or modification of software, interfaces, extender equipment or additional items of test equipment and in validation of technical data concerning the repair, maintenance, and test of the test station and units under test. Initiates technical data changes. Suggests means by which a component or system can be tested more economically or thoroughly and provides practical technical assistance by explaining peculiarities of the program or assemblies of the test station, UUT, interfaces, extenders, test procedures, etc. (20%)\n\n5. Provides hands-on training instructions to lower grade personnel concerned with repair of computer controlled automatic test equipment, manually controlled test equipment, line replaceable units and aircraft integrated systems. Also provides on-the-job instruction to newly assigned personnel, regardless of grade level. Prepares for and participates in various types of readiness evaluations such as Operational Readiness Inspections (ORI), Inspector General (IG) inspections, and Unit Effectiveness Inspections and mobility and command support exercises. May be required to perform such additional duties as structural firefighting, aircraft fire/crash/rescue duty, security guard, snow removal, munitions loading and handling, heavy equipment operator, maintenance of facilities and equipment, or serve as a team member on a board to cope with natural disasters or civil emergencies. Complies with safety, fire, security, and housekeeping regulations. Ensures that material and equipment are properly stored, protected and maintained. (20%)\n\nPerforms other duties as assigned.\n\n"}, {"jobID": "706326500", "origin_search": "https://www.usajobs.gov/", "posted": "02/13/2023", "jobTitle": "Information Technology Specialist (SYSANALYSIS/APPSW) (12 Month Register)", "companyName": "InternalRevenueService", "link": "https://www.usajobs.gov/job/706326500", "jobLocation": {"remote": "not specified", "city": "Birmingham", "state": "AL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 60641}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nMust be a U.S. Citizen or National and provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240))\nA 1-year probationary period is required.\nHave your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.\nUndergo a review of prior performance/conduct and an income tax verification. Refer to \"Get Your Tax Record\" at http://www.irs.gov/(https://www.irs.gov/individuals/get-transcript) to check the status of your account, balance owed, payment history, make a payment, or review answers to tax questions. If you are not in compliance, you will be determined unsuitable for employment with IRS.\nMust successfully complete a background investigation, including a FBI criminal history record check (fingerprint check).\nComplete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency.\nIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.\nGo through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpired original or certified copies.\nThe employment of any candidate, including a current employee or a new hire, selected for this position may be conditional upon classification and/or audit of federal tax returns. This audit may include up to 2 years of returns.\n\n\n\n Qualifications\n\r\n                                        Federal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-timework is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.\n\nYou must meet the following requirements by the closing date of this announcement:\n\nBASIC REQUIREMENTS GS-5: Experience must include Information Technology (IT) related experience that demonstrates each of the following four competencies: 1) Attention to Detail, 2) Customer Service, 3) Oral Communication and 4) Problem Solving.\n\nSPECIALIZED EXPERIENCE: GS-5 LEVEL: To be eligible for this position at this grade level, you must meet one of the following requirements. One year IT-related experience which was at a level of difficulty and responsibility equivalent to the GS-4 grade level in the Federal service. IT related experience for this position includes: Basic knowledge of IT processing functions to understand the stages to automate a work process. Experience must have also included work with clients and customers to assess and/or address their needs and provide information or assistance relative to the products or services; communicate effectively both orally and in writing; and identify and resolve problems, determine relevant information, demonstrate using sound judgment, and making recommendations. Experience may have been gained in work such as computer operator or assistant, computer sales representative, program analyst, or other positions that required the use or adaptation of computer programs and systems.\n\nOR\nEDUCATION: A bachelor's degree or equivalent degree at an accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management OR bachelor's degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of experience and education at an accredited college or university equivalent to 4 years. You may combine the college credits you completed with any qualifying experience you have to total the equivalent of a four-year college education.\n\nFor more information on qualifications please refer to OPM's Qualifications Standards.\n\n\n\nEducation\n\r\n                                            For positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.\n\nA college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Click here for Foreign Education Credentialing instructions.\r\n                                        \n\n\nAdditional information\n\n\nWe may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled.\nThe salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages.\nThis is a Bargaining unit position.\nTour of Duty: Day Shift - Start and stop times between 6:00am and 6:00pm.\nAlternative work schedule, staggered work hours or telework may be available.\nIf you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 200-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.\nRelocation expenses - no\n\nPlease consider each location carefully when applying. If you are selected for a position at one of your location selections, that location will become your official post of duty.\n\n12 Month Register\nThis is an open continuous announcement which allows applicants to apply up to the closing date of the announcement, 11/18/2023. The announcement will be used to fill an anticipated 10 vacancies. Selections may be made from certificates issued up to 12 months after the 1st cut-off date listed below. Contingent upon funding and space requirements, one or more vacancies may be filled at the locations listed in this announcement as they become available. Applicants must apply and/or update their applications by 11:59 pm ET at the close of the following cutoff dates to be considered: Cutoff date(s): 02/18/2023, 05/18/2023, 08/18/2023, 11/18/2023. This announcement may be amended to include additional cut-off dates within the 12 month period if needed, not later than 10 days prior to the additional cut-off date(s). Eligible applicants who apply by the initial cut-off date, will be referred in score order. If additional vacancies exist, remaining applicants will be considered in score order as needed. If the position(s) are no longer needed prior to the closing date, this announcement may be closed early.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nWHAT IS THE INFORMATION TECHNOLOGY DIVISION?\nA description of the business units can be found at: https://www.jobs.irs.gov/about/who/business-divisions\n\nThe following are the duties of this position at the full working level. If this vacancy includes more than one grade and you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and receive training to help you grow in this position.\n\nDeveloping or assisting in the development of Assembler Language(ALC) software applications on a mainframe platform;\nParticipating on a team designing, developing, testing, and implementing software for less complex programs, such as modifying input forms;\nDocumenting customer business rules;\nDeveloping flow diagrams and/or pseudo-code;\nTesting and debugging programs according to detailed requirements and submitting completed applications software to the project leader;\nSupporting the maintenance of existing applications software.\n\n\n"}, {"jobID": "715142100", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Computer Assistant (Hearings Operation Systems Administrator)", "companyName": "SocialSecurityAdministration", "link": "https://www.usajobs.gov/job/715142100", "jobLocation": {"remote": "not specified", "city": "Phoenix", "state": "AZ", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 48676, "max": 70082}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship required\nSelective Service Registration, if applicable (www.sss.gov)\nFingerprinting and background and/or security investigation required\nJob offers are contingent on fingerprinting and background / security investigation results\nSelectees are required to serve a 1 year probationary period\nRelocation expenses will not be paid\n\n\n Qualifications\n\nAll qualification requirements must be met by the closing date of the announcement.\n\nGS-7: At least one year of full-time work experience independently performing all or most of the following tasks:(1) Install, configure, upgrade, and troubleshoot hardware and software within a networking system; (2) Provide advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; (3) Administer and manage various word processing, data processing, and security programs; and (4) Provide analytical, technical, and administrative support to users.\n\nGS-8: At least one year of full-time work experience independently performing all or most of the following tasks: (1) Install, configure, upgrade, and troubleshoot hardware and software within a networking system; (2) Provide advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; (3) Administer and manage various word processing, data processing, and security programs; (4) Provide analytical, technical, and administrative support to users; and (5) Prepare written instructions and provide training on use of software.\n\nNote: Part-time work is prorated in crediting experience (e.g., if you work 20 hours per week for a 12-month period), you will be credited with 6 months of experience.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. See www.sss.gov.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Senior Computer Assistant and LAN Administrator help to further the agency's mission by providing a full range of analytical technical and administrative support, which includes independent decision making for the Hearing Office Local Area Network (LAN) system.\n\nServes as a Senior Computer Assistant and LAN Administrator in the Office of Disability Adjudication and Reviews' Hearing Offices (HO). Provides analytical, technical and administrative support, which includes independent decision making, for the HO Local Area Network (LAN) system. Performs expert troubleshooting. Serves as the primary adviser to management in the use of automated data processing (ADP) systems with responsibility for oversight, management and maintenance of ADP systems in a multi-operating system environment and as liaison with vendor representatives. This environment entails programming and processing, as well as administration and management of word processing, data processing, telecommunications, local area network, batch processing, database management/programming, electronic spreadsheet processing/programming and security. As a Senior Computer Assistant, the incumbent has primary responsibility over systems operations and automated case processing within the office.\r\n                                    \n"}, {"jobID": "697044000", "origin_search": "https://www.usajobs.gov/", "posted": "01/01/2023", "jobTitle": "Computer Scientist", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/697044000", "jobLocation": {"remote": "not specified", "city": "DoverAFB", "state": "DE", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 71099, "max": 152771}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nPlease read this Public Notice in its entirety prior to submitting your application for consideration.\nU.S. Citizenship is required\nMales must be registered for Selective Service, see www.sss.gov\nTotal salary varies depending on location of position\nPCS expenses if authorized will be paid IAW JTR and Air Force Regulations\nRecruitment incentives may be authorized\nPosition may be subject to random drug testing\nEmployee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays\nShift work and emergency overtime may be required\nEmployee must maintain current certifications\nA security clearance may be required\nDisclosure of Political Appointments\n\n\n Qualifications\n\nQualifications BASIC REQUIREMENTS: Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n\nIn addition to the basic requirements above, all applicant must meet the qualification requirements below:\n\nSPECIALIZED EXPERIENCE:\n\nGS-12: One year of specialized experience equivalent to the GS-11 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation. Serve as assistants to higher grade level scientists responsible for subject-matter or program areas.\n\nGS-13: One year of specialized experience equivalent to the GS-12 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation. Serving as staff specialist for a significant segment of a subject-matter or program area. Providing technical guidance in planning, coordinating, and evaluating proposed research projects and programs of interest to the agency.\n\nGS-14: One year of specialized experience equivalent to the GS-13 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation, and developing and applying system evaluation methods and techniques to major portions of large projects of studies. Serves as staff specialist responsible for providing technical leadership and guidance in a major subject-matter, functional, or program area.\n\nGS-15: One year of specialized experience equivalent to the GS-14 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation, and developing and applying system evaluation methods and techniques to major portions of large projects of studies. Serves as staff experts and consultants.\n\nClick on the following link to view occupational requirements for this position: http://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification standards/1500/computer-scienceseries-1550/\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs):\n\n1. Knowledge of computer science concepts and principles of standard computer science practices, methods, and techniques to perform, following specific instructions, routine projects or minor phases of a larger or more complex project\n2. Knowledge of computer design, simulation or programming software or other appropriate software to perform routine design and analysis assignments.\n3. Knowledge of computer science and related disciplines to design, develop and adapt scientific methods and techniques to recommend solutions for computer problems.\n4. Ability to analyze, interpret and apply computer science procedures in a variety of situations and recommend effective solutions.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience; transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nFor Direct Hire (DHA) Positions:\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application.\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\nTemporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position.\n\nSelective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11783784\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities please click here. Subsequently, FTR Bulletin 20-04 issued by GSA, provides further information regarding NDAA FY2020, Public Law 116-92, and the expansion of eligibility beyond \"transferred\" for WTA/RITA allowances. For additional information, please click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n****Duties and responsibilities vary and may increase according to grade level****\nServe as a computer scientist and technical consultant for work involving both application and development of mathematical, statistical and computer-simulated models and applications.\nApply mathematical and software engineering principles and disciples to the building of software systems.\nPerform various duties concerned with the application of, or research into, computer science methods.\n\n"}, {"jobID": "697689100", "origin_search": "https://www.usajobs.gov/", "posted": "01/03/2023", "jobTitle": "ENGINEER/SCIENTIST", "companyName": "NavalSeaSystemsCommand", "link": "https://www.usajobs.gov/job/697689100", "jobLocation": {"remote": "not specified", "city": "Dahlgren", "state": "VA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 36542, "max": 138868}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nPer the preliminary nationwide injunction on E.O. 14043, COVID-19 vaccinations will not be implemented or enforced.  For more information on vaccine status and workplace safety protocol requirements see Additional Information below.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA). Certification in the Acquisition Functional Area and category assigned to the position is required within established category timeframes.\n\n\n Qualifications\n\nND-04: Your resume must also demonstrate at least one year of specialized experience at or equivalent to the ND-03 pay band (GS 9-11 equivalent) in the Federal service or equivalent experience in the private or public sector as a professional Engineer or Scientistdeveloping, testing and integrating software code into radar and other sensor systems to ensure strategic goal and mission requirements are met.\n\nND-03: Your resume must also demonstrate at least one year of specialized experience at or equivalent to the ND-02 pay band (GS 5-8 equivalent) in the Federal service or equivalent experience in the private or public sector as a professional Engineer or Scientistsupporting the development of software for radar and other sensor systems in order to recommend solutions.\n\nND-02: You must have successfully completed a full 4-year course of study in an accredited college or university leading to a bachelor's or higher degree that included a major field of study as described in the Education section of this flyer.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:\n0854: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/files/all-professional-engineering-positions-0800.pdf\n1550: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/computer-science-series-1550/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            Each series has minimum education requirement as follows:\n\n0854: Degree: Engineering. To be acceptable, the program must: (1) lead to a bachelor's degree in a school of engineering with at least one program accredited by ABET; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.\nOR\nCombination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n1. Professional registration or licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT)1 , or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\n2. Written Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE)2 examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico.\n3. Specified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in the basic requirements under paragraph A. The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A.\n4. Related curriculum -- Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions. (The above examples of related curricula are not all-inclusive.)\n\n1550: Bachelor's degree in computer science OR Bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n\nEducation (related to the series being filled) can be substituted for experience for the ND-03 level as follows:\n\nMaster's or equivalent graduate degree;\nor\n2 full years of progressively higher level graduate education leading to such a degree;\nor\nLL.B. or J.D., if related;\nor\nA combination of experience and education as described above.\n\nOR\n\nPh.D. or equivalent doctoral degree;\nor\n3 full years of progressively higher level graduate education leading to such a degree;\nor\nLL.M., if related;\nor\nA combination of experience and education as described above.\r\n                                        \n\n\nAdditional information\n\nThis position is part of the Warfare Centers Personnel Demonstration Project. The GS equivalents are as follows:\nND-02: GS-05/07/08\nND-03: GS-09/10/11\nND-04: GS-12/13\n\nThis announcement uses a Direct Hire Authority to recruit and appoint qualified candidates to positions in the competitive service.\n\nCOVID VACCINATION INFORMATION:  To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine.\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nVacancies filled from this announcement may be filled at any grade level listed.\n\nIf selected below the full performance level, you may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. Promotion is neither implied nor guaranteed.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will independently perform scientific/engineering work, assess radar systems operational performance and provide input as it pertains to the completeness of satisfying the systems requirements.\nYou will investigate and determine root cause of radar anomalies.\nYou will develop and evaluate radar system requirements for the software Computer Software Configuration Items (CSCls).\nYou will utilize expertise of software architecture and structures, software coding standards and methods to develop software or models in a coherent, repeatable, and effective manner.\nYou will make recommendations to group/project leads, peers, and sponsors on technical aspects of systems or concept development.\nYou will develop plans and procedures to extend existing knowledge for newly emerging ideas and concepts, particularly as applied to the USMC G/ATOR radar.\nYou will prepare briefs, papers, and reports for presentation and submission to managers, supervisors, peers, and sponsors on technical aspects of the G/ATOR.\nYou will lead groups or tasks to resolve issues in the G/ATOR CSCls at NSWCDD.\nYou will address security implications in the software acceptance phase including completion criteria, risk acceptance and documentation, common criteria, and methods of independent testing.\nYou will analyze information to determine, recommend, and plan the development of a new application or modification of an existing application.\nYou will analyze user needs and software requirements to determine feasibility of design within time and cost constraints.\nYou will apply coding and testing standards, apply security testing tools including \"'fuzzing\" static-analysis code scanning tools, and conduct code reviews.\nYou will apply cybersecurity functions (e.g., encryption, access control, and identity management) to reduce exploitation opportunities.\nYou will apply secure code documentation.\n\n"}, {"jobID": "716691600", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Information Technology Specialist, CG-2210-12/13", "companyName": "FederalDepositInsuranceCorporation", "link": "https://www.usajobs.gov/job/716691600", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 103322, "max": 198923}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nRegistration with the Selective Service.\nU.S. Citizenship is required.  \nEmployment Conditions.\nCompletion of Financial Disclosure may be required.\nMinimum Background Investigation (MBI) required.\n\n\n Qualifications\n\nQualifying experience may be obtained in the private or public sector. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic, religious/spiritual; community; student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Additional qualifications information can be found here.\nCG-12: Applicants must have completed at least one year of specialized experience equivalent to at least the GS/CG-11 grade level or above in the Federal service. \nSpecialized experience is experience delivering IT solutions using project management methodologies to include Agile, SCRUM, or Waterfall, including execution of technical tasks related software development lifecycle/management of IT systems or applications; experience conducting business analysis, process improvement; and experience with Microsoft software development technologies to include .NET or MS Power Apps to deliver web applications.\nCG-13: Applicants must have completed at least one year of specialized experience equivalent to at least the GS/CG-12 grade level or above in the Federal service.\nSpecialized experience is experience delivering IT solutions using project management methodologies to include Agile, SCRUM, or Waterfall, including execution of technical tasks related software development lifecycle/management of IT systems or applications; experience conducting business analysis, process improvement, and market research; experience conducting data analysis and preparation, and visual presentation of data; and experience with Microsoft software development technologies to include .NET or MS Power Apps to deliver web applications.\nYou must have Information Technology (IT)-related experience which demonstrates proficiency in each of the following competencies:\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\nApplicants must have met the qualification requirements (including selective placement factors – if any) for this position within 30 calendar days of the closing date of this announcement.\nApplicants eligible for ICTAP (Interagency Career Transition Assistance Program) must achieve a score of 85 “well qualified” for this position. For more information, Click Here.\n\n\n\nEducation\n\nThere is no substitution of education for the experience for this position.\n\n\n\nAdditional information\n\nThe FDIC offers position-specific telework options. This position is eligible for the following: Home Based Option (HBO), Expanded Telework, Traditional Telework, Ad Hoc Telework. For more information, please reference the above-mentioned telework options Here.\nIf selected, you may be required to serve a probationary or trial period as applicable to appointment type.\nTo read about your rights and responsibilities as an applicant for Federal employment, click here.\nAdditional selections may be made from this vacancy announcement to fill identical vacancies that occur subsequent to this announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nIn addition to the regular benefits offered by Federal agencies, the FDIC offers additional benefits to its employees. These benefits, some at minimal cost, are some of the best and most competitive in both the private and public sectors.\nTo find out more,  click here.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nManages development teams to ensure systems development and implementation meets business requirements for the Legal Division. Develops and executes project plans to ensure systems are fully integrated into Federal Deposit Insurance Corporation (FDIC) business operations.\nDevelops and maintains Legal business-led developed tools and applications; develops and generates management reports and data visualizations by leveraging Federal Deposit Insurance Corporation (FDIC) enterprise technology such as Microsoft Power Platform, Tableau and SharePoint to develop ad-hoc reports, automate workflows and manage information.\nPerforms a range of project management Systems Development Life Cycle (SDLC) activities for complex systems enhancement and maintenance projects, encompassing the following major phases of work: Project management, design/development, requirements, testing, implementation and maintenance.\nReviews project deliverables with Federal Deposit Insurance Corporation (FDIC) and non-FDIC clients to ensure they meet requirements and working with clients to meet expectations.\nCoordinating information system project activities with other developers, Federal Deposit Insurance Corporation (FDIC) and non-FDIC clients and support groups with Division of Information Technology (DIT), including planning, requirements analysis, testing, and implementation tasks.\nDevelops and presents visualizations of data using analytical tools such as Tableau and Microsoft Power Platform (MPP); assists citizen developers with development and support of applications.\n\n\n"}, {"jobID": "715441600", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "COMPUTER SCIENTIST", "companyName": "UnitedStatesFleetForcesCommand", "link": "https://www.usajobs.gov/job/715441600", "jobLocation": {"remote": "not specified", "city": "StennisSpaceCenter", "state": "MS", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 107680}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nGenerally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade.  Time-in-grade requirements must be met by the closing date of this announcement.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.\nThis position is eligible for part time, substantial or ad-hoc telework at the discretion of management.\n\n\n Qualifications\n\r\n                                        In addition to the Basic Requirements for this position, your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:\n\nExperience performing software application sustainment for existing oceanographic software capabilities including software modifications, source code changes, testing and documentation updates;\nExperience subject matter expert in developing and maintaining substantial or complex Java applications and Java Web Services;\nExperience subject matter expert in developing and maintaining Geographic Information Systems (GIS) applications which require technologies such as ESRI or GeoServer and developing and maintaining software engineering documentation such as software requirement specifications, software design documents, interface design documents, software test plans/descriptions, integration guides and user guides to support software solutions developed to meet validated requirements.\n\n\nAdditional qualification information can be found from the following Office of Personnel Management website:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=List-by-Occupational-Series\n\nComputer Science Series 1550 (opm.gov)\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            Applicants must meet the following positive education qualifications requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual: Applicants must possess Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions. Transcripts must be provided.\n\n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher.  ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/\n\nOnly Military Spouse Preference applicants currently occupying positions for which a comprehensive training plan has been developed and authorized are entitled to exercise their priority status for this announcement. The most common formal training positions are apprentices, formal interns, and scientist and engineering interns. Upward Mobility Positions that have equivalent training plans are also included when the positions have been pre-identified in an Affirmative Action or similar plan. You must provide documentation supporting you are in a formal training plan (e.g., SF50 and official signed training agreement between you and your command). \n\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will identify approaches for computer solutions and presents recommendations for development methods based on analytical analyses of algorithms or data structures.\nYou will modify and upgrade complex functional area software to accommodate quick-response changes in user requirements or to address critical\n failures.\nYou will develop system checklists and oversee personnel responsible for  the installation, configuration, testing, training, validation, and documentation of\napplications and associated systems\n\n"}, {"jobID": "709533300", "origin_search": "https://www.usajobs.gov/", "posted": "01/31/2023", "jobTitle": "IT SPECIALIST (NETWORK) - TITLE 32", "companyName": "ArmyNationalGuardUnits", "link": "https://www.usajobs.gov/job/709533300", "jobLocation": {"remote": "not specified", "city": "Frankfort", "state": "KY", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 69996, "max": 90992}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nMilitary Grades: PVT - MAJ\n\nCONDITIONS OF EMPLOYMENT:\nYou must maintain membership in the Kentucky National Guard.\nYou must be assigned to a compatible military position.\nWear of the military uniform.\nPosition may require a pre-employment physical.\nMay be subject to furlough actions.\nMay be required to successfully complete a probationary period.\nParticipation in direct deposit is mandatory.\nMust obtain a favorable adjudication of a T3 or equivalent investigation.\nAcceptance of a Federal position may terminate a military bonus.\nAcceptance of a Federal position will terminate Tricare Reserve Select (TRS) eligibility.\nThis position is located on a tobacco free facility.\nThis position is covered by the Domestic Violence Misdemeanor Amendment (30 Sep 96) of the Gun Control Act (Lautenberg Amendment) of 1968. An individual convicted of a qualifying crime of domestic violence may not perform the duties of this position.\nThis position conducts information assurance functions. The incumbent shall comply with the requirements of the certification program and will be required to obtain and maintain certification. Certification requirements are outlined in DOD instruction 8570.01-M.\nMust have Security+ Certification.\r\n                                    \n\n Qualifications\n\nMINIMUM REQUIREMENT:\nExperience that has provided a basic knowledge of data processing functions and general management principles that enabled the applicant to understand the stages required to automate a work process. Experience may have been gained in work such as computer operator or assistant, computer sales representative, program analyst, or other positions that required the use or adaptation of computer programs and systems.\nMust have Security+ Certification.\n\nSPECIALIZED EXPERIENCE:\nMust have at least 36 months experience assigned computer applications area or computer specialty area in an organization. Experience planning the sequence of actions necessary to accomplish the assignment where this entailed coordination with others outside the organizational unit and development of project controls. Experience that required adaptations of guidelines or precedents to meet the needs of the assignment. Experience with analysis and design techniques to develop system software modifications, systems administration policy, and procedures for use across the organization. Experience using software technology and related computer equipment to perform studies and to evaluate system changes.\n\nEXPERIENCE REQUIREMENTS:\nResume must have complete dates (Example 2 JAN 1980 to 3 MAR 1981 or JAN 1980 to MAR 1981), work schedule, and hours worked per week of employment. Use of year only and unspecified work schedule will result in disqualification. Each applicant must fully substantiate -in their own words- that they meet 100% of the minimum requirements and specialized experience listed above in detail; otherwise, the applicant will be considered unqualified for this position. Do NOT copy and paste from the vacancy announcement or the position description. Also, make sure the applicant's name is on every document submitted, otherwise it will NOT be considered.\r\n                                    \n\n\nEducation\n\nSubstitution of Education for Specialized Experience: To qualify for GS-2210 Title 32 Excepted Service positions, on the basis of completed graduate education listed below.\n\nPh.D. or equivalent\n-OR-\n3 years of progressively higher level graduate education leading to such a degree\n\nAll undergraduate or graduate education must be in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\nTo receive credit for education, you must provide OFFICIAL transcripts.\n\n\n\nAdditional information\n\nIf you are a male applicant who was born after 12/31/1959 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency (http://www.sss.gov/RegVer/wfRegistration.aspx).\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As a IT SPECIALIST (NETWORK) - TITLE 32, GS-2210-11, you will perform a variety of network device configuration and connectivity tasks. Execute procedures and coordinate corrective action to optimize network performance. Install, configure and monitor software packages that provide performance measurements of the WAN/LAN. Implement standard configuration software loads for network devices. Work with technical support personnel in resolving critical problems. Use remote management software tools to maintain and update configuration, protocol and files. Ensure backup processes are completed. Evaluate performance of network devices. Coordinate development and implementation of configuration management plans for complex LANs and WANs with supported elements. Implement plans and procedure for installation of applications and upgrades. Monitor distribution of applications and upgrades ensuring compliance with regulations and copyright laws. Implement procedures to ensure accurate records of authorized users of distributed software are maintained. Implement standard operating procedures for devices on the network. Review and evaluate proposed software. Provide input to briefings and presentations on the complexities of the installation networks. Analyze equipment and software reliability and utilization reports to identify and define problem areas and to establish end-to-end systems performance levels. Perform other duties as assigned.\nA more comprehensive detailed description of the position may be found in Position Description PDD0262000 on file in the employing unit or in the Human Resources Office. Contact the KY HRO Staffing Section via email for additional information, ng.ky.kyarng.mbx.hro-technicianstaffing@army.mil.\r\n                                    \n"}, {"jobID": "715167000", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "Computer Assistant (Hearings Operation Systems Administrator)", "companyName": "SocialSecurityAdministration", "link": "https://www.usajobs.gov/job/715167000", "jobLocation": {"remote": "not specified", "city": "Richmond", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 70674, "max": 91873}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship required\nSelective Service Registration, if applicable (www.sss.gov)\nFingerprinting and background and/or security investigation required\nJob offers are contingent on fingerprinting and background / security investigation results\nSelectees are required to serve a 1 year probationary period\nRelocation expenses will not be paid\n\n\n Qualifications\n\nAll qualification requirements must be met by the closing date of the announcement.\n\nGS-9: At least one year of full-time work experience performing all or most of the following tasks: 1. Installs, configures, upgrades and troubleshoots hardware and software within a networking system; 2. Provides advice and support to management in a multi-operating system environment and acts as a liaison with vendor representatives; 3. Administers and manages various word processing, data processing, and security programs; 4. Provides analytical, technical, and administrative support to users; 5. Prepares written instructions and provides training on use of software; and 6. Develops and maintain databases.\n\nNote: Part-time work is prorated in crediting experience (e.g., if you work 20 hours per week for a 12-month period), you will be credited with 6 months of experience.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. See www.sss.gov.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Senior Computer Assistant and LAN Administrator help to further the agency's mission by providing a full range of analytical technical and administrative support, which includes independent decision making for the Hearing Office Local Area Network (LAN) system.\n\nServes as a Senior Computer Assistant and LAN Administrator in the Office of Disability Adjudication and Reviews' Hearing Offices (HO). Provides analytical, technical and administrative support, which includes independent decision making, for the HO Local Area Network (LAN) system. Performs expert troubleshooting. Serves as the primary adviser to management in the use of automated data processing (ADP) systems with responsibility for oversight, management and maintenance of ADP systems in a multi-operating system environment and as liaison with vendor representatives. This environment entails programming and processing, as well as administration and management of word processing, data processing, telecommunications, local area network, batch processing, database management/programming, electronic spreadsheet processing/programming and security. As a Senior Computer Assistant, the incumbent has primary responsibility over systems operations and automated case processing within the office.\r\n                                    \n"}, {"jobID": "711874700", "origin_search": "https://www.usajobs.gov/", "posted": "03/10/2023", "jobTitle": "Computer Scientist", "companyName": "U.S.ArmyCommunicationsElectronicsCommand", "link": "https://www.usajobs.gov/job/711874700", "jobLocation": {"remote": "not specified", "city": "AberdeenProvingGround", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nOne  year trial/probationary period may be required.\nYou will be required to provide proof of U.S. Citizenship.\nThis is an Army Acquisition, Logistics and Technology Workforce position.\nSelectees must meet position requirements for certification at Level Engineering and Technical Management  within 36 months of entrance on duty.\nThis position requires the incumbent be able to obtain and maintain a determination of eligibility for a Top Secret security clearance or access for the duration of employment. A background investigation and credit check are required.\nThis position is subject to a pre-employment screening, and random testing thereafter, to include testing based on reasonable suspicion and testing due to direct involvement with an on-duty accident.\nThis position has a Temporary Duty (TDY) or business travel requirement of 25% of the time.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the education and experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nBasic Requirement for Computer Scientist: Degree: Bachelor's degree (or higher degree) in computer science or bachelor's degree (or higher degree) with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions. (You must submit a copy of your transcripts.)\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\n\nSpecialized Experience: One year of specialized experience which includes: (1) Providing program management functions such as budgeting, scheduling, staffing, and/or technical performance; (2) Applying computer systems expertise towards hardware/software systems, developing requirements, software models and/or system programming files; (3) Assessing performance of existing systems to determine future requirements such as hardware/software upgrades, testing and new system capabilities; and (4) Performing Contracting Officer Representative (COR) duties. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11/NH-02).\n\nThis is a DoD Civilian Acquisition Workforce Personnel Demonstration Project (Acq Demo) position in the NH-03 broadband, subject to the CECOM control point policy. Management will set the pay for this position consistent with the qualifications and education of the selectee and the expected contribution for the position.\n\n\n\nEducation\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nDirect Deposit of Pay is required.\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nThis position is NOT 100% telework.\nThis position MAY be eligible for regular and recurring TELEWORK, including emergency and OPM prescribed unscheduled Telework. Supervisor approval will be required on a case-by-case basis.\nStudent Loan Repayment Program (SLRP) will NOT be authorized.\nRelocation/Retention Incentive will NOT be authorized.\nDefense National Relocation Program will NOT be authorized.\nAdvance Leave Accrual MAY be authorized.\nAdvanced in hire MAY be authorized.\nThis is an Army Acquisition, Logistics and Technology Workforce position. Information on the Army Acquisition, Logistics, and Technology Workforce may be found at https://asc.army.mil/.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 16 - Engineers and Scientists (Non-Construction) position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nServing as a senior technical specialist on development teams consisting of in-house and contractor personnel to correct problems, upgrade capabilities or create software to support customer requirements.\nMay be responsible for performing Contracting Officer Duties.\nProviding overall program management functions such as budgeting, scheduling, staffing and technical performance.\nAssessing the performance of existing systems against future mission requirements, determining the need for hardware/software upgrades or the initiation of new system developments.\n\n"}, {"jobID": "706125900", "origin_search": "https://www.usajobs.gov/", "posted": "02/11/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (SYSADMIN/NETWORK)", "companyName": "NavalFacilitiesEngineeringSystemsCommand", "link": "https://www.usajobs.gov/job/706125900", "jobLocation": {"remote": "not specified", "city": "NavalFacilitiesEngineeringCommand", "state": "Atlantic", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 83854, "max": 109011}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position is designated as a Cyber IT/Cybersecurity Workforce position. You must obtain/maintain the credentials as described in SECNAV M-5239.2 for specialty areas System Administration 451 and Administration 441 as a condition of employment.\nThis position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA). Certification in the Acquisition Functional Area and category assigned to the position is required within established category timeframes.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nNAVFAC is a regionalized command and the employee serving in this position may at any time be assigned to a similar position at any site or workstation within the commuting area as a condition of employment.\n\n\n Qualifications\n\r\n                                        Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:  1) Resolving hardware/software interface and interoperability problems; 2) Maintaining and developing systems configuration; 3) Troubleshooting networks, systems, and applications to identifying and correcting malfunctions and operational problems; 4) Managing accounts, network rights, and accessing systems and equipment; AND 5) Administrating the installation, testing, operation, troubleshooting, and maintenance of hardware and software systems.\n\nYour experience must reflect skill in the following areas: attention to detail, customer service, oral communication, and problem solving.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/ OR https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-b/ .\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nThis announcement uses the Certain Personnel of the DoD direct hire authority to recruit and appoint qualified candidates to positions in the competitive service.\n\nCertain incentives (such as Recruitment, Relocation or Student Loan Repayment) may be authorized to eligible selectees.\n\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will install operating systems to meet an organization's information technology (IT) needs.\nYou will configure network assets (e.g., servers, routers, switches, hubs, firewalls, peripherals, hardware, software, or similar assets) for reliable performance.\nYou will install software to ensure networks are operational.\nYou will analyze operating systems malfunctions to implement corrective actions.\n\n"}, {"jobID": "715746800", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "IT SPECIALIST (NETWORK)", "companyName": "ArmyNationalGuardUnits", "link": "https://www.usajobs.gov/job/715746800", "jobLocation": {"remote": "not specified", "city": "CampMurray", "state": "WA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 76860, "max": 99914}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nMILITARY REQUIREMENTS:\n\nMilitary Grades: SPC-CSM, LT-CPT, W01-CW4\n\nCompatible Military Assignments: 25 series, 35 series, 00F/D Immaterial\n\n- Applicants need not be assigned to the position or possess the MOS to apply or be considered for selection. Selected applicant must be assigned to a compatible Military position and attain MOS within 1 year of appointment action.\n\n- Participation in direct deposit is mandatory.\n\n- All soldiers, civilian employees, and contractor employees who drive Army-owned or leased vehicles must complete the Army Avoidance Course (AAC) training when they start working for the Army. Must have a valid Washington state and military driver's license. Must be able to obtain a Government Travel Card (GTC) and be able to attend all schools deemed necessary by the supervisor.\n\n- Males born after 31 December 1959 must be registered for Selective Service.\n\n- Must maintain membership in the WA Army National Guard for continued employment.\r\n                                    \n\n Qualifications\n\nGENERAL EXPERIENCE:\nExperience, education or training that has provided a basic knowledge of data processing functions and general management principles that enabled the applicant to understand the stages required to automate a work process. Experience may have been gained in work such as computer operator or assistant, computer sales representative, program analyst, or other positions that required the use or adaptation of computer programs and systems.\n\nSPECIALIZED EXPERIENCE:\nMust have at least 36 months experience, education, or training that approaches techniques and requirements appropriate to an assigned computer applications area or computer specialty area in an organization. Experience planning the sequence of actions necessary to accomplish the assignment where this entailed coordination with others outside the organizational unit and development of project controls. Experience that required adaptations of guidelines or precedents to meet the needs of the assignment. Experience preparing documentation on cost/benefit studies where is involved summarizing the material and organizing it in a logical fashion.\r\n                                    \n\n\nEducation\n\nEducation Requirements:\nHigh School Diploma or GED.\n\nSubstitution of Education for Specialized Experience:\nNot Applicable.\n\nTo receive credit for Education, you must provide transcripts or other documentation of proof to support your Educational claims.\n\n\n\nAdditional information\n\n- If you are a male applicant who was born after 12/31/1959 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency (https://www.sss.gov/RegVer/wfRegistration.aspx).\n\n- Military Technicians are ineligible for enlistment, retention, and student loan repayment bonuses. Acceptance of a Technician position will terminate these incentives.\n\n- Military Technicians in the excepted service will wear the appropriate uniform while performing as a Technician.\n\n- Veteran's preference does not apply to National Guard Technician positions in accordance with Title 32 USC 709 (f).\n\nEQUAL OPPORTUNITY: \nThe WA National Guard is an equal opportunity employer and does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service or other non-merit factor.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nA GS-2210-11, IT SPECIALIST (NETWORK):\n\nPerforms a variety of network device configuration and connectivity tasks.\nExecutes procedures and coordinates corrective action to optimize network performance. Installs, configures and monitors tested and evaluated software packages that provide performance measurements of the WAN/LAN.\nImplements the standard configuration software loads for all network devices. Utilizes benchmarks and performance measurement and evaluation data to manage network servers and data communication devices to support normal and surge workload. Works with technical support personnel in resolving critical problems.\nUses remote management software tools to maintain and update configuration, protocol and user/system files.\nDocuments and tracks change to configuration, protocol and user/system files.\nExecutes appropriate action to ensure backup processes are completed.\nEvaluates the performance of network devices such as servers, workstations, and peripheral devices, and remote access systems.\nCoordinates the development and implementation of configuration management plans for complex LANs and WANs with supported elements to include headquarters staff elements, tenant activities, state government, regional operating activities and national agencies.\nImplements plans and procedures for remote installation of applications and upgrades using state of the art software distribution methods.\nMonitors distribution of applications and upgrades ensuring compliance with regulations and copyright laws.\nImplements procedures to ensure accurate records of authorized users of distributed software are maintained.\nImplements the standard operating procedures for all devices on the network.\nReviews and evaluates proposed software. Provides input to briefings and presentations on the complexities of the installation networks. These briefings provide the basis for long-range decision planning relating to C4 network project management.\nAnalyzes equipment and software reliability and utilization reports to identify and define problem areas and to establish end-to-end systems performance levels.\nOther duties as assigned.\nOther duties as assigned.\n\n\n* The above duty description doesn't contain all details of the official position description. A copy of the entire position description can be found on FASCLASS by clicking the following link: (PD# D0262000).\n\n"}]