[{"jobID": "713155700", "origin_search": "https://www.usajobs.gov/", "posted": "03/16/2023", "jobTitle": "ENGINEER/SCIENTIST", "companyName": "Commander,NavalInformationWarfareSystemsCommand(NAVWARSYSCOM)", "link": "https://www.usajobs.gov/job/713155700", "jobLocation": {"remote": "not specified", "city": "PointLomaComplex", "state": "SanDiego", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 93858, "max": 145090}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\r\n                                        Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: Providing software programming for embedded systems.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:\n\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/files/all-professional-engineering-positions-0800.pdf\n\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\n800 SERIES:\n\nBasic Requirements:\n\nA. Degree: Engineering. To be acceptable, the program must: (1) lead to a bachelor's degree in a school of engineering with at least one program accredited by ABET; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.\nOR\nB. Combination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n\n1. Professional registration or licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT)1 , or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\n\n2. Written Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE)2 examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico.\n\n3. Specified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in the basic requirements under paragraph A. The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A.\n\n4. Related curriculum -- Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions. (The above examples of related curricula are not all inclusive.) Note: An applicant who meets the basic requirements as specified in A or B above, except as noted under B.1., may qualify for positions in any branch of engineering unless selective factors indicate otherwise.\n\n\n1550 SERIES:\nBasic Requirements:\nBachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n\n\n\nAdditional information\n\nThis announcement uses the Direct Hire for Certain Competitive Service positions to recruit and appoint qualified candidates in the competitive service. Please read this Public Notice in its entirety prior to submitting your application for consideration.\n\nTHIS IS A DIRECT HIRE ANNOUNCEMENT. Sections 9905 of Title 5, United States Code (U.S.C.), provides that the Secretary of Defense to non-competitively appoint qualified candidates in certain positions in the competitive service within the Department of Defense (DoD).\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will be responsible for technical leadership to include projection execution, cost, schedule, performance and risk.\nYou will apply expert technical knowledge of software programming for embedded systems.\nYou will make use of computer theory, programming concepts and languages, and a knowledge of computer hardware and software.\nYou will be applied to design, develop, test or evaluate computer software; solve problems embedded systems and software-defined networks.\n\n"}, {"jobID": "714080700", "origin_search": "https://www.usajobs.gov/", "posted": "03/20/2023", "jobTitle": "Systems/Network Administrator", "companyName": "U.S.Courts", "link": "https://www.usajobs.gov/job/714080700", "jobLocation": {"remote": "not specified", "city": "SanFrancisco", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 68383, "max": 133262}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        No civil service test is required for this position.\n\nAll employees must be vaccinated for COVID-19. Vaccinated means that two weeks have passed after receiving the second dose of a two-dose in a 2-dose series (Pfizer-BioNTech and Moderna) or a single dose of the Janssen (Johnson & Johnson) COVID-19 Vaccine. New employees must provide proof of vaccination at least one week before their start date (see General Order 43, COVID-19 Public Health Emergency and Court Vaccination and Testing Policy).\n\nApplicants who are non-United States citizens must meet the requirements for federal employment. Relocation expenses will not be reimbursed. Applicants selected for interviews must travel at their own expense.\n\nAs a condition of employment, the selected candidate will be hired provisionally pending the successful completion of a required ten-year background investigation and a favorable suitability determination.  The position is subject to the mandatory electronic direct deposit of salary payment (i.e. Direct Deposit). All court employees are at will, and therefore the selected candidate may be removed from this position at any time if the selected candidate fails to perform at a satisfactory level. In addition, employees are required to adhere to the Code of Conduct for Judicial Employees.\r\n                                    \n\n Qualifications\n\r\n                                        2+ years of full-time (or equivalent) network systems administrator experience that is in, or closely related to, the work of the position and which has demonstrated the knowledge, skills and abilities to successfully perform the duties of this position.\n\nKnowledge of IT software, networks, and theories, principles, practices, and techniques of data communications and network management, and security.\nAbility to communicate effectively, orally and in writing, with a wide variety of individuals (e.g., judges, attorneys, etc.).\nReliable and have excellent customer service skills.\nFlexibility a must.\nAbility to consistently demonstrate sound ethics and judgment.\n\nPREFERRED QUALIFICATIONS:\nPreference will be given to candidates with experience in supporting enterprise level local area networks (LANs), wide area networks (WANs) and virtual LANs (VLANs), including routers, firewalls, switches, hubs, wiring and other hardware, virtualization technology and VMWare server software, Powershell scripting, Microsoft Active Directory, Group Policy deployment, Windows Server 2012R2 and 2016, and legacy systems.  Linux administration experience is a plus. A bachelor's degree from an accredited college or university.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The incumbent is responsible for maintaining and planning for the future growth and expansion of the network and systems, including developing standards, recommending infrastructure changes, and managing and implementing network security measures.  The Systems/Network Administrator keeps IT staff updated on the latest tools and processes and provides direct technical IT support and training to staff as required.\n\nResponsibilities\n\nLead projects to analyze, develop and implement short-term and long-range automation improvement plans for the court, ensuring that the changes can be implemented with minimal disruption at all court locations.\nResponsible for the administration of network security tools, backup infrastructure.\nAdvise and recommend changes to management on network and other significant information technology issues.\nPlan for disaster recovery operations and testing and manage network performance, security, anti-virus, intrusion, web usage/monitoring, design, and acquisition of servers, computers, and connected devices.  Produce useful system documentation, and perform system startup and shutdown procedures, and maintain control records.  Monitor and perform data backups.\nMonitor network infrastructure and components, including all servers and workstations, and implement improvements to performance and security.  Design, modify, enhance, test, and implement standard configurations for deployment of workstations, servers, and network components and client software.\nRecommend, schedule, test, and validate deployment of patches, security updates, and other upgrades to servers, workstations, and network components.  Monitor providers websites to ensure patches are tested and applied in a timely fashion.\nSupervise on-site vendors.  Participate in district-wide network projects.  Under the direction of the Information Technology Manager prepare and propose automation funding needs for fiscal budget.\nResponsible for the Court's telecommunication systems. Troubleshoot and provide support for the court's telephonic and audio/visual systems, including software and hardware additions, infrastructure, and equipment moves and changes.\nProvide desktop support; assists internal and external customers with routine IT-related inquiries regarding equipment, network, software problems, and user application questions.\nMaintain, install, and update desktop computers and mobile computing devices, including new product evaluation and software compatibility analysis.  Maintain automated management systems for imaging, software updates, and patch management.\nMaintain computer and printer inventory, and software licenses.\nProvide training on new hardware, programs, and databases to IT staff members and other internal customers as needed.  Performs backup duties for other information technology staff member.\nPerforms other job-related duties as assigned.  Regular work during non-business hours and weekends is required as needed.  Travel to other divisional offices and remote hearing locations, and the ability to lift and move moderately heavy items, such as computer equipment, is required.\n\n\n"}, {"jobID": "715404100", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "IT SPECIALIST (INFOSEC)", "companyName": "NavalSeaSystemsCommand", "link": "https://www.usajobs.gov/job/715404100", "jobLocation": {"remote": "not specified", "city": "Dahlgren", "state": "VA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 183500}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nPosition is designated as Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area Cybersecurity Program Manager, Advanced level within 12 months of appointment.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\n\n\n Qualifications\n\nFOR NT-06 (GS-14/15 equivalent): Your resume must demonstrate at least one year of specialized experience at or equivalent to the next lower pay band, NT-05 (GS-13/14 equivalent) or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following experience: developing information assurance policies or strategies related to cybersecurity and information technology initiatives.  Your experience must reflect skill in the following areas: attention to detail, customer service, oral communication, and problem solving.  Examples of qualifying experience may include (1) Leading IT teams in the execution of RDT&E IT projects/initiatives; (2) Technical experience in cyber security principles and applying technical solutions to Navy requirements; (3) Knowledge of major supported Operating Systems (Windows, Red Hat, etc.); (4) Technical knowledge of core cyber security principles, networking and system architecture design; (5) Broad and extensive knowledge of cybersecurity requirements including creating of Assessment and Authorization (A&A) artifacts, computer systems scanning and remediation, and the establishment of sound operational practices to minimize computer security risks.\n\nAdditional qualification information can be found from the following Office of Personnel Management website: Information Technology Management Series, 2210 (Alternative B)\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher.  ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will provide leadership, oversight, and management to execute RDTE IT projects/initiatives within the Department.\nYou will provide direct, hands-on technical and project management assistance for collaboration demonstrations.\nYou will serve as a member of the Dahlgren Proving Grounds effort, with expectations to partner with stakeholders to capture and integrate laboratory capabilities, designs, and weapon system element interactions core to meet command?s mission.\nYou will advise others based on cybersecurity requirements including creating Assessment and Authorization (AA) artifacts, computer systems scanning/remediation, and establishment of sound operational practices to minimize computer security risks.\nYou will lead and participate on NSWCDD, Departmental, and divisional teams and events focused on IT process improvement, project management, team building, and resource management.\nYou will Partner with external organizations, including the Test Management Resource Center (TMRC) and DoD Range Commanders Counsel, with expectations to enhance future capabilities for the Department.\n\n"}, {"jobID": "716330600", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Engineering Technician (Civil)", "companyName": "U.S.ArmyCorpsofEngineers", "link": "https://www.usajobs.gov/job/716330600", "jobLocation": {"remote": "not specified", "city": "SanFrancisco", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 102489, "max": 133236}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nThe duties of this position require the incumbent to possess or obtain and maintain a valid state Driver's License in one of the 50 U.S. states or possessions to operate vehicles.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nSpecialized Experience: One year of specialized experience which includes: 1. planning and engineering designs 2. production of engineering plans 3. CAD and BIM drawings. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11).\n\n\n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 18 Engineers and Scientist (Non-Construction) position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\nRecruitment incentives, including student loan repayment, may be offered to highly qualified candidates.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nResponsible for consulting with engineers on all work associated with CAD/BIM/CAE including project planning, design, engineering management, construction, operation and overall coordination.\nDirect and instruct other technicians, engineers, architects and other technical specialists in CAD/BIM/CAE.\nOversee complex databases of engineering products on projects within the District and provides technical support to engineers in the prosecution of their daily work for the production of reports, plans and specifications, and drawings.\nProvide solutions to unprecedented and recurring engineering problems within the CAD/BIM/CAE environment.\nPlan and implement CAD/BIM/CAE standards and updates to the standards.\nPerform/oversee testing of new applications to validate usefulness in the District environment.\n\n"}, {"jobID": "716692200", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Information Technology Specialist, CG-2210-12/13", "companyName": "FederalDepositInsuranceCorporation", "link": "https://www.usajobs.gov/job/716692200", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 103322, "max": 198923}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nRegistration with the Selective Service.\nU.S. Citizenship is required.  \nEmployment Conditions.\nCompletion of Financial Disclosure may be required.\nMinimum Background Investigation (MBI) required.\n\n\n Qualifications\n\nQualifying experience may be obtained in the private or public sector. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic, religious/spiritual; community; student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Additional qualifications information can be found here.\nCG-12: Applicant must have completed at least one year of specialized experience equivalent to at least the GS/CG-11 grade level or above in the Federal service. \nSpecialized experience is experience delivering IT solutions using project management methodologies to include Agile, SCRUM, or Waterfall, including execution of technical tasks related software development lifecycle/management of IT systems or applications; experience conducting business analysis, process improvement; and experience with Microsoft software development technologies to include .NET or MS Power Apps to deliver web applications.\nCG-13: Applicant must have completed at least one year of specialized experience equivalent to at least the GS/CG-12 grade level or above in the Federal service.\nSpecialized experience is experience delivering IT solutions using project management methodologies to include Agile, SCRUM, or Waterfall, including execution of technical tasks related software development lifecycle/management of IT systems or applications; experience conducting business analysis, process improvement, and market research; experience conducting data analysis and preparation, and visual presentation of data; and experience with Microsoft software development technologies to include .NET or MS Power Apps to deliver web applications.\nYou must have Information Technology (IT)-related experience which demonstrates proficiency in each of the following competencies:\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\nApplicants eligible for ICTAP (Interagency Career Transition Assistance Program) must achieve a score of 80 or higher in the online assessment to be determined “well qualified” for this position. For more information,  click here.\n\n\n\nEducation\n\nThere is no substitution of education for the experience for this position.\n\n\n\nAdditional information\n\nThe FDIC offers position-specific telework options. This position is eligible for the following: Home Based Option (HBO), Expanded Telework, Traditional Telework, Ad Hoc Telework. For more information, please reference the above-mentioned telework options Here.\nIf selected, you may be required to serve a probationary period.\nTo read about your rights and responsibilities as an applicant for Federal employment, click here.\nAdditional selections may be made from this vacancy announcement to fill identical vacancies that occur subsequent to this announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nIn addition to the regular benefits offered by Federal agencies, the FDIC offers additional benefits to its employees. These benefits, some at minimal cost, are some of the best and most competitive in both the private and public sectors.\nTo find out more,  click here.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nManages development teams to ensure systems development and implementation meets business requirements for the Legal Division. Develops and executes project plans to ensure systems are fully integrated into Federal Deposit Insurance Corporation (FDIC) business operations.\nDevelops and maintains Legal business-led developed tools and applications; develops and generates management reports and data visualizations by leveraging Federal Deposit Insurance Corporation (FDIC) enterprise technology such as Microsoft Power Platform, Tableau and SharePoint to develop ad-hoc reports, automate workflows and manage information.\nPerforms a range of project management Systems Development Life Cycle (SDLC) activities for complex systems enhancement and maintenance projects, encompassing the following major phases of work: Project management, design/development, requirements, testing, implementation and maintenance.\nReviews project deliverables with Federal Deposit Insurance Corporation (FDIC) and non-FDIC clients to ensure they meet requirements and working with clients to meet expectations.\nCoordinating information system project activities with other developers, Federal Deposit Insurance Corporation (FDIC) and non-FDIC clients and support groups with Division of Information Technology (DIT), including planning, requirements analysis, testing, and implementation tasks.\nDevelops and presents visualizations of data using analytical tools such as Tableau and Microsoft Power Platform (MPP); assists citizen developers with development and support of applications.\n\n\n"}, {"jobID": "707322800", "origin_search": "https://www.usajobs.gov/", "posted": "02/16/2023", "jobTitle": "Information Technology Specialist (SYSANALYSIS/APPSW) 12 month Register", "companyName": "InternalRevenueService", "link": "https://www.usajobs.gov/job/707322800", "jobLocation": {"remote": "not specified", "city": "IRSNationwideLocations", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 36118, "max": 57677}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nMust be a U.S. Citizen or National and provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240))\nUndergo a review of prior performance/conduct and an income tax verification. Refer to \"Get Your Tax Record\" at http://www.irs.gov/(https://www.irs.gov/individuals/get-transcript) to check the status of your account, balance owed, payment history, make a payment, or review answers to tax questions. If you are not in compliance, you will be determined unsuitable for employment with IRS.\nMust successfully complete a background investigation, including a FBI criminal history record check (fingerprint check).\nComplete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency.\nGo through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpired original or certified copies.\n\n\n\n Qualifications\n\r\n                                        Federal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-timework is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.\n\nYou must meet the following requirements by the closing date of this announcement:\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\n\n\nSPECIALIZED EXPERIENCE/EDUCATION GS-05: To be eligible for this position at this grade level, you must meet the following requirements. In addition to the basic requirements, you must have one (1) year of specialized experience at a level of difficulty and responsibility equivalent to the GS-04 grade level in the Federal service. IT related experience for this position includes: Basic knowledge of IT processing functions to understand the stages to automate a work process. Experience must have also included work with clients and customers to assess and/or address their needs and provide information or assistance relative to the products or services; communicate effectively both orally and in writing; and identify and resolve problems, determine relevant information, demonstrate using sound judgment, and making recommendations. Experience may have been gained in work such as computer operator or assistant, computer sales representative, program analyst, or other positions that required the use or adaptation of computer programs and systems.\n\n\nOR\nEDUCATION: A bachelor's degree or equivalent degree at an accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management OR bachelor's degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: You may qualify by a combination of experience and education. Options for qualifying based on a combination will be identified in the online questions.\n\nFor more information on qualifications please refer to OPM's Qualifications Standards.\r\n                                    \n\n\nEducation\n\r\n                                            For positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.\n\nA college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Click here for Foreign Education Credentialing instructions.\r\n                                        \n\n\nAdditional information\n\n\nSubject to a 1-year probationary period (unless already completed).\nHave your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.\nIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.\nWe may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled.\nThe salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages.\nThis is a Bargaining unit position.\nTour of Duty: Day Shift Monday-Friday 6:00am-6:00pm\nAlternative work schedule, staggered work hours or telework may be available.\n\n\nThe employment of any candidate, including a current employee or a new hire, selected for this position will be conditional on obtaining and maintaining a High Risk Security Clearance.\nMay be eligible for telework based on IRS policy. If you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 200-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.\n\nIf the position(s) are no longer needed prior to the closing date, this announcement may be closed early.\nThis is an open continuous announcement which will be used to fill vacancies in the locations listed as they become available for the next 12 months contingent upon funding and space requirements. Applicants must apply and/or update their applications by 11:59 pm ET at the close of the following cutoff dates to be considered: . Eligible applicants in the highest category who apply by the initial cut-off date will be considered first. If additional vacancies exist, applicants who applied after the initial cutoff date who place in the highest category will be considered next. Selections from this announcement may be made no later than (NLT) .\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nWHAT IS THE Information TechnologyDIVISION?\nA description of the business units can be found at: https://www.jobs.irs.gov/about/who/business-divisions\n\nVacancies will be filled in the following specialty areas:\n\n\nThe following are the duties of this position at the full working level. If this vacancy includes more than one grade and you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and receive training to help you grow in this position.\n\nDeveloping or assisting in the development of COBOL software applications in support of IRS modernization and production systems using established standards and system lifecycles;\nParticipating on a team designing, developing, testing, and implementing software for less complex programs, such as modifying input forms;\nDocumenting customer business rules;\nDeveloping flow diagrams and/or pseudo-code;\nTesting and debugging programs according to detailed requirements and submitting completed applications software to the project leader;\n\n\n"}, {"jobID": "707678900", "origin_search": "https://www.usajobs.gov/", "posted": "02/16/2023", "jobTitle": "Information Technology Specialist (SYSANALYSIS/APPSW) 12 month Register", "companyName": "InternalRevenueService", "link": "https://www.usajobs.gov/job/707678900", "jobLocation": {"remote": "not specified", "city": "IRSNationwideLocations", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 36118, "max": 57677}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nMust be a U.S. Citizen or National and provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240))\nUndergo a review of prior performance/conduct and an income tax verification. Refer to \"Get Your Tax Record\" at http://www.irs.gov/(https://www.irs.gov/individuals/get-transcript) to check the status of your account, balance owed, payment history, make a payment, or review answers to tax questions. If you are not in compliance, you will be determined unsuitable for employment with IRS.\nMust successfully complete a background investigation, including a FBI criminal history record check (fingerprint check).\nComplete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency.\nGo through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpired original or certified copies.\n\n\n\n Qualifications\n\r\n                                        Federal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-timework is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.\n\nYou must meet the following requirements by the closing date of this announcement:\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\n\n\nSPECIALIZED EXPERIENCE/EDUCATION GS-05: To be eligible for this position at this grade level, you must meet the following requirements. In addition to the basic requirements, you must have one (1) year of specialized experience at a level of difficulty and responsibility equivalent to the GS-04 grade level in the Federal service. IT related experience for this position includes: Basic knowledge of IT processing functions to understand the stages to automate a work process. Experience must have also included work with clients and customers to assess and/or address their needs and provide information or assistance relative to the products or services; communicate effectively both orally and in writing; and identify and resolve problems, determine relevant information, demonstrate using sound judgment, and making recommendations. Experience may have been gained in work such as computer operator or assistant, computer sales representative, program analyst, or other positions that required the use or adaptation of computer programs and systems.\n\n\nOR\nEDUCATION: A bachelor's degree or equivalent degree at an accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management OR bachelor's degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: You may qualify by a combination of experience and education. Options for qualifying based on a combination will be identified in the online questions.\n\nFor more information on qualifications please refer to OPM's Qualifications Standards.\r\n                                    \n\n\nEducation\n\r\n                                            For positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.\n\nA college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Click here for Foreign Education Credentialing instructions.\r\n                                        \n\n\nAdditional information\n\n\nSubject to a 1-year probationary period (unless already completed).\nHave your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.\nIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.\nWe may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled.\nThe salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages.\nThis is a Bargaining unit position.\nTour of Duty: Day Shift Monday-Friday 6:00am-6:00pm\nAlternative work schedule, staggered work hours or telework may be available.\n\n\nThe employment of any candidate, including a current employee or a new hire, selected for this position will be conditional on obtaining and maintaining a High Risk Security Clearance.\nMay be eligible for telework based on IRS policy. If you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 200-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.\n\nIf the position(s) are no longer needed prior to the closing date, this announcement may be closed early.\nThis is an open continuous announcement which will be used to fill vacancies in the locations listed as they become available for the next 12 months contingent upon funding and space requirements. Applicants must apply and/or update their applications by 11:59 pm ET at the close of the following cutoff dates to be considered: . Eligible applicants in the highest category who apply by the initial cut-off date will be considered first. If additional vacancies exist, applicants who applied after the initial cutoff date who place in the highest category will be considered next. Selections from this announcement may be made no later than (NLT) .\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nHAT IS THE Information TechnologyDIVISION?\nA description of the business units can be found at: https://www.jobs.irs.gov/about/who/business-divisions\n\nVacancies will be filled in the following specialty areas:\n\n\nThe following are the duties of this position at the full working level. If this vacancy includes more than one grade and you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and receive training to help you grow in this position.\n\nDeveloping or assisting in the development of COBOL software applications in support of IRS modernization and production systems using established standards and system lifecycles;\nParticipating on a team designing, developing, testing, and implementing software for less complex programs, such as modifying input forms;\nDocumenting customer business rules;\nDeveloping flow diagrams and/or pseudo-code;\nTesting and debugging programs according to detailed requirements and submitting completed applications software to the project leader;\n\n\n"}, {"jobID": "714589400", "origin_search": "https://www.usajobs.gov/", "posted": "03/22/2023", "jobTitle": "Health Technician (Dietetic)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/714589400", "jobLocation": {"remote": "not specified", "city": "Providence", "state": "RI", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 42404, "max": 55130}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/05/2023.\n\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-04 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: experience where you applied knowledge of quantity food service operations, proper nutrition, food items and appropriate quantities; working with clients, patients, and/or, customers to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; use computers, software applications, databases, and automated systems to accomplish work. NOTE: Experience must be fully documented on your resume and must include job title, duties, month and year start/end dates AND hours worked per week. OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have successfully completed a full four (4) year course of study leading to a bachelor's degree, with a major study or at least 24 semester hours in subjects directly related to this position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited business or technical school, junior college, college or university for which high school graduation or the equivalent is the normal prerequisite. NOTE: Transcripts (unofficial or official) must be submitted with your application materials. Education cannot be credited without documentation. OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an equivalent combination of successfully completed post-high school education (beyond the second year) and specialized experience, as listed above. The education portion must include courses directly related to the work of the position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited college or university. NOTE: Your experience must be documented in your resume and transcripts are required.\n\nYou will be rated on the following Competencies for this position:Computer SkillsCustomer Service (Clerical/Technical)Food ServicePatient CareExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: The work requires walking, standing, bending, lifting and carrying of light items, such as food trays, instruction materials, books, and manuals. NCC Associate functions require long periods of sitting and moving about in an office environment, including repetitive motion activities of the hands and fingers for extensive keyboard and computer mouse use, and office tasks such as answering and holding a telephone phone, and writing.\n\nThe work may require walking indoors, outdoors or to and from other areas of the medical center. It may be necessary to lift and/or push equipment. Incumbent is subject to periods continuous standing, sitting, walking and frequent stooping, reaching, pushing, pulling, and bending. Frequently lifts or moves objects weighing up to 20 pounds.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a VA job announcement includes language requiring applicants to be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply to this Job Announcement. VA may request information regarding your vaccination status, if selected, for the purposes of implementing other workplace safety protocols, such as masking, physical distancing, testing, travel, and quarantine.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Major duties include, but are not limited to:\n\nUtilizes a computer to enter and retrieve basic information;\nUtilizes dietetic software programs to retrieve diet orders, recipes, and menu and inventory data;\nPrints and assembles packets;\nProperly operates telephone equipment to transfer or place calls on hold;\nProvides professional and courteous customer service;\nTriages telephone calls from customers and/or patients;\nProvides basic-level education and information on therapeutic diets to patients, guests, and nursing staff;\nResolves customer and/or patient complaints;\nUtilizes knowledge of basic and routine modified diets to identify problems in diet order information and take appropriate corrective action;\nCorrectly interprets diet activity and patient information, to ensure appropriate food items on meals trays;\nVerifies physician orders for unusual diets, conflicting modifications, tube feeding orders and nutritional supplements;\nAssist with food selections, ensuring appropriateness of menu selections for complex diets;\nAnswers the telephone using proper business etiquette;\nCommunicates with customers in a pleasant, friendly, personable, and professional manner;\nCommunicates effectively via telephone and in-person;\nAttends to both verbal and nonverbal aspects of communication.\n\nWork Schedule: Full-Time/5 days per week/Shift will be determined during the interview.\nCompressed/Flexible:  Not Available\nTelework: Not Available\nVirtual: This is not a virtual position.\nPosition Description/PD#: Health Technician (Dietetic)/PD99796S\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nPCS Appraised Value Offer (AVO): Not Authorized\nFinancial Disclosure Report: Not required\n\n\nThis is a LUINA Bargaining Unit Position.\nThis position is covered by locality-based comparability pay.\nMay be required to attend conferences at other facilities or other VA sites on occasion.\nVeterans' preference in hiring does not apply when selecting individuals under VA's Direct Hire Authority. When hiring under Direct Hire Authority, the law allows selecting officials to hire applicants without regard to 5 U.S.C. 3309-3318, which eliminates the requirement for applying Veterans' preference. VA HR Offices may assess and select any qualified applicant in the order applicants are received.\n\n\n"}, {"jobID": "715390600", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "IT Specialist (Programmer)", "companyName": "SocialSecurityAdministration", "link": "https://www.usajobs.gov/job/715390600", "jobLocation": {"remote": "not specified", "city": "Chicago", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 41996, "max": 67628}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship required\nSelective Service Registration, if applicable (www.sss.gov)\nFingerprinting and background and/or security investigation required\nJob offers are contingent on fingerprinting and background / security investigation results\nSelectees are required to serve a 1 year probationary period\nRelocation expenses will not be paid\nAll qualification requirements must be met by the closing date of the announcement\n\n\n Qualifications\n\r\n                                        All qualification requirements must be met by the closing date of the announcement.\n\nIf you are using experience to qualify, you must have: \n\nFor GS-5: 52 weeks of full-time IT experience demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification).\n\nFor the GS-7 at least one year experience performing the following tasks: (1) Developing web based applications used in a business environment; (2) provided or assisted with agile project management for application development projects; (3) worked closely with application sponsors to provide troubleshooting of bug fixes, database issues, and resolve routine security access issues.\n\nNote: Part-time work is prorated in crediting experience (e.g., if you work 20 hours per week for a 12-month period), you will be credited with 6 months of experience.\nNote: Part-time work is prorated in crediting experience (e.g., if you work 20 hours per week for a 12-month period), you will be credited with 6 months of experience.\nIn addition to the experience, to qualify for the 2210 IT Specialist series, applicants must have IT-related experience demonstrating each of the four competencies listed below. Eligibility is based on your responses to questions in the online questionnaire.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\n\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n\nProblem Solving - Uses logic to independently identify solutions for routine to moderately complex IT issues. Anticipates problems, evaluates data, identifies potential vulnerabilities, and formulates solutions.\n\nEducation: \n\nFor the GS-5: Bachelor's degree in any field.\n\nFor the GS-7: Bachelor's degree and superior academic achievement or at least 1 full year of graduate level education. \n\nEducation must demonstrate the competencies/knowledge, skills, and abilities necessary to do the work.\n\nCOMBINING EDUCATION AND EXPERIENCE: Experience and education as described above may be combined to meet the minimum qualification requirements. Note: Experience and education will be computed as percentages of the overall requirements and must equal to 100 percent when combined.\n\nProviding Proof of Education or Substituting Education\nFor information on providing proof of education or substituting education for experience, visit http://www.opm.gov/qualifications/standards/group-stds/gs-cler.asp\n\nIf you are qualifying on the basis of education or satisfying an educational requirement, submit a copy of your transcripts that includes your name, the name of the educational institution, course title(s), number of credits, grade, and date of completion. Unofficial transcripts or screenshots of electronic/web transcripts with the required information will be accepted at the time of application.\n\nYou must submit your transcripts according to the application submission details of this announcement. Documents will not be accepted via email or regular mail. If selected, you may be required to provide your official college transcripts prior to the effective date of the personnel action placing you into the new position.\r\n                                    \n\n\nEducation\n\nSuperior Academic Achievement (S.A.A). is based on (1) class standing, (2) grade-point average, or (3) honor society membership.\n\nClass standing -- Applicants must be in the upper third of the graduating class in the college, university, or major subdivision, such as the College of Liberal Arts or the School of Business Administration, based on completed courses.\nGrade-point average (G.P.A.) -- Applicants must have a grade-point average of:\n\t\n3.0 or higher out of a possible 4.0 (\"B\" or better) as recorded on their official transcript, or as computed based on 4 years of education, or as computed based on courses completed during the final 2 years of the curriculum; or\n3.5 or higher out of a possible 4.0 (\"B+\" or better) based on the average of the required courses completed in the major field or the required courses in the major field completed during the final 2years of the curriculum.\n\n\n\n\n\n\nAdditional information\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. See www.sss.gov.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Information Technology Specialists are valued members of our team.  As an IT Specialist, you will serve as an information technology programmer providing technical guidance in designing, coding, processing, testing, installing, and maintaining computer processes needed to evaluate and manage all phases of regional SSA management/administrative operations via computer systems.\n\nSelectee will serve as an IT Specialist evaluating, developing, and implementing software using programming languages and command language. Will be expected to generate new programs and/or modify existing programs using programming and database management system languages.\n\nOur programmer teams design, develop, maintain, document, and support workload control, processing, and administrative software applications. We provide the full range of electronic data processing, procedures, design, and technology to meet the management and administrative needs of SSA components in the Nation.  We maintain our portfolio of over 70 web-based and client server applications, and over 300 mainframe jobs to support various components.  \n\nExpectations include:\n\nproviding agile application project management, writing and maintaining computer programs, descriptive documentation, and operating instructions;\ndefining user needs, suggesting new computer applications and automated processes, reviewing proposals for major projects, special studies or computer programming requests;\nworking with users of SSA's systems (e.g. mainframe, personal computer, local area network) in the formulation of requirements that result in modification to the system and maintenance of all regional software programs;\ncoding, testing, debugging and documenting programs;\nbeing responsible for the overall effectiveness and efficiency of the software applications and data processing systems, and working with other team members and national developers to fully integrate all segments of a project.\n\nProgramming is done in any of several languages that may include .NET, .Net Core, C#, ColdFusion, JavaScript, JQuery, JAVA, JCL, AJAX, WebSphere, or Microsoft SQL. Knowledge of tools such as Dreamweaver, Visual Studio, Team Foundation Server, Azure DevOps, and GIT are desired.\n\nSkill and/or experience with .NET/.NET Core is a key skill we are looking for.\n\n"}, {"jobID": "715414200", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "IT Specialist (Programmer)", "companyName": "SocialSecurityAdministration", "link": "https://www.usajobs.gov/job/715414200", "jobLocation": {"remote": "not specified", "city": "Chicago", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 63633, "max": 119964}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship required\nSelective Service Registration, if applicable (www.sss.gov)\nFingerprinting and background and/or security investigation required\nJob offers are contingent on fingerprinting and background / security investigation results\nSelectees are required to serve a 1 year probationary period\nRelocation expenses will not be paid\nAll qualification requirements must be met by the closing date of the announcement\n\n\n Qualifications\n\r\n                                        All qualification requirements must be met by the closing date of the announcement.\n\nIf you are using experience to qualify, you must have:\n\nGS-9: 52 weeks of full-time specialized experience independently performing the following tasks:  (1) Developing minor modifications to parts of a Web application on the basis of detailed specifications provided, utilizing ASP.NET, C#, Visual Basic, Microsoft SQL Server, use of HTML and JavaScript; AND (2) Analyzing interrelationships of pertinent components of a Web application; AND (3) Planning and scoping a Web application development schedule; AND 4) Applying application security protocols and 508 requirements.\n\nGS-11: 52 weeks of full-time specialized experience independently performing the following tasks: (1) Developing parts of a Web application based on specifications provided, utilizing ASP.NET, C#, Visual Basic Microsoft SQL Server, use of HTML and JavaScript; AND (2) Developing modifications to parts of a Web application that required significant revisions in the logic or techniques used in the original development; AND (3) Applying policy and guidelines during Web application development to meet detailed requirements; AND (4) Applying application security protocols and 508 requirements.\n\nGS-12: Fifty-two weeks of full-time specialized experience independently performing the following tasks: (1) Programming Web based applications in ASP.NET, C# and Microsoft SQL Server, use of HTML, Visual Basic, and JavaScript; (2) Reviewing proposals for major projects and application programming requests and determining feasibility of such projects; AND (3) Performing studies and advising management on the merits of proposed applications; AND (4) Developing procedures and techniques to perform security and 508 audits on a variety of application development activities; AND (5) Applying standard practices employed by programmers in order to anticipate programming difficulties in alternate design strategies.\n\nNote: Part-time work is prorated in crediting experience (e.g., if you work 20 hours per week for a 12-month period), you will be credited with 6 months of experience.\n\nIn addition to the experience, to qualify for the 2210 IT Specialist series, applicants must have IT-related experience demonstrating each of the four competencies listed below. Eligibility is based on your responses to questions in the online questionnaire.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\n\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n\nProblem Solving - Uses logic to independently identify solutions for routine to moderately complex IT issues. Anticipates problems, evaluates data, identifies potential vulnerabilities, and formulates.\r\n                                    \n\n\nEducation\n\nGraduate Education: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\nGS-9: Master's degree or equivalent graduate degree, OR 2 full years of progressively higher level graduate education leading to a master's degree or equivalent graduate degree.\n\nGS-11: Ph.D. or equivalent doctoral degree, OR 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent.\n\nGS-12: There is no substitution of education for specialized experience at this grade level.\n\nCOMBINING EDUCATION AND EXPERIENCE: Experience and education as described above may be combined to meet the minimum qualification requirements. Note: Experience and education will be computed as percentages of the overall requirements and must equal to 100 percent when combined.\n\nProviding Proof of Education or Substituting Education\nFor information on providing proof of education or substituting education for experience, visit http://www.opm.gov/qualifications/standards/group-stds/gs-cler.asp\n\nIf you are qualifying on the basis of education or satisfying an educational requirement, submit a copy of your transcripts that includes your name, the name of the educational institution, course title(s), number of credits, grade, and date of completion. Unofficial transcripts or screenshots of electronic/web transcripts with the required information will be accepted at the time of application. You must submit your transcripts according to the application submission details of this announcement. Documents will not be accepted via email or regular mail. If selected, you may be required to provide your official college transcripts prior to the effective date of the personnel action placing you into the new position.\r\n                                        \n\n\nAdditional information\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. See www.sss.gov.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nInformation Technology Specialists are valued members of our team. As an IT Specialist, you will serve as an information technology programmer providing technical guidance in designing, coding, processing, testing, installing, and maintaining computer processes needed to evaluate and manage all phases of regional SSA management/administrative operations via computer systems.Selectee will serve as an IT Specialist evaluating, developing, and implementing software using programming languages and command language. Will be expected to generate new programs and/or modify existing programs using programming and database management system languages.Our programmer teams design, develop, maintain, document, and support workload control, processing, and administrative software applications. We provide the full range of electronic data processing, procedures, design, and technology to meet the management and administrative needs of SSA components in the Nation. We maintain our portfolio of over 70 web-based and client server applications, and over 300 mainframe jobs to support various components.Expectations include:\n\nproviding agile application project management, writing and maintaining computer programs, descriptive documentation, and operating instructions;\ndefining user needs, suggesting new computer applications and automated processes, reviewing proposals for major projects, special studies or computer programming requests;\nworking with users of SSA's systems (e.g. mainframe, personal computer, local area network) in the formulation of requirements that result in modification to the system and maintenance of all regional software programs;\ncoding, testing, debugging and documenting programs;\nbeing responsible for the overall effectiveness and efficiency of the software applications and data processing systems, and working with other team members and national developers to fully integrate all segments of a project.\n\nProgramming is done in any of several languages that may include .NET, .Net Core, C#, ColdFusion, JavaScript, JQuery, JAVA, JCL, AJAX, WebSphere, or Microsoft SQL. Knowledge of tools such as Dreamweaver, Visual Studio, Team Foundation Server, Azure DevOps, and GIT are desired.Skill and/or experience with .NET/.NET Core is a key skill we are looking for.\n\n"}, {"jobID": "715065900", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Community Affairs Assistant, CG-0303-07/08/09 (Permanent)", "companyName": "FederalDepositInsuranceCorporation", "link": "https://www.usajobs.gov/job/715065900", "jobLocation": {"remote": "not specified", "city": "Atlanta", "state": "GA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 53005, "max": 104971}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nRegistration with the Selective Service.\nU.S. Citizenship is required.  \nEmployment Conditions.\nCompletion of Financial Disclosure may be required.\n\n\n Qualifications\n\nQualifying experience may be obtained in the private or public sector. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic, religious/spiritual; community; student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Additional qualifications information can be found here.\n\nCG-07: To qualify, applicants must have completed at least one year of specialized experience equivalent to at least the 06 grade level or above in the Federal service. Specialized experience is experience using word processing and database software to produce written materials, organize materials for training or outreach events, and respond to telephone inquiries.\n \nCG-08: To qualify, applicants must have completed at least one year of specialized experience equivalent to at least the 07 grade level or above in the Federal service. Specialized experience is experience using word processing and database software to produce written materials, conducting research to create reports for management, and organizing materials for outreach or training events.\nCG-09: To qualify, applicants must have completed at least one year of specialized experience equivalent to at least the 08 grade level or above in the Federal service. Specialized experience is experience using word processing and database software to produce written materials, conducting research to create reports for management, organizing materials for outreach or training events, and participating in the delivery of training sessions for outreach or training events.\nApplicants must have met the qualification requirements (including selective placement factors – if any) for this position within 30 calendar days of the closing date of this announcement.\nApplicants eligible for ICTAP (Interagency Career Transition Assistance Program) must achieve a score of 85 “well qualified” for this position. For more information, Click Here.\n\n\n\nEducation\n\nThere is no substitution of education for the experience for this position.\n\n\n\nAdditional information\n\nAnnouncement amended to extend the closing date.\nIf selected, you may be required to serve a probationary or trial period as applicable to appointment type.\nTo read about your rights and responsibilities as an applicant for Federal employment,  click here.\nThe FDIC offers position-specific telework options. This position is eligible for the following: Traditional Telework, Expanded Telework, and the Home Based Option. For more information, please reference the above-mentioned telework options Here.\nAdditional selections may be made from this vacancy announcement to fill identical vacancies that occur subsequent to this announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nIn addition to the regular benefits offered by Federal agencies, the FDIC offers additional benefits to its employees. These benefits, some at minimal cost, are some of the best and most competitive in both the private and public sectors.\nTo find out more,  click here.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThe Community Affairs Branch (CAB) serves the FDIC, the lending community, community organizations, other partners and the public by helping financial institutions identify and meet their community's credit and other economic inclusion needs.  As a Community Affairs Assistant, the incumbent reports to the Community Affairs Regional Manager (RM) and performs various tasks necessary to carry out the mission of the national and regional CAB.  The incumbent will be responsible for supporting regional staff in all events and activities; to include all elements of the FDIC economic inclusion initiatives, Community Reinvestment Act (CRA) and community development. as well as other priorities and goals as they are assigned.\nAt the full performance level, major duties include:  \n\nComposes and/or reviews and edits letters and other non-complex or non-controversial communication materials needed to conduct community development outreach activities to support the examination staff.\nConducts data research on demographics, financial institutions, community development organizations, initiatives and trends as applicable. Compiles and organizes research to align with program/project goals.\nAssists with compiling and editing regional business plans, event write-ups for web/social media publishing, and various other documents.\nDesigns and delivers CRA, community development, economic inclusion and other educational or marketing materials, either individually or in conjunction with other DCP regions, government and regulatory agencies, and private organizations, for the benefit of examiners, bankers, and community representatives.\nRepresents the FDIC at conferences and other meetings as an Exhibitor Attendant to showcase FDIC economic inclusion and community development product offerings.\nAttends meetings with community- and faith-based organizations, government officials, bankers, and other entities for the purpose of building alliance memberships or otherwise promoting Community Affairs’ programmatic goals.\nProvides support and assistance to Community Affairs team members in virtual and in-person events including webinars, conferences, and industry discussion panels, coordinating with technical and support teams, and organizing set-ups and demo-testing.\nCompiles and edits regular and ad hoc data reports on regional outreach events/activities. Uploads, edits, and maintains stakeholder contact lists for events and future community contacts for examiners.\n\n\n"}, {"jobID": "715724200", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "Senior Information Technology Specialist (Network Services)", "companyName": "PretrialServicesAgency", "link": "https://www.usajobs.gov/job/715724200", "jobLocation": {"remote": "not specified", "city": "WashingtonDC", "state": "DC", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 132368, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Conditions of Employment\n\n1. Must be a U.S. Citizen\n2. Males born after 12-31-59 must be registered for Selective Service\n3. Suitable for Federal employment, determined by a background investigation\n4. May be required to successfully complete a probationary period, if not already completed\n5. All applicants are subject to a comprehensive criminal background investigation, and required to submit to urinalysis to screen for illegal drug use prior to appointment\n6. All Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choice\n\nThis announcement may be used to fill additional vacancies.\n\nTelework: PSA supports the use of telework to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework based on supervisory approval and in accordance with the Agency's telework policy.\n\nVirtual Position: This position is NOT eligible for remote work\n\nBargaining Unit Status and Chapter: Not Covered, AFGE Local 1456\n\n\n\n\n\n\n.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, you must possess IT related experience in each of the required competencies And meet the specialized experience requirement listed below.\n\nCompetencies: You must have IT related experience demonstrating each of the four competencies listed below. Experience may be paid or unpaid experience and/or completing of specific, intensive training (for example, IT certification), as appropriate.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nAND \nSpecialized Experience: To qualify for the GS-14 grade level, you must possess one year of specialized experience. Specialized experience is defined as experience developing and/or tracking requirements for system performance, moderate to extensive experience with VMWare, and consulting with customers; experience working on projects that include but is not limited to cybersecurity, application development, IT enterprise risk management and cloud modernization.\n\nNOTE: Your resume must clearly show the specialized experience related to this position. Failure to demonstrate how you possess the experience requirements will result in an \"Ineligible\" rating.\r\n                                    \n\n\nEducation\n\r\n                                            There is no education substitution at this grade level.\r\n                                        \n\n\nAdditional information\n\n1. If you are an eligible Interagency Career Transition Assistance Program (ICTAP) applicant, you may apply for special selection over other applicants for this position. Individuals who have special priority selection rights under the ICTAP must be well-qualified for the position. To be well qualified, applicants must satisfy all qualification requirements for the position and meet the well-qualified level (mid-level) of the crediting plan for all factors. ICTAP eligibles must submit one of the following as proof of eligibility for the special selection priority: a separation notice, SF-50, Notice of Personnel Action, documenting separation, an agency certification that you cannot be placed after injury compensation has been terminated, an OPM notification that your disability annuity has been terminated, OR a Military Department or National Guard Bureau notification that you are retired under 5 U.S.C. Section 833(h) or Section 8456.\n\n2. If you are a veteran with preference eligibility and you are claiming 5-point veterans' preference, you should attach a copy of your DD-214 (unedited long version) or other proof of eligibility. If you are claiming 10-point veterans' preference, you must attach an SF-15, \"Application for 10-point Veterans' Preference\" plus the proof required by that form.\n\n3. If you are a male applicant who was born after 12/31/59 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency.\n\n4. Reasonable Accommodation, this agency provides reasonable accommodation to applicants with disabilities. If you need a reasonable accommodation for any part of this application and hiring process, please notify the agency. The decision on granting reasonable accommodation is made on a case-by-case basis.\n\n5. All qualification requirements must be met by the closing date of this announcement. Additional information on the qualification requirements is outlined in the OPM Qualifications Standards Handbook of General Schedule Positions. It is available for your review in our office, in other Federal agency personnel offices, and on OPM's web site at http://www.opm.gov/qualifications.\n\n6. Equal Opportunity Employer: The Pretrial Services Agency is an equal opportunity employer. Selection for this position will be based solely on merit without regard to race, color, religion, age, gender, national origin, political affiliation, disability, sexual orientation, marital or family status or other non-merit based factors.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As a Senior Information Technology Specialist (Network Services), you will\n\n1. Responsible for complex projects developing and delivering network services to PSA. Implement configuration management plans on significant local projects that support the PSA's IT mission. Design and configure network systems, ensuring compatibility with existing systems and with the Agency enterprise architecture. Evaluate new hardware or software and recommends solutions for PSA requirements. Provide expert advice in network systems and in strategies for integration of network services with internal and external systems and services.\n2. Ensure the migration and oversight of the PSA Cloud initiatives. Ensure migration and oversight of Infrastructure as a Service (IaaS), Platform as a Service (PaaS) in support of the Agency's infrastructure, and applications hosting environments to include Software as a Service (SaaS). Coordinate the managed services capabilities with service providers to include DOJ and CSOSA.\n3. Serve the IT Technical Project Lead of ad hoc teams convened to provide quick responses to special projects and studies that cut across OIT units and functions to include cybersecurity, application development, IT enterprise risk management, and cloud modernization. Continuously available to clarify and detailed technical issues to resolve and mitigate potential risks to the PSA IT eco-system. Proactively communicates any issues that require escalation to PSA senior management. Lead the work of other IT specialists on projects; provide advice on work methods and problem solving; work with the supervisor on performance management issues, providing input to performance appraisals for team members.\n4. Design, implement and document IT infrastructure schemes for applying new releases and upgrades to the PSA environment. Oversee and configure, install and maintain network hardware and software including servers, storage area network, routers, access points, and other network peripherals. Responsible for acquiring new or upgraded systems, services, or components replacements. Ensure hardware and software upgrades and installs are properly configured, tested, deployed, and supported. Analyze network traffic patterns and install network software fixes and upgrades. Maintain current awareness of emerging trends in network technologies and identifies those with potential application to PSA.\n5. Manage the Agency Active Director and Active Directory for Federal Systems to facilitate implementation of PIV compliance as a part of NIST 800-63. Serve as the PSA Agency lead in the administration of the PSA email capabilities as part of the overall Microsoft O365 Cloud SaaS environment.\n6. Oversee the configuring, installing and deploying of standardized images for hardware and software including desktops, laptops, printers, video cameras, sound systems, and other peripherals. Ensure systems are up to date and secure; identify the need for new or upgraded systems, services, or components. Maintain current awareness of emerging security threats in network and desktop technologies and addresses those that may impact PSA.\n7. Ensure implementation of ongoing operations in back-up and disaster recovery plans for network systems. Collect data and analyze real and potential risk for continuity of operations. Recommend solutions to address vulnerable areas and minimize risk.\n8. Implement processes for automated inventory of hardware and software for desktop stations and the network. Ensure proper application of relevant PSA policy and standards for control, distributing and use of hardware and software. Conduct inventory reviews and maintenance.\n9. Provide third-tier helpdesk services, assuring that assistance is prompt and responsive and that recurring user problems are identified and resolved. Identify trends and recommends approaches to improve services to customers.\n10. Develop approaches and methods for provision of technical guidance and continuing training to agency staff in use of the network. Analyze helpdesk and other customer service data to determine kinds of training needed and prepares training manuals and references for customers.\n11. Manage the PSA Cloud platform consoles. Ensure compliance with NIST Security framework. Ensure the enforcement of IT Security standards and network assets are protected to support the Agency's information technology technical infrastructure.\n\n"}, {"jobID": "715666200", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "COMPUTER ASSISTANT", "companyName": "AirEducationandTrainingCommand", "link": "https://www.usajobs.gov/job/715666200", "jobLocation": {"remote": "not specified", "city": "RandolphAFB", "state": "TX", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 57853, "max": 75206}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nPCS expenses are not authorized.\nThis position is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nMust be able to obtain and maintain a secret Clearance.\nThis position may be required to work other than normal duty hours.\nThis position requires a pre-employment physical examination.\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions. https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=Group-Standards\n\nSPECIALIZED EXPERIENCE FOR CURRENT/PREVIOUS FEDERAL EMPLOYEES: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-7, or equivalent in other pay systems. Examples of specialized experience includes knowledge of supply systems, operational policy, and procedures. Knowledge of computer equipment, internal computer processes, application and utility programs, and magnetic media. Knowledge of a wide range of computer techniques, requirements, sources, and procedures. Knowledge of a wide range of analytical and diagnostic methods, procedures, and principles to identify system failures, take corrective actions to resume normal operations, and implement procedures. Knowledge of some elements of programming, systems analysis, and equipment operations. Knowledge of current system software supported at the organization to include operating system and application software packages. Knowledge of Hypertext Markup Language (HTML). Skill in ordering and interpreting system dumps, ordering and implementing back-up recovery procedures, reallocating equipment, recognizing priority contentions, and removing work from an operating schedule. Skill in diagnosing and resolving problems with telecommunications, Local Area Network, and Wide Area Network systems.\n\nSPECIALIZED EXPERIENCE FOR APPLICANTS WITH NO PREVIOUS FEDERAL EMPLOYMENT: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-8, or equivalent in other pay systems. Examples of specialized experience includes knowledge of supply systems, operational policy, and procedures. Knowledge of computer equipment, internal computer processes, application and utility programs, and magnetic media. Knowledge of a wide range of computer techniques, requirements, sources, and procedures. Knowledge of a wide range of analytical and diagnostic methods, procedures, and principles to identify system failures, take corrective actions to resume normal operations, and implement procedures. Knowledge of some elements of programming, systems analysis, and equipment operations. Knowledge of current system software supported at the organization to include operating system and application software packages. Knowledge of Hypertext Markup Language (HTML). Skill in ordering and interpreting system dumps, ordering and implementing back-up recovery procedures, reallocating equipment, recognizing priority contentions, and removing work from an operating schedule. Skill in diagnosing and resolving problems with telecommunications, Local Area Network, and Wide Area Network systems.\n\nFEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-­grade requirements to be considered eligible. One year at the GS-07 level is required to meet the time-in-grade requirements for the GS-09 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of automated data processing and networking standards, policies, and techniques.\n\n2. Knowledge of computer hardware and software systems and their interfaces; and higher level programming languages and other job control languages.\n\n3. Knowledge of information processing sequences, controls, and procedures.\n\n4. Knowledge of facility environment and infrastructure to support computer systems, and to provide user support.\n\n5. Ability to use and maintain a computer system, equipment, and software; analyze computer network, software, and hardware problems and develop effective and economical solutions; and train users on new computer systems.\n\n6. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11904718.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        1. Administers and maintains Logistics Readiness Squadron information systems hardware.\n\n2. Recommends selection of, installs, upgrades, and maintains software.\n\n3. Serves as the Logistics Readiness Squadron network security officer. \n\n4. Provides guidance, assistance, and training to customers.\r\n                                    \n"}, {"jobID": "715326100", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Program Analyst", "companyName": "U.S.FishandWildlifeService", "link": "https://www.usajobs.gov/job/715326100", "jobLocation": {"remote": "not specified", "city": "LocationNegotiableAfterSelection", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 128043}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. Citizen or National.\nResume (See \"Required Documents\").  Failure to provide ALL required information on your resume will result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all information is provided on resume.\nEligibility and Supporting documents - You will ONLY be considered for the eligibilities that you select \"yes\" to AND submit the required supporting documentation, as listed in the Required Documents section.\nSuitability for employment, as determined by background investigation\nProbationary Period: Selectees may be required to successfully complete a probationary period.\nIndividuals assigned male at birth after 12-31-59 must be registered for Selective Service. To verify registration visit SSS.gov.\n\n\n Qualifications\n\r\n                                        Only experience and education obtained by 04/07/2023 will be considered.\n\nIn order to qualify for this position you must possess the Minimum Qualification.\n\nMinimum Qualification [GS-12]\n\nOne year of specialized experience comparable in scope and responsibility equivalent to grade GS-11 in the Federal service. Experience may include: 1) Defining and documenting business processes in software development requirements gathering sessions. 2) Identifying areas for improvement, anticipate requirements, problem solve and/or implement of solutions. 3) Conducting development testing of new systems and/or training initiatives.\n\nMinimum Qualification [GS-13]\n\nOne year of specialized experience comparable in scope and responsibility equivalent to grade GS-12 in the Federal service. Experience may include: 1) Defining and documenting business processes in software development requirements gathering sessions. 2) Identifying areas for improvement, anticipate requirements, problem solve and/or implement of solutions. 3) Conducting development testing of new systems and/or training initiatives. 4) Developing and implementing long range business or project management plans.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nPROOF OF EDUCATION: All applicants who are using education or a combination of education and experience to qualify must submit copies of official or unofficial transcripts which include grades, credit hours earned, major(s), grade point average or class ranking, institution name, and student name.  If any required coursework is not easily recognizable on transcripts, or if you believe a portion of a particular course can be credited toward meeting an educational requirement, you must also provide a memorandum on letterhead from the institution's registrar, dean, or other appropriate official stating the percentage of the course that should be considered to meet the requirement and the equivalent number of units. Unofficial transcripts are acceptable; however, if you are selected for the position, you will be required to produce the original official transcripts.\n\nPASS/FAIL COURSES: If more than 10 percent of your undergraduate course work (credit hours) were taken on a pass/fail basis, your claim of superior academic achievement must be based upon class standing or membership in an honor society.\n\nGRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study.\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\nThe salary will be based upon duty station and locality pay once selected. Locality tables may be found at: www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/2023/general-schedule?trk=public_post_comment-textPlease Note: If selected, you may be placed at a regional office, field office, current duty station, or other DOI-owned or leased worksite at the discretion of management. Additions questions regarding placement should be reserved for the interview process.\n\nPCS INFORMATION: \n-No PCS entitlements authorized\n\nTELEWORK:\nThis position is suitable for telework and may be allowed to telework with supervisory approval.\n\nAdditional Vacancies: One or more positions may be filled from applications received under this announcement in the advertised office or other U.S. Fish & Wildlife Service offices in the local commuting area.\nCareer Transition Assistance Plan (CTAP) or Interagency Career Transition Assistance Plan (ICTAP):Department of Interior (DOI) Career Transition Assistance Plan (CTAP) procedures apply in filling this vacancy. CTAP/ICTAP provides placement assistance to permanent Federal employees who are surplus, displaced, or involuntarily separated. Applicants claiming CTAP/ICTAP eligibility must submit a copy of their most recent performance appraisal, proof of eligibility, and most current SF-50 noting position, grade level, and duty location with their application. To be considered under CTAP/ICTAP, applicants must be well-qualified (i.e., meet the minimum qualification requirements, including any selective placement factors; education, and experience requirements), score at least 85 on the assessment questionnaire, and be able to perform the duties of the position upon entry. For information on CTAP and ICTAP click here\n\nReasonable Accommodation (RA) Requests: If you believe you have a disability (i.e., physical or mental), covered by the Rehabilitation Act of 1973 as amended and Americans with Disabilities Act 1990 as amended, that would interfere with completing the USA Hire Competency Based Assessments, you will be granted the opportunity to request a RA in your online application. Requests for RA for the USA Hire Competency Based Assessments and appropriate supporting documentation for RA must be received prior to starting the USA Hire Competency Based Assessments. Decisions on requests for RA are made on a case-by-case basis. If you meet the minimum qualifications of the position, after notification of the adjudication of your request, you will receive an email invitation to complete the USA Hire Competency Based Assessments. You must complete all assessments within 48 hours of receiving the URL to access the USA Hire Competency Based Assessments, if you received the link after the close of the announcement. To determine if you need a RA, please review the Procedures for Requesting a Reasonable Accommodation for Online Assessments here: https://help.usastaffing.gov/Apply/index.php?title=Reasonable_Accommodations_for_USA_Hire \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As a Program Analyst your duties will include, but are not limited to, the following:\n\nWork with cross-programmatic team to transform business processes from paper-based to digital.\nUse a variety of communication tools to translate biological business and customer service needs into technical language to enable software development to meet the needs.\nUpdate and maintain a development backlog for a multifaceted project. \nAssist with customer support activities including training, software demonstrations, report generation, and testing of new solutions.\n\n\n"}, {"jobID": "712189200", "origin_search": "https://www.usajobs.gov/", "posted": "03/13/2023", "jobTitle": "IT SPECIALIST (APPSW)", "companyName": "U.S.MarineCorps", "link": "https://www.usajobs.gov/job/712189200", "jobLocation": {"remote": "not specified", "city": "Indianapolis", "state": "IN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 69996, "max": 108669}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nPer the preliminary nationwide injunction on E.O. 14043, COVID-19 vaccinations will not be implemented or enforced.  For more information on vaccine status and workplace safety protocol requirements see Additional Information below.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nThis position is eligible for part time, full time or ad-hoc telework at the discretion of management.\nThis position is designated as a Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area 632 within 12 months of appointment.\nThis position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.\nThis position requires rotating shift work.\nThis is a bargaining unit position.\n\n\n Qualifications\n\nGS-11\nYour resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: Advanced working experience in all facets of software development lifecycle (SDLC) design, programming and testing.\n\nAND in addition, demonstrate the four competencies below.\n\n1.Attention to Detail - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Takes a thorough, conscientious approach to work performed.\n\n2.Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. IT-related experience demonstrating this competency include: Respond to problem reports.\n\n3.Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Provide technical guidance and training.\n\n4.Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Identifies problem, ascertains root cause and impact, and provide recommendations for resolution.\n\nGS-12\nYour resume must demonstrate at least one year of specialized experience at or equivalent to the GS11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: Advanced working experience (3+ years) in all facets of software development lifecycle (SDLC) design, programming and testing; AND working experience (3+ years) of programming languages COBOL and JAVA and/or Advanced working experience (3+ years) in software audit/security.\n\nAND in addition, demonstrate the four competencies below:\n\n1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: preparing system documentation for purposes of improving software development process as needed.\n\n2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. IT-related experience demonstrating this competency include: supporting efforts designed to identify potential improvements in the way information technology is applied to key business functions.\n\n3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: communicating clearly and effectively, both verbally and in writing, with peers and leadership within the organization as well as other federal agencies, military services and throughout the DOD.\n\n4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: analyzing and resolving system or software failures and causes of failures to identify and implement preventative measures.\n\nAdditional qualification information can be found from the following Office of Personnel Management web site: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\nFor the GS-11:\nIn lieu of experience, applicants may qualify if they meet the following positive education qualifications requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual:\n\nI have successfully completed a Ph.D. or equivalent doctoral degree from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management.\n\nOR\n\nI have successfully completed 3 full years (54 hours) of progressively higher graduate level education leading to a Ph.D. or equivalent doctoral degree from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management; or, graduate education that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\nSuch education must demonstrate the knowledge, skills, and abilities necessary to do the work.\n\nAre you using your education to qualify? For positions requiring positive education requirements, or if you are using education to meet all or part of the qualification requirements, you must submit a copy of your transcripts or an itemized list of college courses which includes equivalent information from the transcript (course title, semester/quarter hours, and grade/degree earned). See OPM's General Policies for information on crediting education.\r\n                                        \n\n\nAdditional information\n\n**This position has been designated as a Cyber IT/cybersecurity Workforce position, in the DoD Cyber Workforce Framework(DCWF) role of SYSTEMS DEVELOPER 632, proficiency level basic, and as a condition of employment incumbents of this position are required to comply with the DON Cyber IT/CSWF program requirements of SECNAVM-5239.2 which include:\n\n1. The incumbent participate in a continuous learning (CL) program as described in SECNAVINST 5239.20A and SECNAV M-5239.2. An annual 20 hour minimum of Cyber Workforce related continuous learning must be documented in a current individual development plan signed by both the employee and supervisor.\n\nAND\n\n2. The incumbent must obtain the required credentials within 12 months of appointment and maintain those credentials as described in SECNAV M-5239.2 for DCWF role of Systems Developer 632, IT Specialist, proficiency level Basic. For more information, please review SECNAV M-5239.2 Chapter 3, paragraph b (1) (g)\n______________________________________________________________________________________________________________________\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nVacancies filled from this announcement may be filled at any grade level listed.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nVeteran's preference does not apply when selecting individuals under the specific hiring authority addressed in the Summary section of this announcement. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will analyze functional and technical requirements of proposed or existing IT systems to determine avenues of development or modification necessary to meet mission objectives.\nYou will prepare system change/programming specifications, and specify programming instructions, inputs and outputs, structures, and other analytical products to document the functional and technical requirements.\nYou will prepare design documents and participate in critical design reviews to study and verify impacts on current systems.\nYou will prepare and execute tests for system or subsystem software validation.\nYou will prepare system documentation for purposes of improving software development processes in accordance with acceptable industry standards (ex. Capability Maturity Model).\n\n"}, {"jobID": "695909900", "origin_search": "https://www.usajobs.gov/", "posted": "12/20/2022", "jobTitle": "Health System Specialist (CAC)", "companyName": "IndianHealthService", "link": "https://www.usajobs.gov/job/695909900", "jobLocation": {"remote": "not specified", "city": "RedLake", "state": "MN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 69107, "max": 107680}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Must pass pre-employment examination.\nSelectee may be subject to a probationary/trial period\nESEP appointees typically serve a two year trial period\nU.S. Citizenship is required\nSelective Service Registration is required for males born after 12/31/1959\n\nThis is a designated position covered by Public Law 101-630, requiring contact or control over Indian children. Due to this requirement, the agency must ensure that persons hired for these positions have not been found guilty of or pleaded nolo contendere or guilty to certain crimes.\n\nMeasles and Rubella immunization required for selectees born after 1957 and seasonal influenza immunization is required for all staff working in Indian Health Service health care facilities.\n\nCOVID-19 vaccination is required for all selectees prior to entrance on duty.\n\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.\n\nYou will need to set up direct deposit so we can pay you.\n\nBackground Investigation: If you are selected for this vacancy, you must undergo a pre-employment fingerprint check and background investigation. Fingerprint results and background investigation documentation must be cleared prior to hire. After you begin your employment, your continued employment is contingent upon the outcome of a complete background investigation as determined by the sensitivity level of your position. The investigation must find that you are suitable for Federal employment in your position. If you are found not suitable, you will be terminated after you begin work. If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or subject to possible criminal charges. You may be subject to a credit check as a part of the background investigation process.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, your resume must state sufficient experience and/or education, to perform the duties of the specific position for which you are applying.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; social). You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nBASIC REQUIREMENT(S):\nUndergraduate and Graduate Education:\nMajor study -- hospital administration, public health administration, or related fields such as business or public administration with course work in health care administration.\nOR\nSpecial Provision for Inservice Placement: Successful completion of an agency-sponsored on-the-job training program that may be substituted for qualifying experience, provided it included a formal individualized training plan. Such a training program must have been conducted in an operating health care system and included:\n\nAssignments providing a knowledge of basic health system administration philosophies, practices, and procedures, and basic government administrative policies and requirements;\nPractical assignments providing an opportunity to apply health system administration skills and principles (as the individual progresses, work assignments must be characteristic of the grade level to which he or she is assigned); and\nOversight by an experienced health system administrator with periodic evaluation of the individual's progress and appropriate adjustment of the training program.\n\nMINIMUM QUALIFICATIONS:\nYour resume must demonstrate at least one (1) year of specialized experience equivalent to at least the next lower grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks:\n\nGS-11 - 1 year of specialized experience with the particular knowledge, skills and abilities to successfully perform the duties of this position. This experience is related to the work of the position and equivalent to at least the GS-09 level in the Federal service as described in the vacancy announcement. Examples include: Progressively responsible analytical or administrative, or clinical management or supervisory experience in the health care field. This work may have been performed in an operating health care facility or directional authority over such facilities. Work must have involved a close working relationship with facility managers and analysis and/or coordination of administrative, clinical, or other service activities, and provided knowledge of the following: Missions, organizations, programs, and requirements of health care delivery systems; Regulations and standards of various regulatory and credentialing groups; and Government-wide, agency, and facility systems and requirements in various administrative areas such as budget, personnel, and procurement.\nOR\nCompleted a Ph.D. or equivalent doctoral degree or 3 full years (54 semester hours) of progressively higher level graduate education leading to such a degree, such education must demonstrate the knowledge, skills, and abilities necessary to do the work or LL.M., if related.\nOR\nHave a qualifying combination of the specialized experience described in A and the education described in B. To determine if you qualify under this combination first divide your total months of qualifying experience by 12. Then divide your semester hours of graduate education beyond 2 years by 18. (Note: Only education in excess of the second year is creditable toward meeting the experience requirement when combining experience and education.) Finally, add the two percentages. The total percentage must equal at least 100 percent to qualify. Note: You must provide copies of your graduate transcripts.\n\nGS-12 - 1 year of specialized experience with the particular knowledge, skills and abilities to successfully perform the duties of this position. This experience is related to the work of the position and equivalent to at least the GS-11 level in the Federal service as described in the vacancy announcement. Examples include: Progressively responsible analytical or administrative, or clinical management or supervisory experience in the health care field. This work may have been performed in an operating health care facility or a higher organizational echelon with advisory or directional authority over such facilities. Work must have involved a close working relationship with facility managers and analysis and/or coordination of administrative, clinical, or other service activities, and provided knowledge of the following: Missions, organizations, programs, and requirements of health care delivery systems; Regulations and standards of various regulatory and credentialing groups; and Government-wide, agency, and facility systems and requirements in various administrative areas such as budget, personnel, and procurement.\n\nTime In Grade\nFederal employees in the competitive service are also subject to the Time-In-Grade Requirements: Merit Promotion (status) candidates must have completed one year of service at the next lower grade level. Time-In-Grade provisions do not apply under the Excepted Service Examining Plan (ESEP).\n\nYou must meet all qualification requirements within 30 days of the closing date of the announcement. \n\n\n\nEducation\n\r\n                                            This position has an education requirement. You are strongly encouraged to submit a copy of your transcripts or a list of your courses including titles, credit hours completed, and grades. Unofficial transcripts will be accepted in the application package. Official transcripts will be required from all selectees prior to receiving an official offer.\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education may be credited. Applicants can verify accreditation at the following website: https://www.ed.gov/accreditation.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nOPEN UNTIL FILLED: THIS ANNOUNCEMENT IS OPEN UNTIL THE VACANCY IS FILLED. IT MAY BE EXTENDED OR CLOSED PRIOR TO THE CURRENT CLOSING DATE. APPLICATIONS MUST BE SUBMITTED BY 11:59 EST TUESDAY TO BE CONSIDERED, CUT OFF DATE FOR APPLICATIONS IS 01/04/2023 AND EVERY TUESDAY THERE AFTER.\n\nThis position is being announced concurrently under the Delegating Examining Plan. Please review vacancy announcement number IHS-23-BJ-11771548-DE; for eligibility requirements. NOTE: Applicants must apply separately for each announcement in order to be considered.\n\nPer IHS policy (SGM 21-04) IHS selectees to positions located in Federally operated hospitals, health centers, and clinics must be fully vaccinated for COVID-19 before entry on duty or have IHS approve a medical or religious exemption. If an exemption is approved then wearing a face mask and regular testing for COVID-19 will be required. Your Human Resources Specialist will provide a list of documents acceptable as vaccination proof and instructions on how to submit your vaccination documentation or how to request a medical or religious exemption, if needed.\n\nAdditional selection(s) of candidates may be possible within 90 days from the date the certificate of eligibles was issued for this announcement.\n\nFederal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. IHS may offer newly-appointed Federal employees credit for their directly related previous non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave.\n\nRecruitment or relocation incentives may be authorized. At least a 6 month service agreement will be required.\n\nThis position meets the criteria specified in pillar number one of the five pillars of the PHS Commissioned Corps. PHS Commissioned Officers interested in performing the duties of this position within the Commissioned Corps MUST apply online under the merit promotion announcement indicated above in order to receive consideration. For more information on PHS Commissioned Corps, visit the website at: https://www.usphs.gov/.\n\nThis position has promotion potential to the GS-12 grade level. Promotion to the next grade level is at management's discretion and is based on your demonstrated ability to perform the higher level duties, the continuing need for the higher level duties, and \"Regulatory/Administrative\" approval. Promotion to the next higher grade level is not guaranteed and no promise of promotion is implied.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nImplementation and maintenance of Electronic Health Record and related systems for inpatient and/or outpatient services to include coordination of existing accreditation and reporting requirements.\nCoordination, liaison and support to administration, clinical staff, HIM, and MIS on all functions relating to EHR.\nTraining of clinical staff on a range of application packages including EHR, Health Summary, clinical orders and notes, and various report functions.\n\n\n"}, {"jobID": "695918500", "origin_search": "https://www.usajobs.gov/", "posted": "12/20/2022", "jobTitle": "Health System Specialist (CAC)", "companyName": "IndianHealthService", "link": "https://www.usajobs.gov/job/695918500", "jobLocation": {"remote": "not specified", "city": "RedLake", "state": "MN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 69107, "max": 107680}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Must pass pre-employment examination.\nSelectee may be subject to a probationary/trial period\nESEP appointees typically serve a two year trial period\nU.S. Citizenship is required\nSelective Service Registration is required for males born after 12/31/1959\n\nThis is a designated position covered by Public Law 101-630, requiring contact or control over Indian children. Due to this requirement, the agency must ensure that persons hired for these positions have not been found guilty of or pleaded nolo contendere or guilty to certain crimes.\n\nMeasles and Rubella immunization required for selectees born after 1957 and seasonal influenza immunization is required for all staff working in Indian Health Service health care facilities.\n\nCOVID-19 vaccination is required for all selectees prior to entrance on duty.\n\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.\n\nYou will need to set up direct deposit so we can pay you.\n\nBackground Investigation: If you are selected for this vacancy, you must undergo a pre-employment fingerprint check and background investigation. Fingerprint results and background investigation documentation must be cleared prior to hire. After you begin your employment, your continued employment is contingent upon the outcome of a complete background investigation as determined by the sensitivity level of your position. The investigation must find that you are suitable for Federal employment in your position. If you are found not suitable, you will be terminated after you begin work. If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or subject to possible criminal charges. You may be subject to a credit check as a part of the background investigation process.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, your resume must state sufficient experience and/or education, to perform the duties of the specific position for which you are applying.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; social). You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nBASIC REQUIREMENT(S):\nUndergraduate and Graduate Education:\nMajor study -- hospital administration, public health administration, or related fields such as business or public administration with course work in health care administration.\nOR\nSpecial Provision for Inservice Placement: Successful completion of an agency-sponsored on-the-job training program that may be substituted for qualifying experience, provided it included a formal individualized training plan. Such a training program must have been conducted in an operating health care system and included:\n\nAssignments providing a knowledge of basic health system administration philosophies, practices, and procedures, and basic government administrative policies and requirements;\nPractical assignments providing an opportunity to apply health system administration skills and principles (as the individual progresses, work assignments must be characteristic of the grade level to which he or she is assigned); and\nOversight by an experienced health system administrator with periodic evaluation of the individual's progress and appropriate adjustment of the training program.\n\nMINIMUM QUALIFICATIONS:\nYour resume must demonstrate at least one (1) year of specialized experience equivalent to at least the next lower grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks:\n\nGS-11 - 1 year of specialized experience with the particular knowledge, skills and abilities to successfully perform the duties of this position. This experience is related to the work of the position and equivalent to at least the GS-09 level in the Federal service as described in the vacancy announcement. Examples include: Progressively responsible analytical or administrative, or clinical management or supervisory experience in the health care field. This work may have been performed in an operating health care facility or directional authority over such facilities. Work must have involved a close working relationship with facility managers and analysis and/or coordination of administrative, clinical, or other service activities, and provided knowledge of the following: Missions, organizations, programs, and requirements of health care delivery systems; Regulations and standards of various regulatory and credentialing groups; and Government-wide, agency, and facility systems and requirements in various administrative areas such as budget, personnel, and procurement.\nOR\nCompleted a Ph.D. or equivalent doctoral degree or 3 full years (54 semester hours) of progressively higher level graduate education leading to such a degree, such education must demonstrate the knowledge, skills, and abilities necessary to do the work or LL.M., if related.\nOR\nHave a qualifying combination of the specialized experience described in A and the education described in B. To determine if you qualify under this combination first divide your total months of qualifying experience by 12. Then divide your semester hours of graduate education beyond 2 years by 18. (Note: Only education in excess of the second year is creditable toward meeting the experience requirement when combining experience and education.) Finally, add the two percentages. The total percentage must equal at least 100 percent to qualify. Note: You must provide copies of your graduate transcripts.\n\nGS-12 - 1 year of specialized experience with the particular knowledge, skills and abilities to successfully perform the duties of this position. This experience is related to the work of the position and equivalent to at least the GS-11 level in the Federal service as described in the vacancy announcement. Examples include: Progressively responsible analytical or administrative, or clinical management or supervisory experience in the health care field. This work may have been performed in an operating health care facility or a higher organizational echelon with advisory or directional authority over such facilities. Work must have involved a close working relationship with facility managers and analysis and/or coordination of administrative, clinical, or other service activities, and provided knowledge of the following: Missions, organizations, programs, and requirements of health care delivery systems; Regulations and standards of various regulatory and credentialing groups; and Government-wide, agency, and facility systems and requirements in various administrative areas such as budget, personnel, and procurement.\n\nTime In Grade\nFederal employees in the competitive service are also subject to the Time-In-Grade Requirements: Merit Promotion (status) candidates must have completed one year of service at the next lower grade level. Time-In-Grade provisions do not apply under the Excepted Service Examining Plan (ESEP).\n\nYou must meet all qualification requirements within 30 days of the closing date of the announcement. \n\n\n\nEducation\n\r\n                                            This position has an education requirement. You are strongly encouraged to submit a copy of your transcripts or a list of your courses including titles, credit hours completed, and grades. Unofficial transcripts will be accepted in the application package. Official transcripts will be required from all selectees prior to receiving an official offer.\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education may be credited. Applicants can verify accreditation at the following website: https://www.ed.gov/accreditation.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nOPEN UNTIL FILLED: THIS ANNOUNCEMENT IS OPEN UNTIL THE VACANCY IS FILLED. IT MAY BE EXTENDED OR CLOSED PRIOR TO THE CURRENT CLOSING DATE. APPLICATIONS MUST BE SUBMITTED BY 11:59 EST TUESDAY TO BE CONSIDERED, CUT OFF DATE FOR APPLICATIONS IS 01/04/2023 AND EVERY TUESDAY THERE AFTER.\n\nThis position is being announced concurrently under the Excepted Service Examining Plan/Merit Promotion Plan. Please review vacancy announcement number IHS-23-BJ-11771547-ESEP/MP for eligibility requirements. NOTE: Applicants must apply separately for each announcement in order to be considered.\n\nPer IHS policy (SGM 21-04) IHS selectees to positions located in Federally operated hospitals, health centers, and clinics must be fully vaccinated for COVID-19 before entry on duty or have IHS approve a medical or religious exemption. If an exemption is approved then wearing a face mask and regular testing for COVID-19 will be required. Your Human Resources Specialist will provide a list of documents acceptable as vaccination proof and instructions on how to submit your vaccination documentation or how to request a medical or religious exemption, if needed.\n\nAdditional selection(s) of candidates may be possible within 90 days from the date the certificate of eligibles was issued for this announcement.\n\nFederal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. IHS may offer newly-appointed Federal employees credit for their directly related previous non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave.\n\nRecruitment or relocation incentives may be authorized. At least a 6 month service agreement will be required.\n\nThis position meets the criteria specified in pillar number one of the five pillars of the PHS Commissioned Corps. PHS Commissioned Officers interested in performing the duties of this position within the Commissioned Corps MUST apply online under the merit promotion announcement indicated above in order to receive consideration. For more information on PHS Commissioned Corps, visit the website at: https://www.usphs.gov/.\n\nThis position has promotion potential to the GS-12 grade level. Promotion to the next grade level is at management's discretion and is based on your demonstrated ability to perform the higher level duties, the continuing need for the higher level duties, and \"Regulatory/Administrative\" approval. Promotion to the next higher grade level is not guaranteed and no promise of promotion is implied.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nImplementation and maintenance of Electronic Health Record and related systems for inpatient and/or outpatient services to include coordination of existing accreditation and reporting requirements.\nCoordination, liaison and support to administration, clinical staff, HIM, and MIS on all functions relating to EHR.\nTraining of clinical staff on a range of application packages including EHR, Health Summary, clinical orders and notes, and various report functions.\n\n\n"}, {"jobID": "716265100", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "ENGINEERING TECHNICIAN", "companyName": "U.S.ArmyCorpsofEngineers", "link": "https://www.usajobs.gov/job/716265100", "jobLocation": {"remote": "not specified", "city": "Pittsburgh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 85582, "max": 111257}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nObtain Security + CE Certification within 24 months of coming on board and maintain for the duration of employment.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nSpecialized Experience: One year of specialized experience which includes include use of an Engineering Data Management System providing technical expertise to support the technical and functional aspects; facilitating the installation of software and troubleshooting of software/hardware issues on behalf of end users; and managing CAD/BIM/PW system hardware to include replacement and implementation, procurement process involving coordination with contracting. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11).Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.\n\nYou will be evaluated on the basis of your level of competency in the following areas:\n\n\n\n\n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nTelework Eligibility: This position is eligible for Regular and Recurring Telework\nRelocation/ Student Loan Repayment incentive(s) MAY BE authorized to highly qualified candidate.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 18 position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nServes as the District's Engineering Data Management System (EDMS)Manager\nParticipates in the planning, budgeting, management, and execution of the District CAD Facility Account.\nFacilitate hardware replacement and implementation, including procurement process involving coordination with Contracting and IT departments.\nMaintains technical expertise in various CAD/BIM software.\nFacilitates software procurement, upgrades and implementation including procurement process involving coordination with Contracting and USACE IT.\nManages CAD/BIM/PW system hardware including, but not limited to, servers, storage, plotters, scanners, and 3D printers.\nServes as the Division's IT Representative to USACE IT.\n\n"}, {"jobID": "716588500", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (APPSW)", "companyName": "DefenseHumanResourcesActivity", "link": "https://www.usajobs.gov/job/716588500", "jobLocation": {"remote": "not specified", "city": "Seaside", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be  a U.S. Citizen\nOccasional Travel\nWork Schedule: Full-time\nMales born after 12-31-59 must be registered for Selective Service\nSuitable for Federal employment, determined by a background investigation\nMay be required to successfully complete a probationary period\nOvertime: Occasionally\nTour of Duty: Flexible\nRecruitment Incentives: Not Authorized\nFair Labor Standards Act (FLSA): Exempt\nFinancial Disclosure: Not Required\nTelework Eligibility: This position is telework eligible\nCOVID19: Please see, additional information.\n\n\n Qualifications\n\r\n                                        You may qualify at the GS 13 , if you fulfill the following qualifications:\n\nA. One year of specialized experience equivalent to the GS-12 grade level in the Federal service:\n\nWorks with cloud solutions providers to development and maintain cloud hosted solutions.\nApplies IT software principle and methods sufficient to participate in the design development, testing and implementation of new or modified application software.\nParticipates in defining requirements for a project and establishing scalable architectures.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nIn addition to meeting qualifications, your application package must reflect the applicable experience to meet the Individual Occupational Requirements for the 2210 series.\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nPlease keep your résumé to a reasonable length. If more than five pages are submitted, only the first five pages will be reviewed to determine your eligibility/qualifications.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\n\n\nEducation\n\r\n                                            Substitution of education may not be used in lieu of specialized experience for this grade level.\n\n\n\n\nAdditional information\n\nCOVID19 - To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\n\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement.\n\nOther Notes:\n\nRE-EMPLOYED ANNUITANT: This position DOES/DOES NOT meet criteria for re-employed annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at: https://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf\n\nAll applicants must meet qualifications and eligibility criteria by the closing date of the announcement.\n\nInteragency Career Transition Assistance Programs: This program applies to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet ICTAP eligibility criteria; 2) be rated well-qualified for the position; Well qualified is defined as possessing the type and quality of experience that exceeds the positions minimum qualifications. and 3) submit the appropriate documentation to support your ICTAP eligibility. For more information:\nhttps://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/\n\nMales born after 12-31-59 must be registered or exempt from Selective Service (see Who Needs to Register | Selective Service System : Selective Service System (sss.gov))\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As a INFORMATION TECHNOLOGY SPECIALIST (APPSW) at the GS-2210-13 some of your typical work assignments may include:\n\nWork involves the design, documentation, development, modification, testing, installation, implementation, and support of new or existing applications software.\nDesign and develop software solutions using industry standard application programming languages and reporting tools including but not limited to Java, .NET, SQL, etc.\nDesign and develop software solutions including but not limited to web applications, web services, micro services, mobile applications, desktop clients, relational and non-relational databases.\nDesign and develop software solutions across multiple technology platforms and layers (full stack engineering) including but not limited to cloud, mobile, web, database, and native application platforms.\nWorking with cloud solutions providers to development and maintain cloud hosted solutions.\nDevelop and maintain application reference architectures, components, workflows, deployment diagrams, application infrastructure diagrams.\nCyber harden applications and conduct security level testing as applicable.\n\n\n"}, {"jobID": "715484700", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Information Technology Specialist (INFOSEC)", "companyName": "GovernmentPublishingOffice", "link": "https://www.usajobs.gov/job/715484700", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship is required.\nSelectee must successfully pass pre-employment prior to appointment.\nMales born after 12/03/59 must be registered for Selective Service.\nSelectee may be required to serve a one year probationary period.\nSelectee must be able obtain and maintain secret security clearance.\n\n\n Qualifications\n\nYou must meet both the Basic Requirement and the Specialized Experience to qualify for this series as described below.\n\nBASIC REQUIREMENT:\n\nApplicants must have IT-related experience demonstrating each of the four competencies listed below:\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nand\nSpecialized Experience: \n\nTo qualify for the IT Specialist (INFOSEC) PG-1, applicants must possess one year of specialized experience equivalent to the PG-12 grade level in the Federal Service that includes: 1) Developing and maintaining operational computer security policies 2) Installing and maintaining critical security hardware and/or software 3) Reviewing proposed new systems, networks, and software designs for potential security risks.\n\nAdditional qualification information can be found from the following Office of Personnel Management\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nAll qualification requirements must be met by the closing date of this announcement 04/10/2023to be considered.\n\n\n\nEducation\n\r\n                                            Substitution of education in lieu of specialized experience may not be used for this grade level.\r\n                                        \n\n\nAdditional information\n\nEmployment of Relatives: Section 3110 of Title 5, U.S. Code, prohibits a Federal official from appointing, promoting, or advocating the appointment or promotion of a relative in the agency where the official is serving or exercises jurisdiction. In addition, Section 2302(b)(7) of Title 5, U.S. Code, makes it a \"prohibited personnel practice\" for a person in authority to \"appoint, employ, promote, advance, or advocate for the appointment, employment, promotion, or advancement of a relative.\" For further information visit: https://www.law.cornell.edu/uscode/text/5/3110 and https://www.law.cornell.edu/uscode/text/5/2302\n\nSeparated Employees: If you have separated from Federal Government employment, you may obtain a copy of your SF-50 via: National Personnel Records Center, Annex, 1411 Boulder Boulevard, Valmeyer, IL, 62295; or visit the National Archives Website.\n\nWork Life Balance: The GPO offers Transit subsidy for commuters using public transportation (Metro Bus/Rail, MARC, VRE, etc.).\n\nBackground Investigation:\n\nSecret:\nTo ensure the accomplishment of its mission, the GPO requires every employee to be reliable and trustworthy; this position requires a Top Secret clearance. To meet those standards, all selected applicants must undergo and successfully completed a background investigation for a Top Secret clearance. This review could include financial issues such as delinquency in the payment of debts, child support and/or tax obligations, as well as certain criminal offenses and illegal use or possession of drugs; this security process may take between 6 weeks to 12 months.\n\nGPO will conduct an interim security clearance, pending the completion of the full investigative requirements for the final Top Secret clearance. The interim security clearance will be granted based on the favorable completion of preliminary checks that are accomplished as part of the security clearance process. The Agency may rescind the tentative offer if the candidate is unable to obtain an interim clearance.\n\nSchedule A (Disability Appointment):Documentation of eligibility for employment under Schedule A can be obtained from a licensed medical professional (e.g., a physician or other medical professional certified by a state, the District of Columbia, or a U.S. territory to practice medicine); a licensed vocational rehabilitation specialist (i.e., state or private); or any Federal agency, state agency, or agency of the District of Columbia or a U.S. territory that issues or provides disability benefits. The letter must be printed on a \"medical professional's\" letterhead and signed.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements including failure to report to any of the scheduled appointments and the the candidate is unable to obtain an interim clearance.\n\nThe selectee will work shift 1.\n\nAdditional vacancies may be filled by this announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nInstalls and maintains critical security hardware and software; provides quick response technical support for trouble shooting computer programming, ADP hardware, software, telecommunications and operational problems.\nRecommends corrective action to the IRM Policy Manager as it related to IT security.\nDevelops security standards and security policy procedures for use throughout the agency in the evaluation of systems analysis, programming, program maintenance, documentation techniques, security awareness training, risk assessments/ reviews.\nAnalyzes hardware, software, and support service requirements of operations critical to the mission of the agency in order to determine the emergency operating. backup, and recovery requirements.\nEnsures IT applications are engineered to protect sensitive information.\nParticipates in hardware/telecommunications tests and acceptance.\n\n"}, {"jobID": "715381100", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "Aerospace Engineer, AST, Automation and Robotics Systems (Direct Hire)", "companyName": "LyndonB.JohnsonSpaceCenter", "link": "https://www.usajobs.gov/job/715381100", "jobLocation": {"remote": "not specified", "city": "Houston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 113689, "max": 147793}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nThis position is open to U.S. citizens, nationals or those who owe allegiance to the U.S.\nPosition subject to pre-employment background investigation.\nYou must meet qualifications requirements by the closing date of this announcement.\n\n\n Qualifications\n\r\n                                        In addition to the Basic Education Requirement (in the Education section below), to qualify for this position you must meet the requirements below. Specialized experience is experience that has equipped you with the particular ability, skill, and knowledge to successfully perform the duties of this position and is typically in or related to this line of work.\n\nNASA utilizes OPM-approved qualification and rating requirements specific for Aerospace Technology (AST) positions which recognizes NASA's unique aerospace work. The specific qualifications and minimum education requirements are further described below and within the education section of the job announcement.\n\nTo qualify for GS-13, you must have one year of directly related specialized experience equivalent to the GS-12 level in the federal sector:\n\nWorking with mechatronic systems, such as robotic control using motor drives and sensor feedback;\nUtilizing software frameworks and code development tools typically associated with robotic systems development, such as Python, MATLAB, ROS, GitLab, or other related software/platforms;\nApplying circuit simulation or analysis tools to support design or verification of circuits and systems.\n\n\nYour resume must include a clear and detailed narrative description, in your own words, of how you meet the required specialized experience. Experience statements copied from a position description, vacancy announcement or other reference material constitutes plagiarism and may result in disqualification and losing consideration for the job.\r\n                                    \n\n\nEducation\n\nBasic Education Requirement: You must have successfully completed a bachelor's degree with a major in one of the following:\na) Engineering from a college or university that has ABET accredited engineering programs\nb) Physical Science, Mathematics, Life Science or other field of Science\nc) Computer Science that included 30 semester hours or 45 quarter hours of course work in any combination of mathematics, statistics and computer science with at least half of those hours in mathematics and statistics courses that included differential and integral calculus.\n\nIf you did not complete a qualifying bachelor's degree, you may be eligible if you have obtained a graduate degree in an AST qualifying field, as listed above.\n\nDegrees in engineering technology are not considered qualifying for this position.\n\nEngineering degrees earned within the United States: Engineering degrees earned within the United States must be from a college or university that has at least one ABET accredited engineering program. To find out if a school has at least one ABET accredited program, please visit http://www.abet.org.\n\nEngineering degrees earned outside the United States: Engineering degrees earned outside the United States must be recognized by a Mutual Recognition Agreement (MRA), often known as accords. These are non-governmental agreements among organizations that accredit academic degree programs. MRAs recognize the substantial equivalence of mature accreditation systems and programs accredited by signatory organizations within their jurisdictions. For a listing of Signatories, please visit, https://www.abet.org/global-presence/mutual-recognition-agreements/is-your-program-recognized/.\n\nScience and other related degrees earned within the United States: Science and other related degrees must have been awarded from colleges or universities that are accredited by recognized accrediting organizations. For a list of schools that meet this criteria, go to http://ope.ed.gov/accreditation/.\n\nScience and other related degrees earned outside the United States: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs. These education credentials must be deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\n\nAll degrees must have been received in the year of, or any year subsequent to the original date of accreditation.\r\n                                        \n\n\nAdditional information\n\nAdditional selections may be made for similar positions across NASA within the local commuting area(s) of the location(s) identified in this announcement. By applying, you agree to have your application shared with interested selecting official(s) within NASA. CTAP/ICTAP will be cleared for any additional selection from this announcement.\n\n\nIf you have special priority selection rights under the Agency Career Transition Assistance Program (CTAP) or the Interagency Career Transition Assistance Program (ICTAP), you must:\n\n\nIndicate your eligibility when applying for a position. The questionnaire asks you to identify your ICTAP/CTAP eligibility.\nMeet the minimum qualifications requirements for the position\nSubmit proof that you meet the requirements for CTAP/ICTAP as indicated in 'Required Documents'\n\n\nFor additional information about CTAP/ICTAP eligibility, click here - https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/#ictap.\n\nThis is a bargaining unit position. If additional selections are made, those positions may or may not be in a bargaining unit. To learn more about bargaining units at NASA please click here NASA Unions (Bargaining Units) | NASA.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPerform conceptual design through the requirements phase of robotic systems, focused on electrical subsystems.\nPerform printed circuit board design, fabrication, and testing. Includes issue tracking and resolution, design for manufacturing, and component availability replacement.\nPerform hands-on testing and validation of new designs using electrical test equipment including logic analyzers, oscilloscopes, and emulators.\nDevelop test software for data collection and analysis for embedded and real-time systems.\nDesign experiments and qualification/test plans for electronic circuits, board level designs, and embedded software.\nProvide lifecycle technical support of robotic electrical hardware to strategic partners and customers as needed.\n\n"}, {"jobID": "715161400", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "COMPUTER ASSISTANT", "companyName": "AirForceGlobalStrikeCommand", "link": "https://www.usajobs.gov/job/715161400", "jobLocation": {"remote": "not specified", "city": "BarksdaleAFB", "state": "LA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 42022, "max": 54625}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMust be registered for Selective Service, see Legal and Regulatory Guide\nA security clearance may be required\nTravel and Relocation will not be paid.\nThis posn is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nThe employee may be required to work other than normal duty hours, which may include evenings, weekends, and/or holidays.\nEmployee may be required to lift up to 20lbs, may be required to do a physical.\nMust be able to obtain and maintain a Secret clearance.\nMay be required to obtain and manage a government International Merchant Purchase Authorization Card for uint/ squadron purchases.\nMust posses a Comp TIA Security + or applicable certification prior to hiring in order to obtain administrative rights.\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the Specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions,  Group Coverage Qualification Standard for Clerical and Administrative Support Positions\n\nSPECIALIZED EXPERIENCE: At least one (1) year of specialized experience at the next lower grade (GS-05) or equivalent. Specialized experience includes performing operating procedures and processing methods on a wide range of information processing, preparing, advising, assisting, coding, and procedural problem solving duties; performing computer systems, software, and hardware to provide maintenance and user advice, and assistance in all computer-related areas; performing operating system software to install application software, troubleshoot operating systems and application software problems, and use the operating system commands for executing programs; and maintaining and revising databases for use in various systems.\nOR\nEDUCATION:  Successful completion of one full year of graduate education in a field related to the position being filled. NOTE: YOU MUST SUBMIT COPIES OF YOUR TRANSCRIPTS.\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100 percent. To combine education and experience, determine the total qualifying experience as a percentage of the experience required for the grade level. Then determine the education as a percentage of the education required for the grade level. Finally, add the two percentages. The total percentage must equal at least 100 percent to qualify an applicant for that grade level. NOTE: YOU MUST SUBMIT A COPY OF YOUR TRANSCRIPT.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of organization automated data processing standards, policies, and techniques.\n2. Knowledge of information processing sequences, controls, and procedures; and computer hardware and/or software systems and their interfaces.\n3. Knowledge of systems or other higher level programming language; and the terminology, codes, abbreviations, and graphics for preparing system documentation or programs,\n4. Knowledge of local rules and procedures controlling job priorities and controls on access to data and program files.\n5. Ability to use and maintain a computer system, equipment, and software; and analyze computer software and/or hardware problems and develop economical solutions.\n6. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP):  For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nSelective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIncentives: Recruitment and/or retention incentives may or may not be used.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11893074\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nProvides support to computer specialists by coding application programs in higher-level programming language(s), testing, and debugging programs.\nProvides service in the areas of hardware installation, movement, maintenance, and property accountability and determines needed repair of selected hardware items.\nAccomplishes new and recurring software installation and records maintenance requirements.\nSchedules, maintains, and provides advice on formulation of job requests and computer programs.\nProvides guidance and assistance to customers.\n\n"}, {"jobID": "716233000", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "General Engineer, GS-0801-11/12", "companyName": "U.S.CoastGuard", "link": "https://www.usajobs.gov/job/716233000", "jobLocation": {"remote": "not specified", "city": "Norfolk", "state": "VA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 69961, "max": 109011}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship is required. \nMales born after 12/31/1959 must be registered for Selective Service.\n\n\r\n                                        All qualification requirements must be met by the closing date of the announcement.\r\n                                    \n\n Qualifications\n\nBasic Requirements: \nA.  Degree:  Engineering. To be acceptable, the program must: (1) lead to a bachelor’s degree in a school of engineering with at least one program accredited by ABET; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.\nOR\nB.  Combination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n\nProfessional registration or licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT)1, or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\nWritten Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE)2 examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico.\nSpecified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in the basic requirements under paragraph A. The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A.\nRelated curriculum -- Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor’s degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions. (The above examples of related curricula are not all-inclusive.)\n\nNote: An applicant who meets the basic requirements as specified in A or B above, except as noted under B.1., may qualify for positions in any branch of engineering unless selective factors indicate otherwise.\nAdditional Requirements: Applicants must possess at least one year of specialized experience equivalent to the next lower grade level in the Federal Service. Specialized experience is experience that has equipped you with the particular ability, skill, and knowledge to successfully perform the duties of this position and is typically in or related to this line of work.\nGS-11: In addition to the above Basic Qualifications, applicants must possess one year of specialized experience equivalent to the GS-09 grade level in the Federal Service. Examples of specialized experience include: researching, analyzing, interpreting, evaluating, and carrying out difficult but conventional assignments; preparing, providing and evaluating conventional plans, designs, design specifications, and related documentation; performing and interpreting calculations, analyses, and computations for unknown factors; conducting analytical investigations using scientific methods; articulate information through various venues such as discussions, meetings, fact sheets, reports, design documentation, briefings, and presentations\nOR,\nthree years of directly related higher level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree.\nGS-12: In addition to the above Basic Qualifications, applicants must possess one year of specialized experience equivalent to the GS-11 grade level in the Federal Service. Examples of specialized experience include: developing complex designs and specifications for naval vessels scheduled for alteration, repair, rebuilding, conversion, modernization, or rehabilitation; preparing cost estimates, evaluating and advising on contractual proposals, and participating in negotiations with contractors; analyzing, evaluating, conferring on, and coordinating the engineering and design and work performed by other engineers, architects, and contractors.\nNational Service Experience (i.e., volunteer experience): Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.The Office of Personnel management (OPM) must authorize employment offers made to current or former political appointees.  If you are currently, or have been within the last 5 years, a political Schedule A, Schedule, C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.\n\n\n\nEducation\n\nThis position does have a positive education requirement. If you are including education on your resume, report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. See Required Documents section for detail. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet Federal qualification requirements if you can show that your foreign education is comparable to education received in accredited educational institutions in the United States. It is your responsibility to provide such evidence with your application. See Recognition of Foreign Qualifications click here\n\n\n\nAdditional information\n\nApplicants will be required to complete questions contained on the Declaration for Federal Employment (OF-306) at the time a tentative job offer is made. Certain responses on the form could pose a problem with suitability for employment determinations. If you receive a conditional offer of employment for this position, you will be required to complete/make updates to the OF-306 and to sign and certify the accuracy of all information in your application, prior to entry on duty. False statements on any part of the application may result in withdrawal of offer of employment, dismissal after beginning work, or imprisonment.DHS uses e-Verify, an Internet-based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about e-Verify, including your rights and responsibilities at click hereIf selection is made below the full performance level, the incumbent may be promoted up to the target grade without further competition, if all legal and regulatory requirements are met and when recommended by the supervisor. However, promotion to the full performance level is not guaranteed and is dependent on successful performance at the lower grade level(s).All Federal employees are required to have Federal salary payments made by direct deposit.For Veterans' preference eligibility, visit Veterans' Employment Resources. Veterans, Peace Corps/VISTA volunteers, and persons with disabilities possess a wealth of unique talents, experiences, and competencies that can be invaluable to the DHS mission. See the required documents section of the announcement.More than 1 selection may be made from this announcement if additional identical vacancies in the same title, series, grade, and unit occur within 45 days from the date the certificate was issued.If you need a reasonable accommodation for the application and hiring process, please contact 410-636-3504. Decisions on granting reasonable accommodation will be made on a case-by-case basis. Visit Reasonable Accommodation\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nDHS offers competitive salaries and an attractive benefits package, including: health, dental, vision, life, and long-term care insurance; retirement plan; Thrift Savings Plan [similar to a 401(K)]; Flexible Spending Account; Employee Assistance Program; personal leave days; and paid federal holidays.  Other benefits may include:  flexible work schedules; telework; tuition reimbursement; transportation subsidies; uniform allowance; health and wellness programs; and fitness centers.  DHS is committed to employee development and offers a variety of employee training and development opportunities.  For more information, go to the DHS Careers website and select “Benefits”.  Disabled veteran leave will be available to any Federal employee hired on or after November 5, 2016, who is a veteran with a service-connected disability rating of 30 percent or more.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPerforms a variety of professional naval engineering work as a general engineer. The work involves a wide range of engineering skills including, but not limit to, mechanical, electrical, structural, naval architecture, industrial and environmental professional series. The work is performed on the five Classes of Coast Guard vessels under the WMEC Product Line.\nBeing a Coast Guard civilian makes you a valuable member of the Coast Guard team.\nAt the full GS-12 performance level, typical work assignments include:\n- Performing professional engineering work in diverse areas such as mechanical engineering, electrical engineering, naval architecture and marine engineering.\n- Preparing engineering designs and specifications for the alteration, repair, installation, redesign, or maintenance of complex systems and machinery on Coast Guard vessels.\n- Conducting feasibility studies, cost and time estimates for design and specifications, and life cycle costing information for engineering projects.\n- Performing ship checks on Coast Guard cutters to obtain data for study, design, and review and to ensure compliance with designs and specifications.\n- Directing and coordinating finalization of engineering contract documents in order to achieve the completion of a formal project and assure contract compliance.\n- Using automated hardware and software for the preparation and storage of technical documents, correspondence, and database.\n\n"}, {"jobID": "711008800", "origin_search": "https://www.usajobs.gov/", "posted": "03/08/2023", "jobTitle": "INTERDISICIPLINARY ENGINEER/SCIENTIST", "companyName": "NavalAirSystemsCommand", "link": "https://www.usajobs.gov/job/711008800", "jobLocation": {"remote": "not specified", "city": "ChinaLake", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 95905, "max": 148255}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final secret security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\r\n                                        Your resume must demonstrate at least one year of specialized experience at or equivalent to the DP-03 pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate some or all of the following: 1) Researching, designing, implementing, and testing software systems including identifying areas for modification in existing system; 2) Writing source code using a variety of computer languages, primarily C++, Ada and Pascal; 3) Proficiency of Windows and Red Hat Operating Systems along with the Visual Studio and QT Creator IDEs (Integrated Development Environment); 4) Planning, scheduling, coordinating and conducting detailed phases of technical work as part of small and moderate project efforts; and 5)Generating scripts and supporting products to create build media for installing developed products on target systems.\n\n08XX series: Additional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=List-by-Occupational-Series AND https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/files/all-professional-engineering-positions-0800.pdf\n\n1550:https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/computer-science-series-1550/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\n\n\n\nEducation\n\r\n                                            Applicants must meet the following basic education requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual:\n\n08XX series:\nSuccessful completion of a professional engineering degree. To be acceptable, the program must: (1) lead to a bachelor's degree (or higher) in a school of engineering with at least one program accredited by the Accreditation Board for Engineering and Technology (ABET); or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. Such education must demonstrate the knowledge, skills, and abilities necessary to do the work of the position.\n\nOR\n\nCurrent registration as an Engineer Intern (EI), Engineer in Training (EIT), or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration For more information about EI and EIT registration requirements, please visit the National Society of Professional Engineers website at: http://www.nspe.orgOREvidence of having successfully passed the Fundamentals of Engineering (FE) examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico The FE examination is not administered by the U. S. Office of Personnel Management. For more information, please visit: http://www.nspe.org/Licensure/HowtoGetLicensed/index.html.\n\nOR\n\nSuccessful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and in engineering that included the courses specified in the basic requirements under paragraph A (above). The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A (above)\n\nOR\n\nSuccessful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least one year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily, there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions.\n\n1550: Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will work group that provides software engineering and lifecycle assistance for the aircraft tracking and aircrew training software applications for the Navy, Air Force, Marine Corp and Air National Guard Tactical Training Ranges.\nYou will provide integrated software solutions.\nYou will provide the expertise required to develop TARIF (Tactical Air Range Integration Facility) software applications and support TARIF field installation and configuration.\n\n"}, {"jobID": "715495500", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "IT Specialist", "companyName": "NationalTelecommunicationsandInformationAdministration", "link": "https://www.usajobs.gov/job/715495500", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": "CO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. citizen to apply for this position.\nYou must successfully pass a background investigation. This may include a credit check, a review of financial issues, as well as certain criminal offenses and illegal use of possession of drugs.\nA probationary or trial period may be required.\nSelective Service: Males born after 12/31/59 must be registered or exempt from Selective Service (see https://www.sss.gov/).\nIf you receive a conditional offer of employment for this position, you will be required to complete an Optional Form 306, Declaration for Federal Employment, and to sign and certify the accuracy of all information in your application.\nAll Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choosing.\nDrug Test Required: NO\nLicense required: NO\nPre-employment physical required: NO\nBargaining Unit Position: NO\nConfidential Financial Disclosure Report (OGE form 450): NO\nPermanent Change of Duty Station (PCS) Expense: NOT to be paid\nTime-in-grade/band requirements must be met by the closing date of the announcement unless eligible for special hiring authority, reinstatement eligible, non-current Federal employee applying as a VEOA eligible which do not require time-in-grade/band.\n\n\n\n Qualifications\n\nQualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards. This handbook is available on the Office of Personnel Management's website located at: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/\nApplicants must possess one year of specialized experience equivalent in difficulty and responsibility to the next lower grade level in the Federal Service. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills and abilities to successfully perform the duties of the position. This experience need not have been in the federal government.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations e.g., professional; philanthropic, religious; spiritual; community, student, social). Volunteer work helps build critical competencies; knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTo qualify at the GS-13 Level-\n\nSPECIALIZED EXPERIENCE: You must possess one full year (52 weeks) of specialized experience equivalent to the GS-12 in the Federal service. Specialized experience is defined as:\n- Utilize project management software tools to ensure projects are kept on schedule and within budget.\n- Advise in the development and implementation of automated spectrum management tools, products, and capabilities.\n- Establishing an effective working relationship with operating units, departmental entities, stakeholders, and others associated with the design, implementation, operation, and maintenance of IT systems.\n- Assisting in the development of acquisition documentation such as Performance Work Statements (PWS) and Statements of Work (SOWs) for the acquisition of IT systems, equipment, and services.\n\nTo qualify at the GS-14 Level-\n\nSPECIALIZED EXPERIENCE: You must possess one full year (52 weeks) of specialized experience equivalent to the GS-13 in the Federal service. Specialized experience is defined as:\n- Providing electromagnetic spectrum-related technical input to IT software projects and acquisitions.\n- Directing IT projects to ensure established milestones and budget goals.\n- Developing Spectrum Information System testing strategies, plans, or scenarios.\n- Providing presentations or briefings on all aspects of a project and understand the organizational mission and corporate direction.\n\n\n\nEducation\n\r\n                                            There is no positive education requirement for this position.\n\n\n\nAdditional information\n\nThe following links provide information on various hiring authorities that may enable you to apply through merit assignment procedures, or be eligible for a non-competitive appointment.\n\nVeterans Recruitment Act (VRA)\nVeterans Employment Opportunities Act (VEOA)\n30% or more disabled veterans\nPersons with disabilities\nCareer Transition Assistance Plan (CTAP)\nInteragency Career Transition Assistance Plan (ICTAP)\n\nICTAP and CTAP Eligibles: CTAP and ICTAP candidates will be eligible if it is determined that they have exceeded the minimum qualifications for the position by attaining at least a rating of 85 out of 100. Information about ICTAP eligibility is on the Office of Personnel Management's Career Transition Resources website at: Employee Guide to Career Transition\n\nCTAP applicants MUST submit the following documents:\n\nA copy of your specific RIF notice; notice of proposed removal for failure to relocate; a Certificate of Expected Separation (CES); or certification that you are in a surplus organization or occupation (this could be a position abolishment letter, a notice eligibility for discontinued service retirement, or similar notice).\nA copy of your SF-50 \"Notification of Personnel Action\", noting current position, grade level, and duty location;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nICTAP applicants MUST submit the following documents:\n\nA copy of your RIF separation notice; notice of proposed removal for failure to relocate; notice of disability annuity termination; certification from your former agency that it cannot place you after your recovery from a compensable injury; or certification from the National Guard Bureau or Military Department that you are eligible for disability retirement;\nA copy of your SF-50 \"Notification of Personnel Action\" documenting your RIF separation, noting your positions, grade level, and duty location, and/or Agency certification of inability to place you through RPL, etc;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nCurrent or Former Political Appointees: The Office of Personnel Management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule C, Non-career SES, or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As an IT Specialist, you will perform the following duties:\n\nGuiding development and execution of NTIA Spectrum IT Systems projects.\nOverseeing agile systems development activities, and conducting systems engineering tasks including requirements definition and elaboration, design, test, deployment, and operations.\nOverseeing these systems engineering tasks and software development conducted by contractors and other parties engaged by the SNSS program office. (This position does not include hands-on software development.)\nConducting research and tasks related to development, operations and evolution of radio frequency management software systems, data standards, and corresponding radio frequency management policy, regulation and business processes.\nEstablishing and executing processes for software development, testing, deployment, operations, security, risk management, quality management, configuration management, change management, and ensure compliance with established processes.\nConducting program management including cost, schedule, scope, risk, quality, and communication management. Monitor tasks, and track and evaluate contract deliverables. Support development of acquisition package deliverables and acquisition activities needed for NTIA to meet spectrum IT system objectives.\nCollaborating with and providing expert technical and program management advice to stakeholders in NTIA, the Department of Commerce, and external U.S. government agencies to achieve NTIA objectives.\n\n\nThis position is also advertised under NTIA-OSM-DE-23-11904801, which is open to Delegated Examining eligible applicants. You must apply to both announcements if you want to be considered for both.\r\n                                    \n"}]