[{"jobID": "716249800", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "IT Specialist (Systems Analysis)", "companyName": "FederalAviationAdministration", "link": "https://www.usajobs.gov/job/716249800", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 88791, "max": 137651}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nUS Citizenship is required.\nSelective Service Registration is required for males born after 12/31/1959.\n\n\n Qualifications\n\nFor additional information please view the complete OPM Qualification Standard for IT Specialist, please visit:\n\nInformation Technology (IT) Management Series 2210 (Alternative A) (opm.gov)\n\nTo qualify for this position you must demonstrate in your application that you possess at least one year of specialized experience equivalent to FV-I / FG/GS13. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position.Specialized experience is: Experience serving as a software developer in support of a large IT enterprise Supply Chain System, utilizing a Scaled Agile Framework methodology (SAFe) to deliver software solutions for an Enterprise Resource Planning (ERP) software platform.Applicants should provide examples of specialized experience in their work history.Qualifications must be met by the closing date of this vacancy announcement.Some, all, or none of the applicants may be interviewed.You may also be considered for this vacancy based on eligibility under the 30% or More Disabled Veteran Program, and Persons with Disabilities/Persons with Targeted Disabilities. To be considered for one of these special hiring authorities, you must identify your eligibility in your questionnaire in the Applicant-Preferred Conditions of Employment section. In addition, you must submit documentation that provides evidence of eligibility as indicated in the How to Apply section of the announcement.Selection may be made from this announcement or from ACT-ATO-23-AJW1620-83794.\n\n\n\n\r\n                                            Preview Job Questionnaire\r\n                                        \n\r\n                                            Make sure your resume includes detailed information to support your qualifications and answers to the job questionnaire.\r\n                                        \n\n\nAdditional information\n\nWe may use this vacancy to fill other similar vacant positions.Position may be subject to a background investigation.A one-year probationary period may be required.The person selected for this position may be required to file a financial disclosure statement within 30 days of entry on duty. FAA policy limits certain outside employment and financial investments in aviation-related companies. www.faa.gov/jobs/working_here/financial_disclosure_requirementsThe U.S. Department of Transportation strives to ensure that equity, transparency, accountability, collaboration, and communication permeate all that we do for the betterment of the Department, the traveling public, and our nation. As such, DOT values a highly diverse workforce of persons who promote a culture of belonging by respecting the personal dignity and worth of each individual and fostering a positive environment where all feel safe and welcome. If these commitments coincide with your personal ideals and professional aspirations, please consider joining the DOT family.Leave Enhancement: FAA organizations may offer enhanced annual leave accrual to newly appointed or reappointed employees. In order to receive consideration for such a benefit, applicants' prior non-Federal service or active duty uniformed service must directly relate to the duties of the position to which appointed. Granting enhanced annual leave is at the sole discretion of the hiring organization, and granting such benefit is not an entitlement nor guaranteed to any newly hired employee.As a part of the Federal-Wide Hiring Reform Initiative (streamlining the hiring process), the FAA is committed to eliminating the use of the Knowledge, Skills and Ability (KSA) narratives from the initial application in the hiring process for all announcements. Therefore, as an applicant for this announcement, you are NOT required to provide a narrative response in the text box listed below each KSA.\n\nIn lieu of providing a KSA narrative response in the text box listed below each KSA, in your work history, please include information that provides specific examples of how you meet the response level or answer you chose for each KSA. Your work history examples should be specific and clearly reflect the highest level of ability. Your KSA answers will be evaluated further to validate whether the level that you selected is appropriate based on the work history and experience you provided. Your answers may be adjusted by a Human Resource Specialist as appropriate.Eligible applicants meeting the minimum qualification requirements and selective factor(s), if applicable, may be further evaluated on the KSAs listed in the announcement. Based on this evaluation, applicants will be placed in one of the following categories: score order, category grouping, or priority grouping and referred to the selecting official for consideration.Please ensure you answer all questions and follow all instructions carefully. Errors or omissions may impact your rating or may result in you not being considered for the job.This is a bargaining unit position. This position is represented by AFGE 2282: Aero Center Consolidated.Links to Important Information: Locality Pay , COLA \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAssociated activities are related to Supply Chain Systems requirements design, development, testing, implementation, evaluation, maintenance, and monitoring. Based on technical expertise, incumbent provides input to management on plans, resources, schedules, priorities, and goals of a project. Maintains an awareness of the status and progress of all projects within the assigned technical area and recommends adjustments in accordance with established priorities.The Software Developer is responsible for understanding and maintaining the structure of the Supply Chain Systems software, and ensuring that it will meet the requirements of the Agency. The developer must also help the team to work together in an agile fashion, to develop software solutions, and to interface well with other parts of the Agency to include Technical Operations Organizations and the Configuration, Logistics, and Maintenance Resource Solutions (CLMRS) Program Management Organization (PMO). The Software Developer must understand the Agency’s business and software requirements. The Software Developer works to implement software solutions for the FAA’s Supply Chain System (SCS). SCS supports an Enterprise Resource Planning (ERP) software platform that supports various supply chain, configuration management and maintenance planning/execution work tools. AJW-162’s work includes software planning, development, deployment and operational support for the ERP.The Software Developer applies knowledge of Information Technology (IT) principles, concepts, and methods related to data storage, software applications, and networking to identify system objectives, functions, and customer requirements. Using skill applying agile principles, such as early and continuous delivery of software, sustainable development, and use of self-organizing teams, to develop software systems for complex solutions to address simulation requirements. He/she applies knowledge of Information Technology (IT) principles, concepts, and methods related to data storage, software applications, and networking to identify system objectives, functions, and customer requirements.Performs multiple, varying and complex assignments under the minimal direction of a manager, project/program manager, team leader, or more experienced technical specialist. Work is rarely reviewed, typically through status reports and at project completion, to ensure technical compliance and alignment with the requirements of the project or other work activity. Acts as principal technical specialist or as a project manager or team leader for large work activities. Defines, organizes, and assigns resources to accomplish organizational objectives. Allocates resources to accomplish large work activities within established schedules, meeting budget constraints. Provides guidance to lower-level staff on how to solve difficult technical issues. Resolves all, but unique technical problems without the intervention of management or a more experienced technical specialist. Works with the management to solve problems.\n\n"}, {"jobID": "716474200", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Computer Engineer, AST - Data Systems", "companyName": "GoddardSpaceFlightCenter", "link": "https://www.usajobs.gov/job/716474200", "jobLocation": {"remote": "not specified", "city": "Greenbelt", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 155700, "max": 183500}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nCurrent Federal employees must meet qualifications, time in grade, and 90 days after competitive appointment requirements by the closing date of the announcement.\nIf selected, you will be required to complete a financial disclosure statement.\n\n\n Qualifications\n\r\n                                        In addition to the Basic Education Requirement (in the Education section below), to qualify for this position you must meet the requirements below and have one year of specialized experience equivalent to the next lower grade, which has equipped you with the particular competencies needed to successfully perform the duties of the position described above.\n\nNASA utilizes OPM-approved qualification and rating requirements specific for Aerospace Technology (AST) positions which recognizes NASA's unique aerospace work. The specific qualifications and minimum education requirements are further described below and within the education section of the job announcement.\n\nTo qualify at the GS-15 level, you must have one year of directly related specialized experience equivalent to the GS-14 level:\n\nAdapting a software system to new or emerging technologies; this includes working with the developers and users of the system to enable the change;\nLeading the design, development, and/or deployment of a science data system including data processing, data distribution, data query, and/or end user system interfaces utilizing current software technologies and;\nDefining or developing functional and performance requirements, statements of work, project charters, and schedules, and/or evaluation work performance or technical proposal against defined standards.\n\nYour resume must include a clear and detailed narrative description, in your own words, of how you meet the required specialized experience. Experience statements copied from a position description, vacancy announcement or other reference material constitutes plagiarism and may result in disqualification and losing consideration for the job.\r\n                                    \n\n\nEducation\n\nBasic Education Requirement: You must have successfully completed a bachelor's degree with a major in one of the following:\n\na) Engineering from a college or university that has ABET accredited engineering programs\nb) Physical Science, Mathematics, Life Science or other field of Science\nc) Computer Science that included 30 semester hours or 45 quarter hours of course work in any combination of mathematics, statistics and computer science with at least half of those hours in mathematics and statistics courses that included differential and integral calculus.\n\nIf you did not complete a qualifying bachelor's degree, you may be eligible if you have obtained a graduate degree in an AST qualifying field, as listed above.\n\nDegrees in engineering technology are not considered qualifying for this position.\n\nEngineering degrees earned within the United States: Engineering degrees earned within the United States must be from a college or university that has at least one ABET accredited engineering program. To find out if a school has at least one ABET accredited program, please visit http://www.abet.org.\n\nEngineering degrees earned outside the United States: Engineering degrees earned outside the United States must be recognized by a Mutual Recognition Agreement (MRA), often known as accords. These are non-governmental agreements among organizations that accredit academic degree programs. MRAs recognize the substantial equivalence of mature accreditation systems and programs accredited by signatory organizations within their jurisdictions. For a listing of Signatories, please visit, https://www.abet.org/global-presence/mutual-recognition-agreements/is-your-program-recognized/.\n\nScience and other related degrees earned within the United States: Science and other related degrees must have been awarded from colleges or universities that are accredited by recognized accrediting organizations. For a list of schools that meet this criteria, go to http://ope.ed.gov/accreditation/.\n\nScience and other related degrees earned outside the United States: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs. These education credentials must be deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\n\nAll degrees must have been received in the year of, or any year subsequent to the original date of accreditation.\r\n                                        \n\n\nAdditional information\n\nAdditional selections may be made for similar positions across NASA within the local commuting area(s) of the location(s) identified in this announcement. By applying, you agree to have your application shared with interested selecting official(s) within NASA. CTAP/ICTAP will be cleared for any additional selection from this announcement.\n\nIf you are a current federal employee, you must meet applicable time-in-grade requirements to be considered eligible for this position. To be eligible, you must have completed a minimum of 52 weeks in a position no more than 1 grade lower than the advertised position. (Please submit your SF-50 that shows Time-in-Grade eligibility and reflects your title, series, and grade. If your eligibility for both merit promotion and/or time-in-grade cannot be determined, your application will be rated ineligible.\n\nNote: Time-in-grade requirements also apply to applicants who have held a non-temporary, competitive service GS position in the past year.\n\nIf you have special priority selection rights under the Agency Career Transition Assistance Program (CTAP) or the Interagency Career Transition Assistance Program (ICTAP), you must:\n- Indicate your eligibility when applying for a position. The questionnaire asks you to identify your ICTAP/CTAP eligibility.\n- Be well qualified for this position to receive consideration. Candidates rated in the 'Best Qualified' category are considered well-qualified. Please see 'How You Will Be Evaluated' for more information.\n- Submit proof that you meet the requirements for CTAP/ICTAP as indicated in 'Required Documents'\n\nFor additional information about CTAP/ICTAP eligibility, click here - https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/#ictap.\n\nQualified NASA term employees who have term conversion eligibility (Term Appointments | NASA) under the NASA Flexibility Act of 2004 will be referred and considered equally with other NASA permanent employees under internal competitive placement procedures.\n\nThis is a bargaining unit position. If additional selections are made, those positions may or may not be in a bargaining unit. To learn more about bargaining units at NASA please click here NASA Unions (Bargaining Units) | NASA.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nSupport the Joint Polar Satellite System(JPSS) Interface Data Processing Segment (IDPS) Lead in planning, monitoring, and leading major development and/or operation efforts in the segment to ensure each release is on-time and meets requirements.\nSupport the IDPS Lead in system budget estimation and ongoing budget monitoring, ensuring that all costs are tracked throughout the project lifecycle.\nManage and conduct trade studies and analyses of marked importance that significantly impact the software system engineering field.\nProvide authoritative technical decisions, advice, and consultation to contractors on variables and unknowns affecting planning, coordination, and critical problems with respect to safety, costs, and economics.\nEnsure systems, subsystems, tools, services, software and hardware elements, processes, documentation, development and adoption of new capabilities, and adherence to policies, procedures and recognized science data and metadata standards.\n\n"}, {"jobID": "716251400", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "IT SPECIALIST (APPSW)", "companyName": "Agriculture,OfficeoftheChiefFinancialOfficer", "link": "https://www.usajobs.gov/job/716251400", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 98496, "max": 128043112015145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National.\nMales born after 12/31/1959 must be Selective Service registered or exempt.\nSubject to satisfactory adjudication of background investigation and/or fingerprint check.\nSuccessful completion of one year probationary period, unless previously served.\nDirect Deposit ? Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution.\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit https://www.e-verify.gov/.\n\n\n Qualifications\n\r\n                                        Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement including time-in-grade restrictions, specialized experience and/or education, as defined below.\n\nThe following link provides more information on the qualifications for this position: Administrative and Management Positions.\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below.\n\n1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nAND\n\nSpecialized Experience: You must have one (1) year of specialized experience equivalent to at least the next lower grade level (GS-12) or pay band in the Federal service or equivalent in the public sector. Specialized experience for this position includes: Experience leading implementations of projects utilizing PeopleSoft to support Human Resources organizations. Experience in SQL, Oracle database, SQL Server Database, people code and other various development languages. Experience in multiple operating systems like Windows, Unix, and Linux. Experience with Configuration Management processes and tools (Quest STAT). Experience in managing all phases of the development life cycle (planning, requirements, development, software testing, implementation, and documentation). Experience in writing Application Engine programs and Structured Query Reports (SQR) for PeopleSoft.\n\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTIME IN GRADE REQUIREMENT: If you are a current federal employee in the General Schedule (GS) pay plan and applying for a promotion opportunity, you must meet time-in-grade (TIG) requirements of 52 weeks of service at the next lower grade level (GS-12).\r\n                                    \n\n\nEducation\n\r\n                                            Education may not be substituted for specialized experience.\r\n                                        \n\n\nAdditional information\n\n\n\nCareer Transition Assistance Plan (CTAP), Reemployment Priority List (RPL), or Interagency Career Transition Assistance Plan (ICTAP): Visit the OPM website for information on how to apply as a CTAP, RPL, or ICTAP eligible. To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.\nVeterans who are preference eligible or who have been separated from the armed forces under honorable conditions after three years or more of continuous active service are eligible for consideration under the Veteran's Employment Opportunity Act (VEOA). \nFarm Service Agency (FSA) County Employees: Permanent County employees without prior Federal tenure who are selected for a Civil Service position under Public Law 105-277 will be given a career-conditional appointment and must serve a 1-year probationary period.\nFor more information on applying under special hiring authorities such as the Veteran's Recruitment Act (VRA), 30 percent disabled veterans, certain military spouses, Schedule A Disabled, etc., explore the different Hiring Paths on the USAJOBS website.\nLand Management Workforce Flexibility Act (LMWFA) provides current or former temporary or term employees of federal land management agencies opportunity to compete for permanent competitive service positions. Individuals must have more than 24 months of service without a break between appointments of two or more years. Service must be in the competitive service and have been at a successful level of performance or better. Refer to PUBLIC LAW 114-47-AUG. 7, 2015 for more information.\nThis position may be eligible to telework up to four days per week, based upon the duties of the position. This position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.\nThis is a bargaining unit position.\n\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nServes as the project or technical lead for work involving application development activities for HR software projects primarily utilizing PeopleSoft.\nAnalyzes functional specifications and translates them into applications that automate business processes.\nDevelop functional requirements and specifications for application development, and programs involving software, system components, or services in support of a user community with individuals in more than one organization or program.\nDevelop software using People Code.\nResearch, design, program, and test computer software using People Code.\nDevelop the Structured Query Language (SQL) or scripts required to process the program or series of programs in both test and production environments.\nPrepares and delivers formal presentations and briefings to personnel to instruct, respond to queries, and incorporate comments concerning the use of Government, to gain support for system policies and secure system input.\nCompiles and test data with a wide range of variables in order to analyze and test the implementation of new programming methods, software and enhancements to established software products.\nEvaluating and providing recommendations on new databases technologies and architectures.\nConducts post-implementation evaluations of existing systems to determine performance and effectiveness and to solve potential problems.\n\n"}, {"jobID": "715686500", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "IT SPECIALIST (APPSW)", "companyName": "Agriculture,OfficeoftheChiefFinancialOfficer", "link": "https://www.usajobs.gov/job/715686500", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 10768094199122459}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National.\nMales born after 12/31/1959 must be Selective Service registered or exempt.\nSubject to satisfactory adjudication of background investigation and/or fingerprint check.\nSuccessful completion of one year probationary period, unless previously served.\nDirect Deposit ? Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution.\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit https://www.e-verify.gov/.\n\n\n Qualifications\n\r\n                                        Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement including time-in-grade restrictions, specialized experience and/or education, as defined below.\n\nThe following link provides more information on the qualifications for this position: Administrative and Management Positions.\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below.\n\n1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nAND\n\nSpecialized Experience: You must have one (1) year of specialized experience equivalent to at least the next lower grade level (GS-11) or pay band in the Federal service or equivalent in the public sector. Specialized experience for this position includes: Experience participating in implementations of new projects utilizing PeopleSoft to support Human Resources organizations. Experience in SQL, Oracle database, SQL Server, People Code and other various development languages. Experience in multiple operating systems like Windows, Unix, and Linux.  Experience with Configuration Management processes and tools (Quest STAT). Experience in managing all phases of the development life cycle (planning, requirements, development, software testing, implementation, and documentation). Experience in writing Application Engine components for PeopleSoft.\n\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTIME IN GRADE REQUIREMENT: If you are a current federal employee in the General Schedule (GS) pay plan and applying for a promotion opportunity, you must meet time-in-grade (TIG) requirements of 52 weeks of service at the next lower grade level (GS-11).\r\n                                    \n\n\nEducation\n\r\n                                            Education may not be substituted for specialized experience.\r\n                                        \n\n\nAdditional information\n\n\n\nCareer Transition Assistance Plan (CTAP), Reemployment Priority List (RPL), or Interagency Career Transition Assistance Plan (ICTAP): Visit the OPM website for information on how to apply as a CTAP, RPL, or ICTAP eligible. To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.\nVeterans who are preference eligible or who have been separated from the armed forces under honorable conditions after three years or more of continuous active service are eligible for consideration under the Veteran's Employment Opportunity Act (VEOA). \nFarm Service Agency (FSA) County Employees: Permanent County employees without prior Federal tenure who are selected for a Civil Service position under Public Law 105-277 will be given a career-conditional appointment and must serve a 1-year probationary period.\nFor more information on applying under special hiring authorities such as the Veteran's Recruitment Act (VRA), 30 percent disabled veterans, certain military spouses, Schedule A Disabled, etc., explore the different Hiring Paths on the USAJOBS website.\nLand Management Workforce Flexibility Act (LMWFA) provides current or former temporary or term employees of federal land management agencies opportunity to compete for permanent competitive service positions. Individuals must have more than 24 months of service without a break between appointments of two or more years. Service must be in the competitive service and have been at a successful level of performance or better. Refer to PUBLIC LAW 114-47-AUG. 7, 2015 for more information.\nThis position may be eligible to telework up to four days per week, based upon the duties of the position. This position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.\nThis is a bargaining unit position.\n\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAnalyzes functional specifications and translates them into applications that automate business processes.\nResearch, analyze, and evaluate current operations to identify problem areas and make recommendations on possible solutions.\nDevelop functional requirements and specifications for application development, and programs involving software, system components, or services in support of a user community with individuals in more than one organization or program.\nDevelop software using People Code.\nDevelop and maintain software applications and database procedures/packages such as SQL Server and Oracle Database.\nManage frequently shifting work request priorities to design, program, test, modify, refine, and integrate a related group of software programs with shared data and attributes.\nCollaborate with the customers and project/team members on program design and development.\nAnswer inquiries and participates in meetings on discussion of revisions or issues to existing programs or new program development.\nDevelop the Structured Query Language (SQL) or scripts required to process the program or series of programs in both test and production environments.\n\n"}, {"jobID": "715053100", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Computer Scientist", "companyName": "FederalAviationAdministration", "link": "https://www.usajobs.gov/job/715053100", "jobLocation": {"remote": "not specified", "city": "AtlanticCity", "state": "NJ", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 76444, "max": 1184952784}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nUS Citizenship is required.\nSelective Service Registration is required for males born after 12/31/1959.\nMust submit an SF50 (See Required Documents)\nThis position has a positive education requirement. Transcript(s) required.\nThis is not a remote position.  You will be required to report to the office.  Telework in accordance with policy.\n\n\n Qualifications\n\nTo view the complete OPM qualification standard for Computer Science, 1550, please refer to:Computer Science Series 1550 (opm.gov)Basic Requirements:Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.To qualify for this position, you must demonstrate in your application that you possess at least one year of specialized experience equivalent to FV-G, FG/GS 5/7/9. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position.Specialized experience is: Experience in software requirements, design, and test; source code generation; UNIX operating systems; test and evaluation tools; and virtual machines.OR3 years of progressively higher-level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree.Applicants should include examples of specialized experience in their work history.Qualifications must be met by the closing date of this vacancy announcement.Some, all or none of the applicants may be interviewed.\n\n\n\nEducation\n\r\n                                            This position has a positive education requirement: Applicants must submit a copy of their college or university transcripts(s) and certificates by the closing date of announcement to verify qualifications. If selected, an official transcript will be required prior to appointment. You may upload these documents with your application in USAJOBS or fax it to fax number provided in the announcement (please include announcement number on each page).Failure to do so will result in loss of consideration.Schools must be accredited by an accrediting institution recognized by the U.S. Department of Education. Accreditation may be verified at the following website: www.ed.gov/accreditation.Foreign education must be evaluated by a private professional organization specializing in interpretation of foreign education credentials or an accredited U.S. educational institution in terms of equivalence to a degree acquired at an American college or university. A copy of the evaluation results must be included, otherwise your foreign education will not be considered.\n\n\n\n\r\n                                            Preview Job Questionnaire\r\n                                        \n\r\n                                            Make sure your resume includes detailed information to support your qualifications and answers to the job questionnaire.\r\n                                        \n\n\nAdditional information\n\nWe may use this vacancy to fill other similar vacant positions.Position may be subject to a background investigation.A one-year probationary period may be required.The person selected for this position may be required to file a financial disclosure statement within 30 days of entry on duty. FAA policy limits certain outside employment and financial investments in aviation-related companies. www.faa.gov/jobs/working_here/financial_disclosure_requirementsThe U.S. Department of Transportation strives to ensure that equity, transparency, accountability, collaboration, and communication permeate all that we do for the betterment of the Department, the traveling public, and our nation. As such, DOT values a highly diverse workforce of persons who promote a culture of belonging by respecting the personal dignity and worth of each individual and fostering a positive environment where all feel safe and welcome. If these commitments coincide with your personal ideals and professional aspirations, please consider joining the DOT family.As a part of the Federal-Wide Hiring Reform Initiative (streamlining the hiring process), the FAA is committed to eliminating the use of the Knowledge, Skills and Ability (KSA) narratives from the initial application in the hiring process for all announcements. Therefore, as an applicant for this announcement, you are NOT required to provide a narrative response in the text box listed below each KSA.\n\nIn lieu of providing a KSA narrative response in the text box listed below each KSA, in your work history, please include information that provides specific examples of how you meet the response level or answer you chose for each KSA. Your work history examples should be specific and clearly reflect the highest level of ability. Your KSA answers will be evaluated further to validate whether the level that you selected is appropriate based on the work history and experience you provided. Your answers may be adjusted by a Human Resource Specialist as appropriate.Eligible applicants meeting the minimum qualification requirements and selective factor(s), if applicable, may be further evaluated on the Knowledge, Skills and Abilities (KSA) listed in the announcement. Based on this evaluation, applicants will be placed in one of the following categories: score order, category grouping, or alphabetical order and referred to the selecting official for consideration.Please ensure you answer all questions and follow all instructions carefully. Errors or omissions may impact your rating or may result in you not being considered for the job.This is not a remote position. You will be required to report to the office as determined by management. Telework in accordance with agency policy and as determined by management. This position is at the full performance level. This is a bargaining unit position. This position is represented by NFFE 1340: Tech Center Professionals.Links to Important Information: Locality Pay , COLA \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPerforms multiple, varying, and complex assignments under the direction of a manager, project/program manager, team leader, or more experienced technical specialist. Supports new weather product and capability development and evaluation activities such as development and review of software requirements, generation of weather capability source code, development of test and evaluation tools, establishment of evaluation environments, defining and configuring cloud environments, collection and archive of weather data sets, development of test plans and procedures, test and evaluation of weather products and capabilities, maintenance and configuration of laboratory resources, and the deployment of weather data services on containers and virtual machines.Participates on an interdisciplinary team of technical experts to develop, test, acquire and/or implement weather systems and capabilities into the NAS. Participates in the analysis and development of system architecture and software capabilities specifically utilizing NAS architectures and cloud-based strategies.Applies experience and detailed knowledge applicable to computer science to accomplish assignments. Understands how computer science interacts with or is affected by other disciplines and considers the objectives of the major subdivision and Line of Business (LOB)/Servicing Organization (SO) when developing, integrating, and implementing solutions to diverse, complex problems. Typical assignments may include system design and integration; requirements definition; software development; defining and/or configuring cloud environments; collecting, recording and analyzing data/information; identifying problems; and performing investigation and inspection activities.Demonstrates some independence in planning time and using assigned resources to accomplish assignments and small projects.Contacts are primarily internal to the organizational unit, major subdivisions, and LOB/SO, with some contact with contractors, customers, and external organizations. Contacts are typically intended to share information, provide data and/or written analysis, and/or discuss the statuses of assignments.Established policies/procedures provide guidance for most assignments but allow some discretion to select the most appropriate approach. Typically receives guidance on selecting approach from a manager, project/program manager, team leader or more experienced computer scientist. May provide recommendations to improve work processes.Work is reviewed periodically during assignments and at completion to ensure timeliness and technical compliance with the requirements of the projects or other work activity.\n\n"}, {"jobID": "704252800", "origin_search": "https://www.usajobs.gov/", "posted": "02/02/2023", "jobTitle": "Systems Administrator", "companyName": "U.S.Courts", "link": "https://www.usajobs.gov/job/704252800", "jobLocation": {"remote": "not specified", "city": "Pittsburgh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 51988, "max": 92852}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        This position is classified as a sensitive position which requires the selected candidate to submit to a background clearance, which will include a criminal history, credit and FBI fingerprint check as a condition of employment and may be subject to periodic updates. The selected candidate will be hired provisionally pending the successful completion of the required background check and favorable employment suitability determination.\n\nEmployees must adhere to a Code of Conduct. The Court provides reasonable accommodations to applicants with disabilities. Veterans' preference is not a factor used in Judicial Branch appointments. Applicants must be U.S. citizens or lawful permanent residents seeking U.S. citizenship. Positions with the U.S. Courts are excepted service appointments, which are \"At-Will\" and may be terminated with or without cause. Employees are required to use electronic funds transfer for payroll deposit. The court reserves the right to modify the conditions of this job announcement, to withdraw the job announcement, and/or to commence interviews immediately, any of which may occur without prior written or other notice. In the event a position becomes vacant in a similar classification within a reasonable time from the original announcement, the Clerk of Court may select an appointee from the candidates who responded to the initial announcement without posting the vacancy.\n\nThe United States District Court, Western District of Pennsylvania, is an Equal Opportunity Employer and values diversity in the workplace.\n\n\n Qualifications\n\r\n                                        To qualify for a CL-26, applicants for this position should possess a minimum of one (1) year of specialized experience.\n\nSpecialized experience is progressively responsible experience in or closely related to the position's work that has provided the particular knowledge, skills, and abilities to perform the position's duties successfully.\n\nTo qualify for a CL-27, applicants for this position should possess a minimum of two (2) years of specialized experience;\n\nor\n\nCompletion of the requirements for a bachelor's degree from an accredited college or university and one of the following superior academic achievement requirements:\n\nAn overall \"B\" grade point average equaling 2.90 or better of a possible 4.0;\nStanding in the upper third of the class;\n\"3.5\" average or better in the major field of study, such as business or public administration, human resources management, industrial relations, or psychology;\nElection to membership in Phi Beta Kappa, Sigma XI, or one of the National Honorary Scholastic Societies meeting the minimum requirements of the Association of College Honor Societies, other than Freshman Honor Societies; or\nCompletion of one academic year (18 semester or 27 quarter hours) of graduate study in an accredited university in business or public administration, political science, criminal justice, law, or other fields closely related to the subject matter of the position.\n\nAdditionally, this position requires the following:\n\n\nAbility to provide support during non-business hours (i.e., evenings, weekends) as required for projects or special events.\nAbility to lift up to 40 pounds and move light equipment as required.\nAbility to travel to multiple locations within the Western District to Pennsylvania on short notice.\n\nPreferred Qualifications/Court Preferred Skills\n\nA bachelor's degree in computer science or a related field is preferred.\nExcellent customer service skills and a detail-oriented focus.\nAbility and desire to work well with a wide variety of end-users with differing needs and experiences.\n3 - 5 years of relevant experience preferred.\nExperience managing virtual servers and desktops; and providing support to end-users utilizing thin client technologies.\nExperience supporting mobile devices, including tablets and smartphones.\nExperience troubleshooting complex software configurations that require multiple dependencies to operate.\nExperience working with secure device configurations and implementing security features before deployment.\nExperience administrating Windows and Mac operating systems and MS Office, including Teams, and the installation, support, and maintenance of those systems.\nLAN/WAN experience comprises basic knowledge of network topology and networking equipment, including IP address management.\nExperience administering Windows server roles, including Active Directory, DFS, DFS-R, DHCP, DNS, file sharing, and print management.\nExperience working with Microsoft Active Directory to assign user roles.\nExperience in the use of security and logging tools, e.g., Nessus, Apex One, ForcePoint/Websense, and Splunk. \n\n\n\n\nEducation\n\r\n                                            A bachelor's degree in computer science or a related field is preferred.\r\n                                        \n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        This position will be based in the Pittsburgh, PA Courthouse, but the incumbent will serve as part of the district-wide IT team responsible for supporting all divisional offices (Pittsburgh, Erie, and Johnstown). The work will be performed in an office setting and is only eligible for limited telework operations. Travel to other divisional offices, which may require overnight lodging may be required. Occasional emergency and after-hours coverage may be required.\n\nResponsibilities\n\nInstall, configure, and support all workstations, thin clients, laptops, mobile devices, and printers, including other peripheral devices used by the Court.\nRespond to and resolve Tier 1 and Tier 2 level help desk calls. Provide information and assistance to users on desktop applications. Assist in creating new user accounts, managing user rights, and providing end-user training.\nAnalyze ongoing end-user problems, research alternative long-term solutions, and propose migration plans. Coordinates hardware and software system installations and monitors equipment functioning to ensure specifications are met.\nProvide application and hardware instructional training to end-users on features and functions of supported software and hardware.\nManage, configure, and install wireless access points to support a public WiFi network across multiple courthouses.\nAssist with troubleshooting and end-user operational use of Courtroom Technology. Including the management and setup of audio-visual hardware and software in courtrooms and training rooms. Assisting in the development and maintenance of new and existing courtroom technology equipment.\nAssist with troubleshooting and end-user operational use of Courtroom Technology. Including the management and setup of audio-visual hardware and software in courtrooms and training rooms. Assisting in the development and maintenance of new and existing courtroom technology equipment.\nAdministrate and manage hosted end-user virtual desktops and virtual servers, providing support for Dynamic Environment Manager (DEM) profiles.\nProvide support and troubleshooting for Judges and staff in teleworking user environment. The use of multiple-factor authentication and virtual private network (VPN) technologies.\nPartners with software programmers to understand court customer needs in specific systems features. This may involve learning national systems, or it may mean participating in the planning for, and the acquisition of a specific system for the court unit.\nAnalyze system log files and identify potential issues with computer systems when alerted. Monitor network communication on an as need basis.\nStays apprised of installations, configurations, and testing of new network equipment and software, hardware, and peripherals. Will study the current network infrastructure to support questions and inquiries from the staff on issues related to network connectivity.\nAssist with the maintenance and installation of network switches. Providing support for connective problems and LAN management changes.\nProvide support for multiple database applications used by the Courts for electronic filing and case management services. Performing routine maintenance operations and installing upgrades and hotfixes as directed.\nPerform other related duties or special projects as assigned. Technology trends and infrastructure change over time, and skill sets must refresh as operational needs change.\nRespond promptly and professionally to customer/user support needs, inquiries, and requests.\n\n\n"}, {"jobID": "715107600", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Program Applications Specialist", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/715107600", "jobLocation": {"remote": "not specified", "city": "LomaLinda", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 66134, "max": 104016}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/13/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-09 position you must have served 52 weeks at the GS-07. For a GS-11 position you must have served 52 weeks at the GS-09. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade. Note: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nYou may qualify based on your experience and/or education as described below:\n\nGS-09 Qualifications:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-07 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include: Providing business oversight for a variety of software programs integral to the overall administration and operations of the business. Coordination and training for service and facility staff in business and functional areas for various information technology. Providing training and troubleshooting for clinical and administrative staff in business processes and associated supporting software. Ensures the accuracy of reports such as the Gains and Losses and AMIS reports. Provides staff support to OI&T by providing information and analysis of software functions within the service. Designating and preparing data management analyses, special studies, and reports for use by top management for budget preparation.  EVIDENCE OF YOUR EXPERIENCE MUST BE DETAILED IN YOUR RESUME TO RECEIVE FULL CREDIT.\n\nOR \n\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have a master's or equivalent graduate degree OR 2 full years of progressively higher-level graduate education leading to such a degree OR LL.B. or J.D., if related. The degree must be in education or a subject area related to the position being filled.\n\nOR,\n\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an combination of specialized experience and education as shown above. Applicants with Superior Academic Achievement on their Bachelor's Degree may use all graduate level education when combining education and experience to qualify for this position. NOTE: Both the Bachelor's and Graduate Degree Transcripts must be submitted with the application package. Otherwise, ONLY Graduate education in excess of the first full year may be used to qualify applicants for positions at grades GS-9.\n\nGS-11 Qualifications:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-09 in the normal line of progression for the occupation in the organization. Coordinating ongoing data collection and performing analysis to determine optimal organizational performance. Developing initiatives which will enable the facility to provide quality health care to its population while operating in a more effective and efficient manner.  Designing and develops dissemination and training materials, local standard operating procedure (SOP) manuals, develops and utilizes monitoring tools, and provides for the implementation of Business Office programs through on-site education and training. Identifies system inefficiencies and develops studies or data collection techniques related to specific identified problems. Compiles, summarizes, and analyzes the data collected and develops reports which reflect the scope of activities and identifies trends and opportunities for improvement. Serves as the functional \"expert\" for matters relating to the Patient Information Management System (PIMS) core package. Provides training and troubleshooting for clinical and administrative staff in business processes and associated supporting software.\n\tEVIDENCE OF YOUR EXPERIENCE MUST BE DETAILED IN YOUR RESUME TO RECEIVE FULL CREDIT.\n\nOR \n\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have a Ph.D. or equivalent doctoral degree OR 3 full years of progressively higher-level graduate education leading to such a degree OR LL.M., if related. The degree must be in education or a subject area related to the position being filled.\n\nOR,\n\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an combination of specialized experience and education as shown above. Applicants with Superior Academic Achievement on their Bachelor's Degree may use all graduate level education when combining education and experience to qualify for this position. NOTE: Transcripts must be submitted with the application package. Otherwise, ONLY Graduate education in excess of the first full year may be used to qualify applicants for positions at grades GS-9.\n\n\nYou will be rated on the following Competencies for this position:\nAdministration and ManagementCommunicationsFlexibilityTechnical Competence\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: The work is includes extended sedentary work at a desk; driving; walking; standing; bending; carrying of light items including training materials; staring at a computer screen (which may cause eye strain); copious amounts of data entry; light lifting and bending at the waist and knees; reaching.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nMajor duties include but are not limited to the following:\n\nProviding business oversight for a variety of software programs integral to the overall administration and operations of the business.\nCoordination and training for service and facility staff in business and functional areas for various information technology.\nProviding training and troubleshooting for clinical and administrative staff in business processes and associated supporting software.\nEnsures the accuracy of reports such as the Gains and Losses and AMIS reports.\nProvides staff support to OI&T by providing information and analysis of software functions within the service.\nDesignating and preparing data management analyses, special studies, and reports for use by top management for budget preparation.\nCoordinating ongoing data collection and performing analysis to determine optimal organizational performance.\nDeveloping initiatives which will enable the facility to provide quality health care to its population while operating in a more effective and efficient manner. \nDesigning and develops dissemination and training materials, local standard operating procedure (SOP) manuals, develops and utilizes monitoring tools, and provides for the implementation of Business Office programs through on-site education and training.\n Identifies system inefficiencies and develops studies or data collection techniques related to specific identified problems.\nCompiles, summarizes, and analyzes the data collected and develops reports which reflect the scope of activities and identifies trends and opportunities for improvement.\nServes as the functional \"expert\" for matters relating to the Patient Information Management System (PIMS) core package.\n Provides training and troubleshooting for clinical and administrative staff in business processes and associated supporting software.\nPerforms other duties as assigned. \n\nWork Schedule: Monday through Friday, 8:00 am to 4:30 pm\nVirtual: This is not a virtual position.\nPosition Description/PD#: Program Applications Specialist/PD13272A and PD13273A\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "713024900", "origin_search": "https://www.usajobs.gov/", "posted": "03/15/2023", "jobTitle": "Computer Engineer", "companyName": "SmithsonianInstitution", "link": "https://www.usajobs.gov/job/713024900", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 65207, "max": 101055}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMay be required to serve a one-year probationary period\nPre- and post-appointment background investigation\nMust participate in Direct Deposit/Electronic Funds for salary payment\n\n\nFor the latest information on the COVID-19 vaccination requirements and its impact on your application, click on Smithsonian Institution’s Frequently Asked Questions.   \n\n\n Qualifications\n\nBASIC REQUIREMENTS:(A) Degree: professional engineering. To be acceptable, the curriculum must: (1) be in a school of engineering with at least one curriculum accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or(2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.OR(B) Combination of education and experience--college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying professional engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering.In addition to the Basic Requirements, applicants must have specialized experience:At the grade 9: One year of professional experience  equivalent in difficulty and responsibility to grade 7 level work in the Federal service within or closely related to the position being filled.  Specialized experience at the grade 7 would typically be any combination in 1) real-time device control in an embedded or distributed system 2)data processing using high-performance computing workflows or cloud computing 3) web application programming. \nAt the grade 11: One year of professional experience equivalent in difficulty and responsibly to grade 9 level work in the Federal service within or closely related to the position being filled. Specialized experience at the grade 9 would typically be at least four of the following:\n1)real-time device control in an embedded or distributed system2) data processing using high-performance computing workflows or cloud computing3) web application programming4) designing software systems which meet specified functional and performance requirements5) documentation of software designs in both text and SysML/UML diagrams6) developing bespoke software systems in a professional setting, as part of a team, using modern programming languages7) formal software testing, using a testing framework, to verify that requirements are met.\"\nThis position has a mandatory education requirement; you must furnish a copy of your transcript of college work completed (unofficial copy is acceptable) or a copy of your degree certificate. Non-submission may result in you being rated ineligible for the position. Applicants must meet all qualification requirements by the closing date of this announcement.\nBasic qualification requirements can be found at https://www.opm.gov/qualifications/SEC-IV/A/GS-PROF.asp and https://www.opm.gov/qualifications/SEC-IV/B/GS0800/0800.htm.\n\n\n\nEducation\n\nThis position has a mandatory education requirement.\n\n\n\nAdditional information\n\nAdditional Information:\n\nThe Smithsonian does not pay relocation expenses.\nA recruitment bonus may be paid.\nThe Smithsonian embraces diversity and equal employment opportunity.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nThe Smithsonian offers a comprehensive benefits package that includes, in part, vacation and sick leave, holidays, commuter benefits, health/life insurance, and accidental insurance. Please see Benefits at http://www.cfa.harvard.edu/hr/benefits/trust/table.html for a complete description.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nDuties for grade 9  may include but are not limited to:\n1. Functions as a junior computer engineer with a focus on software development across the various astrophysics-based research, operational, and instrumentation projects which the Central Engineering department supports at CfA. Participates in code reviews to maintain a high standard of code quality across CfA.2. Develops real-time, embedded device control software and high-performance data processing pipelines with web-based user interfaces.3. Collaborates with scientists and engineers of other disciplines on projects. Provides software expertise where needed to inform non-software design decisions. Incorporates feedback from colleagues of other disciplines into software designs. Participates in system-level and software design reviews at all stages of design, including preliminary design, critical design, assembly, system integration, and commissioning.4. Provides input on software requirements. Validates and verifies software requirements through inspection, testing, and analysis.5. Documents software for both peer software developers and users of the software. Documentation includes both diagrams (UML, SysML), text, and code comments.6. Provides a good level of customer support to colleagues and other software users. Performs troubleshooting and failure analysis and provides long term support for projects.7. Develops software tests, including unit and regression tests, which are used to verify requirements and measure system performance.8. Performs other duties as assigned.\nDuties at grade 11 may include but are not limited to:\n1. Functions as a computer engineer with a focus on software development across the various astrophysics-based research, operational, and instrumentation projects which the Central Engineering department supports at CfA. Participates in code reviews to maintain a high standard of code quality across CfA.2. Develops real-time, embedded device control software and high-performance data processing pipelines with web-based user interfaces.3. Collaborates with scientists and engineers of other disciplines on projects. Provides software expertise where needed to inform non-software design decisions. Incorporates feedback from colleagues of other disciplines into software designs. Participates in system-level and software design reviews at all stages of design, including preliminary design, critical design, assembly, system integration, and commissioning.4. Writes software requirements. Validates and verifies software requirements through inspection, testing, and analysis.5. Documents software for both peer software developers and users of the software. Documentation includes both diagrams (UML, SysML), text, and code comments.6. Provides a good level of customer support to colleagues and other software users. Performs troubleshooting and failure analysis and provides long term support for projects.7. Develops software tests, including unit and regression tests, which are used to verify requirements and measure system performance.8. Performs other duties as assigned.\n\n"}, {"jobID": "715052500", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Computer Scientist", "companyName": "FederalAviationAdministration", "link": "https://www.usajobs.gov/job/715052500", "jobLocation": {"remote": "not specified", "city": "AtlanticCity", "state": "NJ", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 76444, "max": 1184952784}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nUS Citizenship is required.\nSelective Service Registration is required for males born after 12/31/1959.\nThis position has a positive education requirement. Transcript(s) required.\nThis is not a remote position.  You will be required to report to the office.  Telework in accordance with policy.\n\n\n Qualifications\n\nTo view the complete OPM qualification standard for Computer Science, 1550, please refer to:Computer Science Series 1550 (opm.gov)Basic Requirements:Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.To qualify for this position, you must demonstrate in your application that you possess at least one year of specialized experience equivalent to FV-G, FG/GS 5/7/9. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position.Specialized experience is: Experience in software requirements, design, and test; source code generation; UNIX operating systems; test and evaluation tools; and virtual machines.OR3 years of progressively higher-level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree.Applicants should include examples of specialized experience in their work history.Qualifications must be met by the closing date of this vacancy announcement.Some, all or none of the applicants may be interviewed.This is not a remote position. You will be required to report to the office as determined by management. Telework in accordance with agency policy and as determined by management.Career Path Progression Position (CPPP): This is a career path progression position and has full promotion potential to the pay band FV-I without further competition. Identification of promotion in the vacancy announcement does not constitute a commitment or an obligation on the part of management to promote the employee selected at some future date. Promotion will depend upon the selectee meeting training, qualification requirements, and recommendation by the supervisor.\n\n\n\nEducation\n\r\n                                            This position has a positive education requirement: Applicants must submit a copy of their college or university transcripts(s) and certificates by the closing date of announcement to verify qualifications. If selected, an official transcript will be required prior to appointment. You may upload these documents with your application in USAJOBS or fax it to fax number provided in the announcement (please include announcement number on each page).Failure to do so will result in loss of consideration.Schools must be accredited by an accrediting institution recognized by the U.S. Department of Education. Accreditation may be verified at the following website: www.ed.gov/accreditation.Foreign education must be evaluated by a private professional organization specializing in interpretation of foreign education credentials or an accredited U.S. educational institution in terms of equivalence to a degree acquired at an American college or university. A copy of the evaluation results must be included, otherwise your foreign education will not be considered.\n\n\n\n\r\n                                            Preview Job Questionnaire\r\n                                        \n\r\n                                            Make sure your resume includes detailed information to support your qualifications and answers to the job questionnaire.\r\n                                        \n\n\nAdditional information\n\nWe may use this vacancy to fill other similar vacant positions.Position may be subject to a background investigation.A one-year probationary period may be required.The person selected for this position may be required to file a financial disclosure statement within 30 days of entry on duty. FAA policy limits certain outside employment and financial investments in aviation-related companies. www.faa.gov/jobs/working_here/financial_disclosure_requirementsThe U.S. Department of Transportation strives to ensure that equity, transparency, accountability, collaboration, and communication permeate all that we do for the betterment of the Department, the traveling public, and our nation. As such, DOT values a highly diverse workforce of persons who promote a culture of belonging by respecting the personal dignity and worth of each individual and fostering a positive environment where all feel safe and welcome. If these commitments coincide with your personal ideals and professional aspirations, please consider joining the DOT family.As a part of the Federal-Wide Hiring Reform Initiative (streamlining the hiring process), the FAA is committed to eliminating the use of the Knowledge, Skills and Ability (KSA) narratives from the initial application in the hiring process for all announcements. Therefore, as an applicant for this announcement, you are NOT required to provide a narrative response in the text box listed below each KSA.\n\nIn lieu of providing a KSA narrative response in the text box listed below each KSA, in your work history, please include information that provides specific examples of how you meet the response level or answer you chose for each KSA. Your work history examples should be specific and clearly reflect the highest level of ability. Your KSA answers will be evaluated further to validate whether the level that you selected is appropriate based on the work history and experience you provided. Your answers may be adjusted by a Human Resource Specialist as appropriate.Eligible applicants meeting the minimum qualification requirements and selective factor(s), if applicable, may be further evaluated on the Knowledge, Skills and Abilities (KSA) listed in the announcement. Based on this evaluation, applicants will be placed in one of the following categories: score order, category grouping, or priority grouping and referred to the selecting official for consideration.This is not a remote position.  You will be required to report to the office as determined by management.  Telework eligible as determined by management.  This position is at the full performance level. This is a bargaining unit position. This position is represented by NFFE 1340: Tech Center Professionals.Links to Important Information: Locality Pay , COLA \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPerforms multiple, varying, and complex assignments under the direction of a manager, project/program manager, team leader, or more experienced technical specialist. Supports new weather product and capability development and evaluation activities such as development and review of software requirements, generation of weather capability source code, development of test and evaluation tools, establishment of evaluation environments, defining and configuring cloud environments, collection and archive of weather data sets, development of test plans and procedures, test and evaluation of weather products and capabilities, maintenance and configuration of laboratory resources, and the deployment of weather data services on containers and virtual machines.Participates on an interdisciplinary team of technical experts to develop, test, acquire and/or implement weather systems and capabilities into the NAS. Participates in the analysis and development of system architecture and software capabilities specifically utilizing NAS architectures and cloud-based strategies.Applies experience and detailed knowledge applicable to computer science to accomplish assignments. Understands how computer science interacts with or is affected by other disciplines and considers the objectives of the major subdivision and Line of Business (LOB)/Servicing Organization (SO) when developing, integrating, and implementing solutions to diverse, complex problems. Typical assignments may include system design and integration; requirements definition; software development; defining and/or configuring cloud environments; collecting, recording and analyzing data/information; identifying problems; and performing investigation and inspection activities.Demonstrates some independence in planning time and using assigned resources to accomplish assignments and small projects.Contacts are primarily internal to the organizational unit, major subdivisions, and LOB/SO, with some contact with contractors, customers, and external organizations. Contacts are typically intended to share information, provide data and/or written analysis, and/or discuss the statuses of assignments.Established policies/procedures provide guidance for most assignments but allow some discretion to select the most appropriate approach. Typically receives guidance on selecting approach from a manager, project/program manager, team leader or more experienced computer scientist. May provide recommendations to improve work processes.Work is reviewed periodically during assignments and at completion to ensure timeliness and technical compliance with the requirements of the projects or other work activity.\n\n"}, {"jobID": "716036900", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "COMPUTER SCIENTIST", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/716036900", "jobLocation": {"remote": "not specified", "city": "PatrickAFB", "state": "FL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 83399, "max": 108419}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nAll new DCIPS employees are required to complete a two-year DCIPS trial period\nPosition is designated special-sensitive and requires eligibility for access to Sensitive Compartmented Information (SCI), other intelligence-related Special Sensitive information, or involvement in Top Secret Special Access (continued)\nPrograms (SAP) to fully perform the duties and responsibilities of the position. A non-disclosure agreement must be signed\nTravel and relocation expenses WILL NOT be paid\nThis posn is subject to provisions of the DoD Priority Placement Program\nMust be registered for Selective Service, see Legal and Regulatory Guide\nThis position has been designated by the Air Force as a Testing Designated Position (TDP) under the Air Force Civilian Drug Demand Reduction Program. Employee must pass initial and periodic short notice drug testing\nThe employee may be required to travel in military and/or commercial aircraft to perform temporary duty assignments\nEmployee may be required to undergo CI Polygraph examination in accordance with security regulations involving material handled\nEmployee may be required to work irregular duty hours such as evenings, weekends and/or holidays for urgent operational support requirements and provide support for operations. Other duties as assigned\nDirect Deposit: All federal employees are required to have direct deposit\nDisclosure of Political Appointments\nRecruitment Incentive may be authorized for this position\nRelocation Incentive may be authorized for this position\nLeave accrual may be authorized upon request\n\n\n Qualifications\n\nThis is a GG-12 position in the Defense Civilian Intelligence Personnel System (DCIPS). The GG-12 duties for the \"Professional\" work category are at the \"Full Performance\" work level and are equivalent to those at the GS-12 level. The selectee's salary will be set within the grade equivalent to a GS/GG grade based on the selectee's qualifications in relation to the job.\n\nIn order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions.\n\nBASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT:\n\nBachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\n\nEXPERIENCE REQUIRED: Your resume must reflect the quality level of experience which demonstrates the possession of the knowledge, skills, abilities, and competencies necessary for successful job performance required for this position. Examples of creditable experience include knowledge and experience with software development life cycles, including software design and development concepts and techniques sufficient to design, develop, code, test, debug, document and install large complex programs. Experience with computer assisted software engineering tools in the design and development process is desirable. Note: Creditable experience may include previous military experience, experience gained in the private sector, or experience gained in another government agency.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge and experience with software development life cycles, including software design and development concepts, models, and techniques sufficient to design, develop, code, test, debug, document, and install large complex programs and systems. Experience with computer assisted software engineering (CASE) tools in the design and development process is desirable.\n2. Knowledge and experience with several of the following: high-level programming languages such as Python, FORTRAN, C/C++C#, Java; Scientific programming such as Machine Learning, linear and vector algebra, Fourier/spectral analysis or related scientific programming; Graphical User Interface programming APIs such as Qt, GTK, X11, Java AWT/SWING/JFreeChart; Markup languages such as XML, KML, ChemML, HTML; Parallel/multi-threaded programming using APIs such as POSIX Threads, OpenMP and/or MPI; Continuous Integration (CI) and DevOps systems tool chains and best practices; RDBMS systems such as Oracle, and RDBMS APIs such as PL/SQL, OCI/OCCI, ODBC, JDBC, DBI; Software assurance and configuration management using tools such as GITLab, Fortify, Coverity, Blackduck, etc.; Scripting language such as sh, csh, Python, JavaScript, lua, ruby; UNIX operating systems such as Linux and Solaris; UNIX utilities/tools such as sed, awk, chron, make/cmake; virtual machines and containers such as kubernetes, virtual box, docker, etc.\n3. Knowledge of security procedures to maintain control of classified material\n4. Ability to gather, organize and analyze data.\n5. Ability to maintain an up-to-date awareness of technological advances and apply them to meet future requirements.\n6. Ability to serve as team leader or member for dynamic short-term projects and to coordinate and document the work of the team.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11906242\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nSelectees who physically reside permanently in the U.S., the Commonwealth of Puerto Rico or Northern Mariana Islands, and the Possessions of the U.S., during the entire recruitment process (application, selection, and acceptance of a formal job offer) and selected for employment in the foreign area are eligible to receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, Post Allowance, Home Leave, etc. (subject to approval)\n\nSelectees who physically reside outside the U.S., the Commonwealth of Puerto Rico or Northern Mariana Islands, and the Possessions of the U.S., during any step of the recruitment process (application, selection, and acceptance of a formal job offer) will have foreign area benefits eligibility be determined on a case by case basis.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Duty 1: Serves as a consultant and advisor in specific areas of computer software specialization to senior EMS program technical authorities. Provides recommendations on continuous improvement of the EMS program's software baseline, development process, and methodologies.\nDuty 2: Responsibilities are characterized by complex and unique software projects. Experience, professional judgement, and insight are required to independently identify, investigate, analyze, and resolve complex and difficult technical problems.\nDuty 3: Projects include software change requests for Operations & Maintenance (O&M) and studies for Research & Development Testing and Evaluation (RDT&E) efforts.\nDuty 4: Responsibilities include software engineering responsibility of the EMS mission platforms, development of action plans, identification, and programming of requirements; development of briefings, technical reports, and other documentation; coordination of other activities to support assigned projects\n\n"}, {"jobID": "714647400", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "GENERAL ENGINEER", "companyName": "NavalAirSystemsCommand", "link": "https://www.usajobs.gov/job/714647400", "jobLocation": {"remote": "not specified", "city": "PatuxentRiver", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nGenerally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade.  Time-in-grade requirements must be met by the closing date of this announcement.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA). Certification in the Acquisition Functional Area and category assigned to the position is required within established category timeframes.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\nYour resume must demonstrate at least one year of specialized experience at or equivalent to the (DP-03) grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Providing authoritative input and advice on all engineering and technical issues and ensures engineering requirements are met; 2) Developing project-planning objectives for engineering development of current and long range programs; 3) Performing or directing technical analyses required during the development phase; 4) Assisting in the preparation, planning and development of integrated solutions for system deployment and sustainment for assigned systems; 5) Maintaining continuous contact with research and development personnel in order to be informed on all new engineering and scientific developments of assigned systems; 6) Organizing and performing technical reviews to ensure adequate resources for assigned systems. \n\nAdditional qualification information can be found from the following Office of Personnel Management website:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=List-by-Occupational-Series AND https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/files/all-professional-engineering-positions-0800.pdf\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            Applicants must meet the following basic education requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual:\n\nSuccessful completion of a professional engineering degree. To be acceptable, the program must: (1) lead to a bachelor's degree (or higher) in a school of engineering with at least one program accredited by the Accreditation Board for Engineering and Technology (ABET); or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. Such education must demonstrate the knowledge, skills, and abilities necessary to do the work of the position.\n\nOR\n\nCurrent registration as an Engineer Intern (EI), Engineer in Training (EIT), or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration For more information about EI and EIT registration requirements, please visit the National Society of Professional Engineers website at: http://www.nspe.org\n\nOR\n\nEvidence of having successfully passed the Fundamentals of Engineering (FE) examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico The FE examination is not administered by the U. S. Office of Personnel Management. For more information, please visit: http://www.nspe.org/Licensure/HowtoGetLicensed/index.html.\n\nOR\n\nSuccessful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and in engineering that included the courses specified in the basic requirements under paragraph A (above). The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A (above)\n\nOR\n\nSuccessful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least one year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily, there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions.\n\n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher.  ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will apply systems engineering processes to the analysis, development, testing, and deployment of CPS software.\nYou will analyze, document, and review CPS emerging requirements.\nYou will analyze the impact of changes to CPS system requirements and interfaces.\nYou will participate in vendor technical interchange meetings and review vendor technical recommendations.\nYou will lead working groups to address engineering and technical challenges that require analysis of alternatives.\nYou will engage with users to collect input and feedback to improve and enhance CPS.\nYou will coordinate with test and evaluation activities for assessment of CPS software.\nYou will contribute to, and provide peer review for, technical White Papers.\nYou will contribute to MBSE descriptions of the system, and review vendor produced MBSE models.\nYou will conduct technical Risk Management and tracking.\nYou will participate on change management and configuration management processes and review boards.\nYou will provide technical input and review to project plans, project schedules, project roadmaps\nYou will author reports, briefs, provide progress reviews, and brief Senior NAVAIR Leadership on status and technical analysis\nYou will collaborate with leadership, other engineers, vendors, and software project leads in an Agile software development processes to evolve user requirements into solutions that enhance the CPS capabilities.\nYou will participate in Agile software development processes including backlog grooming, backlog prioritization, sprint reviews, program increment reviews, and capability evaluation.\nYou will assist with vendor tasking, guidance, and oversight in the development of technical SOWs, participation with TIMs, PMRs, and review of CDRLs.\nYou will advise and assist NAVAIR executives, managers, and supervisors in the planning and implementation of systems engineering and digital engineering policy and guidance.\nYou will support project planning and technical cost estimates.\nYou will be performing Systems Engineering activities for a software intensive program that is developing hypersonic missile mission planning and execution solutions.\n\n"}, {"jobID": "714477700", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "DATA SCIENTIST", "companyName": "U.S.ArmyCommunicationsElectronicsCommand", "link": "https://www.usajobs.gov/job/714477700", "jobLocation": {"remote": "not specified", "city": "AberdeenProvingGround", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nOne  year trial/probationary period may be required.\nYou will be required to provide proof of U.S. Citizenship.\nThis is an Army Acquisition, Logistics and Technology Workforce position.\nSelectee must meet position requirements for Engineering and Technical Management certification within 36 months as of entrance on duty.\nThis position has a Temporary Duty (TDY) or business travel requirement of 25% of the time.\nThis position requires the incumbent be able to obtain and maintain a determination of eligibility for a Top Secret security clearance or access for the duration of employment. A background investigation and credit check are required.\nThis position requires pre-employment financial disclosure and annually thereafter in accordance with DoD Directive 5500-7-R.\nThis position is subject to a pre-employment drug screening, and random testing thereafter, to include testing based on reasonable suspicion and testing due to direct involvement with an on-duty accident.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the education and experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nBasic Requirement for Data Scientist: Degree: Bachelor's degree (or higher degree) in mathematics, statistics, computer science, data science or a field directly related to the position. The degree must be in a major field of study (at least at the baccalaureate level) that is appropriate for the position.\nYou must submit a copy of your transcript(s).\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below.\n\nSpecialized Experience: To qualify, applicants must possess one year of experience which prepared you to do the work in this job. Specialized experience is defined as performing duties that include: One year of specialized experience equivalent to at least the NH-02/GS-11 grade level in the Federal service which includes: 1) Performing software development and hardware integration using modern software languages such as C, C++, C#, and/or Java; 2) Designing, developing, and testing of software; performing hands-on integration and testing of software with target hardware in the loop; and 3) Coordinating the efforts of coworkers and contractors in the analysis and development of future software design and programming techniques. \n\nSome federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the basic education requirement and experience qualification requirement - no substitution of education for experience is permitted.\n\nThis is a DoD Civilian Acquisition Workforce Personnel Demonstration Project (Acq Demo) position in the NH-03 broadband, subject to the CECOM control point policy. Management will set the pay for this position consistent with the qualifications and education of the selectee and the expected contribution for the position.\r\n                                    \n\n\nEducation\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nDirect Deposit of Pay is required.\nThis non-supervisory position is subject to a salary control point equivalent to the GS-13, step 10 base salary, or if the incumbent's salary currently exceeds the GS-13, step 10 level the incumbent's salary will be put on a salary control point at the incumbents existing salary.\nThis position is NOT 100% telework. Situational or emergency telework my be permitted in accordance with agency policy.\nThis position requires pre-employment drug screening and annually thereafter.\nThis position requires you to submit a Confidential Financial Disclosure Report (OGE450) upon entry, and annually thereafter.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 34 - Information Technology Management position.\nMultiple positions may be filled from this announcement.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nSalary includes applicable locality pay or Local Market Supplement.\nAdvance in-hire may be authorized.\nAdvanced leave accrual may be authorized.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPerform Data Science research to establish objectives and approach.\nMust have the ability to isolate and define critical features of the problem; formulation and application of methodology; identification of alternative courses of action; and clear, concise, presentation of results (oral and written).\nConduct analysis and generate studies to support civilian industry, and government procurement entities.\nProvide technical expertise and analyses regarding software support for organizational systems in one or more IT functions such as software development, software testing, and evaluation.\nDevelop statistical software and computer programs to perform analysis of statistical data and findings.\nPerform software development and hardware integration using modern software languages.\nAssess contractors research and development efforts and modifies, realigns or redirects this effort to assure fulfillment of requirements and attainment of objectives.\nInterpret quantitative information, trends, relationships, and correlations among data sets.\n\n"}, {"jobID": "716668800", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "IT SPECIALIST (SYSANALYSIS/APPSW)", "companyName": "AirForceMaterielCommand", "link": "https://www.usajobs.gov/job/716668800", "jobLocation": {"remote": "not specified", "city": "Wright-PattersonAFB", "state": "OH", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 85738, "max": 111460}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nA security clearance may be required\nRecruitment incentives may/may not be authorized\nThis posn is subject to provisions of the DoD Priority Placement Program\nEmployee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays\nShift work and emergency overtime may be required\nEmployee must maintain current certifications\nDisclosure of Political Appointments\nDirect Deposit: All federal employees are required to have direct deposit.\nThis position has been designated as an acquisition position and is covered by the Acquisition Professional Development Program (APDP).\nThe employee must meet, or be capable of meeting, Defense Acquisition Work Improvement Act (DAWIA) requirements applicable to the duties of the position.\nInformation Assurance Certification is a condition of employment.\nThis position includes information assurance (IA) work as a paramount duty requirement.  Per DoD 8570.01-M, the incumbent of this position must achieve the appropriate IA certification within six months of assignment of these duties.\nA waiver of this six month requirement may be granted per DoD 8570.01-M, C3.2.4.2 or C3.2.4.3.  Failure to receive the proper IA certification may result in removal from this position.\nThis positions meets the administrative exemption criteria for the Fair Labor Standards Act (5 CFR 551.206)\n\n\n Qualifications\n\r\n                                        Experience requirements are described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, .IAW OPM Qualification Standards IOR for Information Technology (IT) Management Series, 2210 (Alternative A). There are no Group Coverage Qualification Standards for this series.\n\nDue to the use of 120-day rosters, this period of experience may be completed within 120 days of the closing date of this announcement.\n\nSPECIALIZED EXPERIENCE:  Applicants must have at least one year (52 weeks) of specialized experience at the next lower grade GS-11, or equivalent in other pay systems. Examples of specialized experience includes I have at least one (1) year of software development and functional analysis experience at the next lower grade GS-11, or equivalent. Experience must include demonstrated skills in software code-analysis, design, development, testing techniques with ability to fix code, programming, scripting, etc., and develop functional requirements to support the software system. Exhibit knowledge of programming language(s) and DevSecOps principles. NOTE: Due to the use of 120-day rosters, this period of experience may be completed within 120 days of the closing date of this announcement.\n\nFEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-­grade requirements to be considered eligible. One year at the GS-11 level is required to meet the time-in-grade requirements for the GS-12 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of IT systems analysis and applications software concepts, functions, techniques, and capabilities sufficient to evaluate new and emerging IT security methods and principles, the feasibility of proposed new systems and applications software projects; and to design, write, test, debug, and maintain information systems and applications software and ensure successful integration with existing and anticipated infrastructure in the database environment.\n2. Knowledge of IT system application software and systems development life cycles, including systems documentation, system requirements and techniques, design development, configuration management, cost benefit analysis, systems analysis, unprecedented design methodologies, data administration, systems integration, and testing.\n3. Knowledge of IT management information systems and applications software technology to isolate causes of problems between hardware, system, and applications software programs and to measure system performance and/or extend operating system capabilities to support organizational business processes and operations.\n4. Knowledge of IT management information systems requirements and application software development techniques required in carrying out project assignments of considerable difficulty and with little specificity regarding approach to be followed.\n5. Ability to gather facts and use analytical and evaluative methods to assess requirements; apply CASE tools to design and development processes; deviate from traditional methods; and solve a variety of complex or intricate computer software problems.\n6. Ability to maintain an up-to-date awareness of technological advances and predict how management can meet future requirements.\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\nCurrent Federal Civilian employees may apply for temporary and term positions and if selected, a break in service may be required prior to appointment to the position.\n\nTemporary and Term Appointments:  If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: Military Spouse Preference applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for Military Spouse Preference. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11911059\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        1. Analyzes complex processes and/or a variety of unusual problems, questions, or conditions relative to the design and/or selection of management information systems and applications software technology.\n2. Develops and maintains required programs to support the needs of the user.\n3. Performs required testing, troubleshoots, and corrects system and applications software discrepancies.\n4. Participates in discussions, meetings, committees or special projects and presents briefings and prepares recommendations and reports.\r\n                                    \n"}, {"jobID": "714643800", "origin_search": "https://www.usajobs.gov/", "posted": "03/23/2023", "jobTitle": "Electronics Engineer", "companyName": "SmithsonianInstitution", "link": "https://www.usajobs.gov/job/714643800", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 77738, "max": 101055}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMay be required to serve a one-year probationary period.\nPre- and post-appointment background investigation.\nMust participate in Direct Deposit/Electronic Funds for salary payment.\n\n\nFor the latest information on the COVID-19 vaccination requirements and its impact on your application, click on Smithsonian Institution’s Frequently Asked Questions.   \n\n\n Qualifications\n\nBasic qualification requirements can be found at https://www.opm.gov/qualifications/SEC-IV/A/GS-PROF.asp and https://www.opm.gov/qualifications/SEC-IV/B/GS0800/0800.htm.\n\n\n\nEducation\n\nBASIC REQUIREMENTS:(A) Degree: professional engineering. To be acceptable, the curriculum must: (1) be in a school of engineering with at least one curriculum accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or\n(2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.OR(B) Combination of education and experience--college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying professional engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering.\nIn addition to the Basic Requirements, applicants must have specialized experience:\nCandidates must possess one year of specialized experience at least equivalent to the grade 9 level. Specialized experience typically will require PCB board layout done from start to finish independently on Altium and/or similar software, and independent firmware development which was successfully deployed on hardware.\n\n\n\nAdditional information\n\n• The Smithsonian does not pay relocation expenses.• A recruitment bonus may be paid.• The Smithsonian embraces diversity and equal employment opportunity.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nFor our comprehensive benefits information please see our benefits page at https://lweb.cfa.harvard.edu/hr/benefits/\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAt the SAO, engineers work collaboratively with scientists to develop instrumentation that will get us closer to answering these questions. From world-wide telescope arrays that can image black holes to space missions studying solar emissions, this is truly a fantastic place to work – full of opportunities and challenges for engineers. The position is located in Cambridge Mass.\nPURPOSE OF THE POSITION: The purpose of this job is to provide electronics engineering system support to the Next Generation Event Horizon Telescope (ngEHT) instrument development team. The ngEHT project seeks to take the next steps in trying to elucidate mysteries of fundamental physics. To that end, the instrumentation that is designed to be deployed is cutting edge and extremely challenging both in the area of high frequency analog signal processing and very high speed digital signal processing.\nDuties:\n1. Functions as a mid-level FPGA firmware engineer to implement firmware solutions for the ngEHT including testing and debugging of new and existing firmware.\n2. Performs basic checking of electrical circuits and systems designs. Assists engineers in the design and construction of lab bench test setups for the evaluation of both purchased and in-house-designed instrument system components.\n3. Prepares formal schematics, schematic capture, parts/materials lists, and component assembly drawings from preliminary sketches or verbal instructions and translates electrical designs to PCB layouts and Interfaces with fabrication companies for ordering and inventory management.\n4. Provides technical direction to, and reviews the work of, printed circuit layout vendors.\n5. Translates and develops 3D models of assemblies for hosting electrical hardware and performs thermal analysis to meet the stringent requirements at telescope sites using Solidworks or similar software.\n6. Develops embedded software for control and monitoring of instrumentation.\n7. Supports engineering design reviews, Configuration Control Board, and technical meetings.\n8. Collaborates with scientists and multi-disciplinary engineering staff as needed to ensure success of system development.\n9. Participates in regular planning and status reporting activities.\n10. Performs other duties as assigned.\n\n"}, {"jobID": "714041900", "origin_search": "https://www.usajobs.gov/", "posted": "03/17/2023", "jobTitle": "Network System Administrator", "companyName": "U.S.Courts", "link": "https://www.usajobs.gov/job/714041900", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 66250, "max": 12806466250}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Must be a citizen of the United States or meet requirements for compensation under current law. Positions with the U.S. Courts are excepted service appointments, meaning they are at will and can be terminated with or without cause by the Court. Employees are subject to The Judicial Code of Ethics and Conduct, which is available to applicants for review upon request. All applicant information is subject to verification. The appointment to the position is provisional pending a suitability determination by the Court based on the results of an FBI background investigation, which includes fingerprinting, that is updated every five years. Employees are required to use Electronic Funds Transfer (EFT) for payroll deposits.\n\nThe Court reserves the right to modify the conditions of this job announcement, to withdraw the job announcement, or to fill the position sooner than the closing date, if a closing date is shown; any of these actions may occur without any notice.\r\n                                    \n\n Qualifications\n\nRequired Qualifications\n\nCL-28: Two (2) years, or CL-29: Three (3) years of full-time specialized experience.\nKnowledge of computer hardware, software, and networks.\nKnowledge of Microsoft Office 365.\nKnowledge of theories, principles, practices and techniques of computer hardware and software applications.\nExperience with Microsoft Windows Server, DNS, and Group Policy.\nExperience with networking equipment including routers, switches, and wireless technologies (preferably Cisco).\nMust be an innovative and creative problem-solver who can effectively work with management on projects and daily challenges.\nExceptional ability to communicate technical concepts to non-technical staff.\nThe incumbent must always manifest the highest degree of professionalism, courtesy, tact, and diplomacy; have excellent written, oral, and interpersonal skills; and unquestionable integrity.\nAbility to work independently and in a team environment as well as the ability to manage multiple projects and priorities within strict deadlines in a fast-paced environment.\nOccasional travel. Duties may require working outside of normal business hours. Physical effort may be involved in moving, connecting, or troubleshooting equipment.\n\nPreferred Qualifications\n\nExperience with Quest KACE or Microsoft SCCM.\nFamiliarity with CIS Controls or implementing CIS Benchmarks.\n\n\n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nThis announcement can also be viewed on the Fourth Circuit's website at https://www.ca4.uscourts.gov/\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nWe are looking for someone who is attentive to details, creative, has an outstanding work ethic, can meet tight deadlines, has unquestionable integrity, is collaborative, listens, communicates well, and has a passion for delivering excellent customer service.\n\nTHIS IS YOUR OPPORTUNITY TO\n\nAnalyze, isolate, and solve complex system problems.\nRecommend, install, configure, and provide technical support for complex administrative operations specific to national applications.\nInstall, configure, administer, and troubleshoot server operating systems, firewalls, routers, switches, and wireless access points.\nImplement new network solutions and/or improve the efficiency of current networks.\nEnsure operating systems and systems software components are properly installed, maintained, and supported.\nPlan, design, and implement group policies.\nSupport Active Directory and DNS.\nSupport infrastructure and users throughout the circuit.\nPrepare clear and effective written instructions as well as reports and memoranda for users and IT staff.\nPerform other duties as assigned or necessary.\n\n\n"}, {"jobID": "715836800", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "IT SPECIALIST (APPSW)", "companyName": "DefenseFinanceandAccountingService", "link": "https://www.usajobs.gov/job/715836800", "jobLocation": {"remote": "not specified", "city": "Indianapolis", "state": "IN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 53309, "max": 90992}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship or National\nSuitable for Federal Employment\nRegistered for Selective Service (if applicable)\nThis national security position, which may require access to classified information, requires a favorable suitability review and security clearance as a condition of employment. Failure to maintain security eligibility may result in termination.\n\n\n Qualifications\n\r\n                                        Resumes for federal government positions need more detailed work descriptions and accomplishments than a typical private sector resume. Please be sure to clearly describe the full scope of your work experiences in your resume.\n\nBasic Requirement: Applicants must have IT-related experience demonstrating the following competencies appropriate to, or above, the level of this position. Your resume and work experience should clearly support your ability to meet these competencies and will be evaluated as part of the entire application process.\n\nAttention to Detail- experience reviewing my own information technology-related work or data to ensure accuracy, completeness, and consistency with standards. My work or the data that I produce is typically reviewed by my supervisor or another colleague\nCustomer Service- experience having brief contact with customers to provide information about available information technology products and services and providing customers with standard products or routine services to address information technology needs\nOral Communication- experience informing my supervisor and other IT staff of the status of information technology systems, projects, or daily operations, including the status of information technology systems, projects, or daily operations, including the communication of basic technical information to a non-technical audience\nProblem Solving- identifying or selecting from a number of alternatives to address routine information technology-related issues by gathering and applying information from standard sources that provide a limited number of solutions\n\nFOR ENTRY AT THE GS-7 LEVEL:\nIn addition to the Basic Competency Requirements listed above: One year of specialized experience equivalent in level of difficulty and responsibility to that of the next lower grade (GS-5) in the federal service, which demonstrates the ability to perform the duties of the position, is required.\nSpecialized experience is described as: Assisting senior developers in providing analysis, design, coding, testing and implementation of software and automated systems; applying basic IT principles and practices to assist in providing software and systems development and support.\n\nFOR ENTRY AT THE GS-9 LEVEL:\nIn addition to the Basic Competency Requirements listed above: One year of specialized experience equivalent in level of difficulty and responsibility to that of the next lower grade (GS-7) in the federal service, which demonstrates the ability to perform the duties of the position, is required.\nSpecialized experience is described as: Providing input to design specifications, coding, test plans, and issue resolution of software and automated systems; analyzing and refining software and systems requirements; applying IT principles and practices to in the software development process; and some experience with programming languages.\n\nFOR ENTRY AT THE GS-11 LEVEL:\nIn addition to the Basic Competency Requirements listed above: One year of specialized experience equivalent in level of difficulty and responsibility to that of the next lower grade (GS-9) in the federal service, which demonstrates the ability to perform the duties of the position, is required.\nSpecialized experience is described as: Designing, developing, implementing, coding, testing, operating, modifying software and automated systems; conducting systems requirement reviews; applying IT principles and practices to the software development process; and experience with programming languages.\n\nVolunteer Experience: Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nFOR ENTRY AT THE GS-7 LEVEL:\nSubstitution of Education for Experience:\nOne year of graduate education in computer science, engineering, info science, info systems management, mathematics, operations research, statistics, or tech management; or a bachelor's degree with superior academic achievement (S.A.A.) that provided a minimum 24 semester hours in one or more of the fields above and required the development or adaptation of applications, systems or networks, may be substituted to meet the specialized experience requirement. S.A.A. is based on (1) class standing, (2) grade-point average, or (3) honor society membership.\n\nFOR ENTRY AT THE GS-9 LEVEL:\nSubstitution of Education for Experience:\nQualifying Master's degree or equivalent graduate degree or 2 full years of graduate education leading to a Master's degree or equivalent graduate degree in computer science, engineering, info science, info systems management, mathematics, operations research, statistics, or tech management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above & required the development or adaptation of applications, systems or networks.\n\nFOR ENTRY AT THE GS-11 LEVEL:\nSubstitution of education for experience:\nQualifying Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\n**Combination of education and experience is not applicable for this position.**\n\n\n\nAdditional information\n\n\nCOVID-19 WORKPLACE SAFETY PROTOCOLS: To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the COVID-19 vaccination mandate is not presently being enforced as a condition of employment for this position.\nMoving expenses will be paid.\nTelework availability will be based upon the mission requirements and supervisory determination.\nSelections are subject to restrictions resulting from the DoD Program for Stability of Civilian Employment.\nEmployment with DFAS means access to generous benefits such as: health, vision, and dental insurance, retirement benefits, paid time off, and educational benefits.\nA one year probationary period may be required.\nWe may use this announcement to fill additional vacancies within 90 days of the closing date.\nThis position is Non-Exempt at the GS-7 and GS-9 level and Exempt at the GS-11 level from the Fair Labor Standards Act.\nTravel requirement is occasional\nThis position is covered by a bargaining unit.\nThis position is being filled under the Direct Hire Authority for Certain Personnel of the Department of Defense via delegated authority by the Office of the Secretary of Defense. Positions may be filled as permanent or term with a full-time or part-time work schedule. Pay will vary by geographic location. We reserve the right to close this announcement early or to extend, as appropriate, based upon the needs of the Agency. Qualified application packages may be referred to management at various points in the selection process depending on the number and timing of applications received. Selections may be made at any point during the announcement open period.\nVeteran's Preference: Veteran's preference does not apply under this Direct Hire Authority (DHA).\nThis position will be covered by a formal training under the DFAS Career Acclimation Program (DCAP). The purpose of this program is to develop well-qualified, well-trained, high potential employees for future positions within DFAS. Promotion is conditional based on performance, successful completion of training, and availability of higher graded work. Participants who do not successfully complete the program may be separated.\nDFAS recognizes the value of competencies gained through formal education and professional certifications. To ensure that consistent credit is given for these credentials in the selection process DFAS has developed standard selection criteria to be used when filling positions in professional and administrative series. Selections for professional and administrative positions will be based on four categories of selection criteria: Experience, Other, Education, and Certifications.\nMales born after 12-31-59 must be registered or be exempt from Selective Service (see http://www.sss.gov).\nRetired Civil Service Employee: Employment of retired Federal employees receiving an annuity is subject to the requirements of the Department of Defense (DoD) policy guidance. (See DoD Instruction 1400.25, Volume 300, here).\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nProvide application software support to an assigned system through design, development, testing and implementation of new or modified applications software.\nIdentify system change requirements in order to develop new functions within an assigned application system or to maintain current production applications.\nDesigns modifications to internal program structures in files and records and determines detailed sequence of steps and program logic.\nPrepares test data and assists with or conducts functional testing of programs to determine accuracy and functional capability.\nWrites and maintains IT instructions, program maintenance manuals, run time instructions, and other similar documentation.\n\n"}, {"jobID": "716757800", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Lead IT Specialist (APPSW)", "companyName": "DefenseContractManagementAgency", "link": "https://www.usajobs.gov/job/716757800", "jobLocation": {"remote": "not specified", "city": "MountLaurel", "state": "NJ", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 108084, "max": 140506}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. citizen\nSecurity Requirements: Non-Critical Sensitive with Secret Access\nAppointment is subject to the completion of a favorable suitability or fitness determination, where reciprocity cannot be applied; unfavorably adjudicated background checks will be grounds for removal.\nSelective Service Requirement: Males born after 12-31-59 must be registered or exempt from Selective Service.\n\n\n Qualifications\n\nTo qualify for a Lead IT Specialist (APPSW), your resume and supporting documentation must support:\n\nA. Specialized Experience: One year of specialized experience that equipped you with the particular competencies to successfully perform the duties of the position and is directly in or related to this position. To qualify at the GS-13 level, applicants must possess one year of specialized experience equivalent to the GS-12 level or equivalent under other pay systems in the Federal service, military or private sector. Applicants must meet eligibility requirements including time-in-grade, time-after-competitive appointment (only for MP & IMP), minimum qualifications, and any other regulatory requirements by the cut-off/closing date of the announcement.Creditable specialized experience includes:\n\nParticipating in the design and development stages of software needed for computer/computer supported equipment.\nUtilizing analysis-structured design, structured programming, and structured testing techniques in order to conduct top down and/or bottom-up design analysis and continuing evaluation of the evolving software products.\nInterpreting and applying software development specifications, technical data, governing regulations, policy and planning concepts, quality assurance policy statements, and other guidelines in order to insure a comprehensive and cost-effective software quality assurance program.\n\n\nAND\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below.\n\n1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\r\n                                    \n\n\nEducation\n\nSubstitution of education may not be used in lieu of specialized experience for this grade level.\n\n\n\n\nAdditional information\n\n\nThis position does not meet criteria for appointment of Reemployed Annuitants. The DoD criteria for hiring Reemployed Annuitants can be found at: https://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf\nTour of Duty: Flexible\nFLSA: Exempt\nBargaining Unit: Yes\nSelectee may be required to serve a trial/probationary period.\nRecruitment/Relocation/Retention Incentive may be authorized at Management's discretion. \nPermanent Change of Station (PCS) expenses maybe paid in accordance with the Joint Travel Regulation (JTR). When you perform a civilian PCS with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information.\nAcquisition, Technology & Logistics(AT&L) NON-CAP: Position requires DoD Acquisition Engineering &Technical Management, Practitionercertification within required timeframes. Selectee must also achieve 80 hours of Continuous Learning Points (CLPs) every 2-years. Click here for more details and Resources.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you will be required to report to the official duty location and may be expected to temporarily telework. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a specific period of time determined by your supervisory chain. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs the Lead SAM Specialist and SME, provide administrative and technical leadership to members of the SAM team with process and program oversight surveillance of contractor operations and procedures relative to Software Acquisition Management.\nLead the team in identifying, distributing and balancing workload and tasks among employees in accordance with established workflow, skill level, and/or occupational specialization and provide training or arranges for training of team members.\nServe as a software representative on assigned contractors with responsibility for preplanning, coordinating and performing a full range of Software Acquisition Management duties.\nApply substantial mastery of information technology principles and software development practices and methodologies to evaluate suppliers? software engineering programs.\nUtilize software tools and databases for contract information, software resource estimating, logging activities, return on investment calculations and cost monitoring.\nProvide substantive participation in software testing, retesting, regression testing, Independent Verification and Validation (IV and V) during the testing phase of software development.\nProvide active engagement and interchange on substantive technical software development issues with the contractor, Program management office (PMO), and the buying activity.\n\n"}, {"jobID": "715331900", "origin_search": "https://www.usajobs.gov/", "posted": "03/25/2023", "jobTitle": "IT Specialist (CUSTSPT)", "companyName": "IndianHealthService", "link": "https://www.usajobs.gov/job/715331900", "jobLocation": {"remote": "not specified", "city": "Phoenix", "state": "AZ", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 53309, "max": 82854}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Must pass pre-employment examination.\nSelectee may be subject to a probationary/trial period\nESEP appointees typically serve a two year trial period\nU.S. Citizenship is required\nSelective Service Registration is required for males born after 12/31/1959\n\nThis is a designated position covered by Public Law 101-630, requiring contact or control over Indian children. Due to this requirement, the agency must ensure that persons hired for these positions have not been found guilty of or pleaded nolo contendere or guilty to certain crimes.\n\nConfidential Financial Disclosure Form required.\n\nMeasles and Rubella immunization required for selectees born after 1957 and seasonal influenza immunization is required for all staff working in Indian Health Service health care facilities.\n\nCOVID-19 vaccination is required for all selectees prior to entrance on duty.\n\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.\n\nYou will need to set up direct deposit so we can pay you.\n\nBackground Investigation: If you are selected for this vacancy, you must undergo a pre-employment fingerprint check and background investigation. Fingerprint results and background investigation documentation must be cleared prior to hire. After you begin your employment, your continued employment is contingent upon the outcome of a complete background investigation as determined by the sensitivity level of your position. The investigation must find that you are suitable for Federal employment in your position. If you are found not suitable, you will be terminated after you begin work. If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or subject to possible criminal charges. You may be subject to a credit check as a part of the background investigation process.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, your resume must state sufficient experience and/or education, to perform the duties of the specific position for which you are applying.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; social). You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nBASIC REQUIREMENT(S):\nIndividual Occupational Requirements\nNOTE: When this qualification standard is used, agencies must have documentation based on a job analysis to substantiate that the position requires IT-related education and/or IT-related experience upon entry.\nEducation: All academic degrees and coursework must be from accredited or pre-accredited institutions.\nUndergraduate or Graduate Education: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields, identified above and required the development of adaptation of applications, systems or networks.\n\nMINIMUM QUALIFICATIONS, GS-2210-07:Your resume must demonstrate at least one (1) year of specialized experience equivalent to at least the GS-05 grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks: Examples include: planning and delivery of IT Customer support services; providing Point of Care Customer Service, resolving customer related technical software and hardware problems in accordance with established policies and procedure; assists users in resolving technical computer problems and malfunctions; plans, organizes, builds, and distributes PC's and laptops; Provides technical support to users for computer software; installs new software, versions, and updates; adapts, configures and test computer software;\n\nOR\n\nSuccessfully completed (1) year of graduate education from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, mathematics operations research, statistics, or technology management or a degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks. (Must submit copy of transcripts);\n\nOR\n\nSuccessfully completed a Bachelor's degree from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management with one of the following: I graduated with at least an overall GPA of 2.95, or I graduated with at least a 3.45 GPA in my major or during the last two years of college; or I graduated in the top third of my class; or I have been a member of a national scholastic honor society recognized by the Association of College Honor Societies. (Must submit copy of transcripts);\n\nOR\n\nPossess a combination of specialized experience and graduate education that meets 100% of the qualification requirements for this position (Must submit copy of transcripts).\n\nMINIMUM QUALIFICATIONS, GS-2210-09:\nYour resume must demonstrate at least one (1) year of specialized experience equivalent to at least the GS-07 grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks: Examples include: Prepares and disseminates information, makes recommendations on the potential use of new developments in IT; instructs users on proper use of software systems to improve usage of microcomputers; determine the exact nature of the problem and provides users with solutions; Install or repair network cables, including fiber optic cables; provides customer assistance and training for all IT Systems and applications utilized; Ensure proper security measures on information systems through the use of appropriate guidelines, procedures, security tools, and user training;\n\nOR\n\nSuccessfully completed (2) years of graduate education from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, mathematics operations research, statistics, or technology management or a degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks. (Must submit copy of transcripts);\n\nOR\n\nSuccessfully completed a master's or equivalent degree from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, and mathematics, operations research, statistics, or technology management. (Must submit copy of transcripts);\n\nOR\n\nPossess a combination of education and experience that when combined fully meet the minimum qualifications for this position. The total percentage equals at least 100 percent to qualify for this GS-09 grade level (Must submit copy of transcripts).\n\nTime In Grade\nFederal employees in the competitive service are also subject to the Time-In-Grade Requirements: Merit Promotion (status) candidates must have completed one year of service at the next lower grade level. Time-In-Grade provisions do not apply under the Excepted Service Examining Plan (ESEP).\n\nYou must meet all qualification requirements within 30 days of the closing date of the announcement. \n\n\n\nEducation\n\r\n                                            This position has an education requirement. You are strongly encouraged to submit a copy of your transcripts or a list of your courses including titles, credit hours completed, and grades. Unofficial transcripts will be accepted in the application package. Official transcripts will be required from all selectees prior to receiving an official offer.\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education may be credited. Applicants can verify accreditation at the following website: https://www.ed.gov/accreditation.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nPer IHS policy (SGM 21-04) IHS selectees to positions located in Federally operated hospitals, health centers, and clinics must be fully vaccinated for COVID-19 before entry on duty or have IHS approve a medical or religious exemption. If an exemption is approved then wearing a face mask and regular testing for COVID-19 will be required. Your Human Resources Specialist will provide a list of documents acceptable as vaccination proof and instructions on how to submit your vaccination documentation or how to request a medical or religious exemption, if needed.\n\nThis position is eligible for workplace flexibilities which may include remote work or telework options, and/or flexible work scheduling. These flexibilities may be requested in accordance with the HHS Workplace Flexibilities policy. https://www.hhs.gov/about/agencies/asa/ohr/hr-library/990-1/index.html.\n\nAdditional selection(s) of candidates may be possible within 240 days from the date the certificate of eligibles was issued for this announcement.\n\nFederal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. IHS may offer newly-appointed Federal employees credit for their directly related previous non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave.\n\nThis position is covered by a Bargaining Unit.\n\nRecruitment or relocation incentives may be authorized. At least a one (1) year service agreement will be required.\n\nThis position has promotion potential to the GS-09 grade level. Promotion to the next grade level is at management's discretion and is based on your demonstrated ability to perform the higher level duties, the continuing need for the higher level duties, and \"Regulatory/Administrative\" approval. Promotion to the next higher grade level is not guaranteed and no promise of promotion is implied.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nProvides customer assistance and training for all IT Systems and applications utilized throughout Phoenix Area Office. Customer requests for assistance may be submitted via telephone, e-mail, or in person. Incumbent will troubleshoot and provide solutions to customer requests for assistance in resolving complex hardware and software problems, occasionally escalating issues to a higher graded specialist or supervisor; identify and analyze problematic software and hardware trends that may require in-depth inquiry; research for possible solutions, or task the appropriate subject matter expert or section capable of resolving the problem.\nSupports user access to various information systems for PAO users including but not limited to account management (e.g., resetting passwords, access, and verify codes, electronic signatures, and disabling accounts). Ensures proper security measures on information systems through the use of appropriate guidelines, procedures, security tools, and user training.\nIncumbent provides technical assistance to ensure information technology systems have minimal disruption. Proactively interacts with users to ensure proper operation of computer systems, hardware, and software; demonstrates processes and provides orientation for new users, provides technical hands-on assistance with software installations and updates, hardware configurations, and communication networking to support daily operations and major fielding activities, provides instructions to customers on accessing data, processing, space utilization efficiencies, and program recovery techniques. Consult with customers regarding potential system or program upgrades.\nIncumbent shares responsibilities for the maintenance of location telecommunication network (VoIP), including installation, maintenance, and troubleshooting of system. Tests, maintains, installs, modifies, relocates, checks, and services government owned, Internet Protocol (IP), digital and analog telephone equipment and circuits. Manage minor IT projects from initiation to completion.\nInventory and maintain stock of expendable and non-expendable computer supplies sufficient to ensure the uninterrupted operation of the systems; participate in the maintenance of Information Technology equipment inventory.\n\n\n"}, {"jobID": "678322000", "origin_search": "https://www.usajobs.gov/", "posted": "01/24/2023", "jobTitle": "Nurse (Clinical Accountability and Metrics)-ESEP/MP", "companyName": "IndianHealthService", "link": "https://www.usajobs.gov/job/678322000", "jobLocation": {"remote": "not specified", "city": "Gallup", "state": "NM", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 99539, "max": 129401}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Selectee may be subject to a probationary/trial period\nESEP appointees typically serve a two year trial period\nU.S. Citizenship is required\nSelective Service Registration is required for males born after 12/31/1959\n\nThis is a designated position covered by Public Law 101-630, requiring contact or control over Indian children. Due to this requirement, the agency must ensure that persons hired for these positions have not been found guilty of or pleaded nolo contendere or guilty to certain crimes.\n\nYou will need to set up direct deposit so we can pay you.\n\nConfidential Financial Disclosure Form required.\n\nMeasles and Rubella immunization required for selectees born after 1957 and seasonal influenza immunization is required for all staff working in Indian Health Service health care facilities.\n\nCOVID-19 vaccination is required for all selectees prior to entrance on duty.\n\nThe selected individual is required to obtain and maintain any licensure requirements. If licenses are not obtained or maintained during employment, the employee will be subject to adverse actions, up to and including removal from Federal service.\n\nMaybe required to work weekends, nights, and Federal Holidays.\n\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.\n\nBackground Investigation: If you are selected for this vacancy, you must undergo a pre-employment fingerprint check and background investigation. Fingerprint results and background investigation documentation must be cleared prior to hire. After you begin your employment, your continued employment is contingent upon the outcome of a complete background investigation as determined by the sensitivity level of your position. The investigation must find that you are suitable for Federal employment in your position. If you are found not suitable, you will be terminated after you begin work. If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or subject to possible criminal charges. You may be subject to a credit check as a part of the background investigation process.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, your resume must state sufficient experience and/or education, to perform the duties of the specific position for which you are applying.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; social). You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nBASIC REQUIREMENT(S):\nEducation: A graduate or higher level degree, bachelor's degree, associate degree, or diploma from an accredited professional nursing educational program is required. This education must have been accredited by the Commission on Collegiate Nursing Education, Council on Accreditation of Nurse Anesthesia Educational Programs, Accreditation Commission for Midwifery Education, or an accrediting body recognized by the U.S. Department of Education at the time the degree was obtained.\nDegree from Foreign Nursing School: Official certification from the Commission on Graduates of Foreign Nursing Schools is required for individuals who graduated from foreign nursing schools.\nLicensure: For all grade levels and positions, applicants must have passed the National Council Licensure Examination (external link). In addition, they must possess a current, active, full, and unrestricted license or registration as a professional nurse from a State, the District of Columbia, the Commonwealth of Puerto Rico, or a territory of the United States.\n\nBasic Requirements for the GS-12 (or equivalent) Grade Level\nIn addition to the mandatory license and education described above under Basic Requirements applicants must have at least one or more full years of professional nursing experience that is equivalent to the next lower grade level.\nyou must also meet the Minimum Qualifications stated below.\n\nMINIMUM QUALIFICATIONS:\nGS-12: Your resume must demonstrate at least one (1) year of specialized experience equivalent to at least the next lower grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks: Implementing, analyzing, coordinating and evaluating multi-service clinical software applications in a hospital or clinic setting; Evaluating, managing and developing solutions to program failures following implementation of software patches. Teaching and training end-users regarding clinical software applications. Experience coordinating services for patients with chronic conditions requiring a long-term plan of care.\n\nTime In Grade\nFederal employees in the competitive service are also subject to the Time-In-Grade Requirements: Merit Promotion (status) candidates must have completed one year of service at the next lower grade level. Time-In-Grade provisions do not apply under the Excepted Service Examining Plan (ESEP).\n\nYou must meet all qualification requirements within 30 days of the closing date of the announcement. \n\n\n\nEducation\n\r\n                                            This position has an education requirement. You are strongly encouraged to submit a copy of your transcripts or a list of your courses including titles, credit hours completed, and grades. Unofficial transcripts will be accepted in the application package. Official transcripts will be required from all selectees prior to receiving an official offer.\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education may be credited. Applicants can verify accreditation at the following website: https://www.ed.gov/accreditation.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nPer IHS policy (SGM 21-04) IHS selectees to positions located in Federally operated hospitals, health centers, and clinics must be fully vaccinated for COVID-19 before entry on duty or have IHS approve a medical or religious exemption. If an exemption is approved then wearing a face mask and regular testing for COVID-19 will be required. Your Human Resources Specialist will provide a list of documents acceptable as vaccination proof and instructions on how to submit your vaccination documentation or how to request a medical or religious exemption, if needed.\n\nThis position is eligible for workplace flexibilities which may include remote work or telework options, and/or flexible work scheduling. These flexibilities may be requested in accordance with the HHS Workplace Flexibilities policy. https://www.hhs.gov/about/agencies/asa/ohr/hr-library/990-1/index.html.\n\nAdditional selection(s) of candidates may be possible within 240 days from the date the certificate of eligibles was issued for this announcement.\n\nFederal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. IHS may offer newly-appointed Federal employees credit for their directly related previous non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave.\n\nThis position is covered by a Bargaining Unit.\nNo recruitment or relocation incentives.\nThis position has no promotion potential.\nNo government housing. \n\nThis position meets the criteria specified in pillar number one of the five pillars of the PHS Commissioned Corps. PHS Commissioned Officers interested in performing the duties of this position within the Commissioned Corps MUST apply online under the merit promotion announcement indicated above in order to receive consideration. For more information on PHS Commissioned Corps, visit the website at: https://www.usphs.gov/.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n02/13/2023: This position is being re-announced to solicit additional candidates. Applicants who previously applied to this announcement need not re-apply unless submitting updated information and/or missing forms.\nThis position will be OPEN UNTL FILLED. \n\nThis position is being announced concurrently under Direct Hire Authority (DHA). Please review vacancy announcement number IHS-22-GA-11571753-DHA for eligibility requirements. NOTE: Applicants must apply separately for each announcement in order to be considered.\n\nThe applications coordinator manages the customization of the site parameters, table maintenance, technical settings and addresses integration issues with other software packages.\nPeriodically reviews site parameters and local tables with each service for accuracy and completeness. Coordinates implementation of new software products obtained by the facility that cover these functions.\nAnalyzes and evaluates processes related to information flow. Works with department chiefs, clinical leaders and staff providing consultation on integration of information systems implementation with clinical, business and administrative systems redesign as an integral function to clinical application management, training and implementation.\nMaintains awareness and comprehensive understanding of all clinical software activities throughout the\n\tservice unit. Such activities may include, but are not limited to, electronic health information database (Script Pro, Omnicell, etc.) and teleradiology and telemedicine programs\nPerforms administrative, consultative, or staff advisory work concerning the administration of a nursing program for hospital, clinic, or other medical care facility.\n\n\n"}, {"jobID": "678322700", "origin_search": "https://www.usajobs.gov/", "posted": "01/24/2023", "jobTitle": "Nurse (Clinical Accountability and Metrics)-DHA", "companyName": "IndianHealthService", "link": "https://www.usajobs.gov/job/678322700", "jobLocation": {"remote": "not specified", "city": "Gallup", "state": "NM", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 99539, "max": 129401}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Selectee may be subject to a probationary/trial period\nU.S. Citizenship is required\nSelective Service Registration is required for males born after 12/31/1959\n\nThis is a designated position covered by Public Law 101-630, requiring contact or control over Indian children. Due to this requirement, the agency must ensure that persons hired for these positions have not been found guilty of or pleaded nolo contendere or guilty to certain crimes.\n\nYou will need to set up direct deposit so we can pay you.\n\nConfidential Financial Disclosure Form required.\n\nMeasles and Rubella immunization required for selectees born after 1957 and seasonal influenza immunization is required for all staff working in Indian Health Service health care facilities.\n\nCOVID-19 vaccination is required for all selectees prior to entrance on duty.\n\nThe selected individual is required to obtain and maintain any licensure requirements. If licenses are not obtained or maintained during employment, the employee will be subject to adverse actions, up to and including removal from Federal service.\n\nMaybe required to work weekends, nights, and Federal Holidays.\n\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.\n\nBackground Investigation: If you are selected for this vacancy, you must undergo a pre-employment fingerprint check and background investigation. Fingerprint results and background investigation documentation must be cleared prior to hire. After you begin your employment, your continued employment is contingent upon the outcome of a complete background investigation as determined by the sensitivity level of your position. The investigation must find that you are suitable for Federal employment in your position. If you are found not suitable, you will be terminated after you begin work. If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or subject to possible criminal charges. You may be subject to a credit check as a part of the background investigation process.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, your resume must state sufficient experience and/or education, to perform the duties of the specific position for which you are applying.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; social). You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nBASIC REQUIREMENT(S):\nEducation: A graduate or higher level degree, bachelor's degree, associate degree, or diploma from an accredited professional nursing educational program is required. This education must have been accredited by the Commission on Collegiate Nursing Education, Council on Accreditation of Nurse Anesthesia Educational Programs, Accreditation Commission for Midwifery Education, or an accrediting body recognized by the U.S. Department of Education at the time the degree was obtained.\nDegree from Foreign Nursing School: Official certification from the Commission on Graduates of Foreign Nursing Schools is required for individuals who graduated from foreign nursing schools.\nLicensure: For all grade levels and positions, applicants must have passed the National Council Licensure Examination (external link). In addition, they must possess a current, active, full, and unrestricted license or registration as a professional nurse from a State, the District of Columbia, the Commonwealth of Puerto Rico, or a territory of the United States.\n\nBasic Requirements for the GS-12 (or equivalent) Grade Level\nIn addition to the mandatory license and education described above under Basic Requirements applicants must have at least one or more full years of professional nursing experience that is equivalent to the next lower grade level.\nyou must also meet the Minimum Qualifications stated below.\n\nMINIMUM QUALIFICATIONS:\nGS-12: Your resume must demonstrate at least one (1) year of specialized experience equivalent to at least the next lower grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks: Implementing, analyzing, coordinating and evaluating multi-service clinical software applications in a hospital or clinic setting; Evaluating, managing and developing solutions to program failures following implementation of software patches. Teaching and training end-users regarding clinical software applications. Experience coordinating services for patients with chronic conditions requiring a long-term plan of care.\n\nYou must meet all qualification requirements within 30 days of the closing date of the announcement. \n\n\n\nEducation\n\r\n                                            This position has an education requirement. You are strongly encouraged to submit a copy of your transcripts or a list of your courses including titles, credit hours completed, and grades. Unofficial transcripts will be accepted in the application package. Official transcripts will be required from all selectees prior to receiving an official offer.\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education may be credited. Applicants can verify accreditation at the following website: https://www.ed.gov/accreditation.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nPer IHS policy (SGM 21-04) IHS selectees to positions located in Federally operated hospitals, health centers, and clinics must be fully vaccinated for COVID-19 before entry on duty or have IHS approve a medical or religious exemption. If an exemption is approved then wearing a face mask and regular testing for COVID-19 will be required. Your Human Resources Specialist will provide a list of documents acceptable as vaccination proof and instructions on how to submit your vaccination documentation or how to request a medical or religious exemption, if needed.\n\nThis position is eligible for workplace flexibilities which may include remote work or telework options, and/or flexible work scheduling. These flexibilities may be requested in accordance with the HHS Workplace Flexibilities policy. https://www.hhs.gov/about/agencies/asa/ohr/hr-library/990-1/index.html.\n\nAdditional selection(s) of candidates may be possible within 240 days from the date the certificate of eligibles was issued for this announcement.\n\nFederal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. IHS may offer newly-appointed Federal employees credit for their directly related previous non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave.\n\nThis position is covered by a Bargaining Unit.\nNo recruitment or relocation incentives.\nThis position has no promotion potential.\nNo government housing.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n02/13/2023: This position is being re-announced to solicit additional candidates. Applicants who previously applied to this announcement need not re-apply unless submitting updated information and/or missing forms.\nThis position will be OPEN UNTL FILLED.  \n\nThis position is being announced concurrently under Excepted Service Examining Plan/ Merit Promotion Plan (ESEP/MP)procedures. Please review vacancy announcement number IHS-22-GA-11571752-ESEP/MP; for eligibility requirements. NOTE: Applicants must apply separately for each announcement in order to be considered.\n\nThe applications coordinator manages the customization of the site parameters, table maintenance, technical settings and addresses integration issues with other software packages.\nPeriodically reviews site parameters and local tables with each service for accuracy and completeness. Coordinates implementation of new software products obtained by the facility that cover these functions.\nAnalyzes and evaluates processes related to information flow. Works with department chiefs, clinical leaders and staff providing consultation on integration of information systems implementation with clinical, business and administrative systems redesign as an integral function to clinical application management, training and implementation.\nMaintains awareness and comprehensive understanding of all clinical software activities throughout the\n\tservice unit. Such activities may include, but are not limited to, electronic health information database (Script Pro, Omnicell, etc.) and teleradiology and telemedicine programs\nPerforms administrative, consultative, or staff advisory work concerning the administration of a nursing program for hospital, clinic, or other medical care facility.\n\n\n"}, {"jobID": "716425100", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "IT Specialist (SYSADMIN/SYSANALYSIS)", "companyName": "BonnevillePowerAdministration", "link": "https://www.usajobs.gov/job/716425100", "jobLocation": {"remote": "not specified", "city": "Portland", "state": "OR", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 105666, "max": 137363}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. Citizen or National.\nThis employer participates in the e-Verify program.\nMales born after 12/31/1959 must be registered for Selective Service.\nSuitable for Federal employment, as determined by a background investigation.\nMay be required to successfully complete a probationary period.\nThis position does not support remote work. You will be required to report physically to the official reporting worksite as specified by the supervisor, but no less than 2 days per pay period.\nOccasionally called outside regularly scheduled hours for consultation related to computer operations, equipment failure or program revisions.\nAt times must come in to give assistance in correcting problems.  May be required to participate in an after-hours On-Call rotation.\nA preliminary background check must be completed before a new employee can begin work. Current Federal employees or other individuals with an existing completed background investigation may not be required to undergo another background check.\n\n\n Qualifications\n\nBASIC REQUIREMENT: You must have IT-related experience demonstrating each of the four (4) competencies listed below. The experience must be IT related and may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification) as appropriate.\n- Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n- Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n- Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n- Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nTo meet this requirement you must demonstrate \"Advanced\" level proficiency in each of the four competencies listed above as follows:\nAdvanced - You can perform the actions associated with each of these competencies without assistance. You are recognized within your immediate organization as \"a person to ask\" when difficult questions arise regarding each of these competencies. Focus is on broad organizational/professional issues; You have consistently provided practical/relevant ideas and perspectives on process or practice improvements which may easily be implemented; You are capable of coaching others in the application of each of these competencies by translating complex nuances relating to each competency into easy to understand terms; You participate in senior level discussions regarding these competencies; You assist in the development of reference and resource materials in these competencies.\n\nSPECIALIZED EXPERIENCE REQUIREMENTS: A qualified candidate's online application and resume must demonstrate at least one year of specialized experience equivalent to the next lower grade level GS-12] in the Federal service.\n\nSpecialized experience for this position is defined as: (1) Installing, testing, troubleshooting, and maintaining hardware and software systems supporting Voice/Voip call recording, Voice/Voip data reporting Systems or voice data commercial application software administration (e.g. NICE, Microcall, Avtec). (2) Installing, testing, troubleshooting, and maintaining hardware and server operating systems (e.g. Windows Server 20xx). (3) Providing advice, guidance, and recommendations to management and other technical specialists on critical IT issues. (4) Modifying, adapting, and refining broad IT guidelines to resolve issues and problems that result in new policies and practices\n\"Experience\" refers to paid and unpaid experience. Examples of qualifying unpaid experience may include: volunteer work done through National Service programs (such as Peace Corps and AmeriCorps); as well as work for other community-based philanthropic and social organizations. Volunteer work helps build critical competencies, knowledge, and skills; and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nCTAP/ICTAP candidates: To be considered \"well qualified\" you must meet all of the requirements as described in this section.\n\nYou must meet all qualifications and eligibility requirements by the closing date of this announcement.\n\n\n\nEducation\n\nThere are no specific education requirements or substitution of education for experience for this position.\n\n\n\nAdditional information\n\nVancouver, WA, is a splendid place to live because of its picturesque downtown area full of trendy shops, delicious restaurants, and exclusive breweries. There are several breathtaking nature parks, miles of bike trails, and amazing panoramic mountain views! Vancouver is the perfect place for anyone who loves to be outdoors and really enjoys nature!\n\nPortland, OR boasts huge spans of amazing trees, foliage, landscape, and everywhere you look you can appreciate beautiful greenery! It is known as the most bike-friendly city in America, has a train system that greets you at the airport spanning across the city, and is home to the Portland International Rose Garden, the oldest in the country! Portland is the one place where you will find lively festivals, energetic music, mouthwatering food, and for you basketball fans, the Portland Trail Blazers are a 7 minute walk from the HQs building!\n\nThe U.S. Department of Energy fosters a diverse and inclusive workplace and is an Equal Opportunity Employer.\nThis job opportunity announcement may be used to fill additional similar vacancies across DOE.\nFor general information on government-wide Telework polices visit: www.telework.gov\nInformation on how to create a federal resume\nhttps://www.usa.gov/government-jobs\nhttps://www.usajobs.gov/Help/how-to/account/documents/resume/\nhttps://www.youtube.com/watch?v=8YX7o1PBoFk\n\nVeterans and persons with disabilities are encouraged to apply. For more information, please visit the links at the bottom of this page or visit the FedsHireVets website.\n\nIf you believe that you are eligible for the Interagency Career Transition Assistance Program (ICTAP), please visit the OPM ICTAP/CTAP website for more information. In order to be considered under the ICTAP program, your application must score within the pre-established \"well qualified\" category as stated in the Qualifications section.\n\nSome positions may require completion of a probationary period of up to 1 (one) year.\n\nMany positions require successful completion of a background investigation.\n\nAll males born after December 31st 1959 must abide by laws regarding Selective Service registration. To learn more about this law, visit the Selective Service web page, Who Must Register. If you are not registered and don't have an approved exemption, you will not be eligible for employment with the Federal government.\n\nEEO Policy: http://www.usajobs.gov/eeo\nReasonable Accommodation Policy: http://www.usajobs.gov/raps\nVeterans Information: http://www.usajobs.gov/vi\nTelework: www.telework.gov\nSelective Service Registration: http://www.sss.gov/\n\nHiring incentives may be authorized for a highly qualified candidate based on budget availability and in accordance with federal regulations.\n\nBPA strives to ensure a safe, positive, inclusive work environment, supported by Leadership Behaviors. For more information on Leadership Behaviors visit: www.bpa.gov/goto/LeadershipBehaviors\n\nWe also understand the importance of work/life balance and offer a variety of programs and policies designed to create more flexible, responsive work environments supportive of commitments to community, home and family members. BPA also supports employees' overall wellness through its Be Well program, which helps employees adopt healthier lifestyles and feel better about their work/life balance. The program supports five key areas of life: career, community, financial, physical and social.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs a IT Specialist (SYSADMIN/SYSANALYSIS), you will:\n\nPerform a variety of work involving planning and coordinating the installation, testing, operation, troubleshooting, and maintenance of hardware and software systems supporting the Voice/Voip call recording, Voice/Voip data reporting Systems or voice data commercial application software administration (NICE, Microcall, Avtec).\nPlan and conducts evaulations to determine capacity requirements and recommend hardware/software replacements or upgrades to meet current and future requirements.\nDevelop standards and criteria for assessing server performance.\nOversee the application administration throughout the enterprise.\nLead studies designed to identify potential improvements in the way information technology is applied to key business functions.\nPlan and coordinates System implementation of process improvement methods and concepts to improve the quality of software products.\n\nThis position may be located in Vancouver, WA or Portland, OR. The duty location for this position will be determined at the time of selection.\r\n                                    \n"}, {"jobID": "716425400", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "IT Specialist (SYSADMIN/SYSANALYSIS)", "companyName": "BonnevillePowerAdministration", "link": "https://www.usajobs.gov/job/716425400", "jobLocation": {"remote": "not specified", "city": "Portland", "state": "OR", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 105666, "max": 137363}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. Citizen or National.\nThis employer participates in the e-Verify program.\nMales born after 12/31/1959 must be registered for Selective Service.\nSuitable for Federal employment, as determined by a background investigation.\nMay be required to successfully complete a probationary period.\nThis position does not support remote work. You will be required to report physically to the official reporting worksite as specified by the supervisor, but no less than 2 days per pay period.\nOccasionally called outside regularly scheduled hours for consultation related to computer operations, equipment failure or program revisions.\nAt times must come in to give assistance in correcting problems.  May be required to participate in an after-hours On-Call rotation.\nA preliminary background check must be completed before a new employee can begin work. Current Federal employees or other individuals with an existing completed background investigation may not be required to undergo another background check.\n\n\n Qualifications\n\nBASIC REQUIREMENT: You must have IT-related experience demonstrating each of the four (4) competencies listed below. The experience must be IT related and may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification) as appropriate.\n- Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n- Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n- Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n- Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nTo meet this requirement you must demonstrate \"Advanced\" level proficiency in each of the four competencies listed above as follows:\nAdvanced - You can perform the actions associated with each of these competencies without assistance. You are recognized within your immediate organization as \"a person to ask\" when difficult questions arise regarding each of these competencies. Focus is on broad organizational/professional issues; You have consistently provided practical/relevant ideas and perspectives on process or practice improvements which may easily be implemented; You are capable of coaching others in the application of each of these competencies by translating complex nuances relating to each competency into easy to understand terms; You participate in senior level discussions regarding these competencies; You assist in the development of reference and resource materials in these competencies.\n\nSPECIALIZED EXPERIENCE REQUIREMENTS: A qualified candidate's online application and resume must demonstrate at least one year of specialized experience equivalent to the next lower grade level GS-12] in the Federal service.\n\nSpecialized experience for this position is defined as: (1) Installing, testing, troubleshooting, and maintaining hardware and software systems supporting Voice/Voip call recording, Voice/Voip data reporting Systems or voice data commercial application software administration (e.g. NICE, Microcall, Avtec). (2) Installing, testing, troubleshooting, and maintaining hardware and server operating systems (e.g. Windows Server 20xx). (3) Providing advice, guidance, and recommendations to management and other technical specialists on critical IT issues. (4) Modifying, adapting, and refining broad IT guidelines to resolve issues and problems that result in new policies and practices\n\"Experience\" refers to paid and unpaid experience. Examples of qualifying unpaid experience may include: volunteer work done through National Service programs (such as Peace Corps and AmeriCorps); as well as work for other community-based philanthropic and social organizations. Volunteer work helps build critical competencies, knowledge, and skills; and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTime-in-Grade: Current Federal employees must meet time-in-grade requirements by the closing date of this announcement to receive consideration.\n\nCTAP/ICTAP candidates: To be considered \"well qualified\" you must meet all of the requirements as described in this section.\n\nYou must meet all qualifications and eligibility requirements by the closing date of this announcement.\n\n\n\nEducation\n\nThere are no specific education requirements or substitution of education for experience for this position.\n\n\n\nAdditional information\n\nVancouver, WA, is a splendid place to live because of its picturesque downtown area full of trendy shops, delicious restaurants, and exclusive breweries. There are several breathtaking nature parks, miles of bike trails, and amazing panoramic mountain views! Vancouver is the perfect place for anyone who loves to be outdoors and really enjoys nature!\n\nPortland, OR boasts huge spans of amazing trees, foliage, landscape, and everywhere you look you can appreciate beautiful greenery! It is known as the most bike-friendly city in America, has a train system that greets you at the airport spanning across the city, and is home to the Portland International Rose Garden, the oldest in the country! Portland is the one place where you will find lively festivals, energetic music, mouthwatering food, and for you basketball fans, the Portland Trail Blazers are a 7 minute walk from the HQs building!\n\nThe U.S. Department of Energy fosters a diverse and inclusive workplace and is an Equal Opportunity Employer.\nThis job opportunity announcement may be used to fill additional similar vacancies across DOE.\nFor general information on government-wide Telework polices visit: www.telework.gov\nInformation on how to create a federal resume\nhttps://www.usa.gov/government-jobs\nhttps://www.usajobs.gov/Help/how-to/account/documents/resume/\nhttps://www.youtube.com/watch?v=8YX7o1PBoFk\n\nVeterans and persons with disabilities are encouraged to apply. For more information, please visit the links at the bottom of this page or visit the FedsHireVets website.\n\nIf you believe that you are eligible for the Interagency Career Transition Assistance Program (ICTAP), please visit the OPM ICTAP/CTAP website for more information. In order to be considered under the ICTAP program, your application must score within the pre-established \"well qualified\" category as stated in the Qualifications section.\n\nSome positions may require completion of a probationary period of up to 1 (one) year.\n\nMany positions require successful completion of a background investigation.\n\nAll males born after December 31st 1959 must abide by laws regarding Selective Service registration. To learn more about this law, visit the Selective Service web page, Who Must Register. If you are not registered and don't have an approved exemption, you will not be eligible for employment with the Federal government.\n\nEEO Policy: http://www.usajobs.gov/eeo\nReasonable Accommodation Policy: http://www.usajobs.gov/raps\nVeterans Information: http://www.usajobs.gov/vi\nTelework: www.telework.gov\nSelective Service Registration: http://www.sss.gov/\n\nHiring incentives may be authorized for a highly qualified candidate based on budget availability and in accordance with federal regulations.\n\nBPA strives to ensure a safe, positive, inclusive work environment, supported by Leadership Behaviors. For more information on Leadership Behaviors visit: www.bpa.gov/goto/LeadershipBehaviors\n\nWe also understand the importance of work/life balance and offer a variety of programs and policies designed to create more flexible, responsive work environments supportive of commitments to community, home and family members. BPA also supports employees' overall wellness through its Be Well program, which helps employees adopt healthier lifestyles and feel better about their work/life balance. The program supports five key areas of life: career, community, financial, physical and social.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs a IT Specialist (SYSADMIN/SYSANALYSIS), you will:\n\nPerform a variety of work involving planning and coordinating the installation, testing, operation, troubleshooting, and maintenance of hardware and software systems supporting the Voice/Voip call recording, Voice/Voip data reporting Systems or voice data commercial application software administration (NICE, Microcall, Avtec).\nPlan and conducts evaulations to determine capacity requirements and recommend hardware/software replacements or upgrades to meet current and future requirements.\nDevelop standards and criteria for assessing server performance.\nOversee the application administration throughout the enterprise.\nLead studies designed to identify potential improvements in the way information technology is applied to key business functions.\nPlan and coordinates System implementation of process improvement methods and concepts to improve the quality of software products.\n\nThis position may be located in Vancouver, WA or Portland, OR. The duty location for this position will be determined at the time of selection.\r\n                                    \n"}, {"jobID": "716342300", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "MGMT And PROG ANAL", "companyName": "NaturalResourcesConservationService", "link": "https://www.usajobs.gov/job/716342300", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National.\nMales born after 12/31/1959 must be Selective Service registered or exempt.\nSubject to satisfactory adjudication of background investigation and/or fingerprint check.   If selected, you will be sent instructions on obtaining fingerprints. Please note we are not able to reimburse any fees incurred for fingerprints.\nSuccessful completion of one-year probationary period, unless previously served.\nDirect Deposit ? Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution.\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit E-Verify at https://www.e-verify.gov/.\nMust possess and maintain a valid state motor vehicle operator's license for the type of vehicle(s) operated to perform the duties of this position.\n\n\n Qualifications\n\r\n                                        Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement including time-in-grade restrictions, specialized experience and/or education, as defined below.\n\nTime in grade: Current federal employees applying for a promotion opportunity must meet time-in-grade (TIG) requirement of 52 weeks for service at the next lower grade level in the normal line of progression for the position being filled.\n\nSpecialized Experience: To qualify for the GS-12 level, applicants must possess at least one (1) year of specialized experience equivalent to at least the GS-11 grade level; or its non-Federal equivalent that demonstrates:\n\nApplying qualitative and quantitative methods and techniques to design and conduct studies to assess and improve program operations and procedures; analyzing and measuring program effectiveness and productivity; and applying knowledge of administrative operations to evaluate program activities for optimum utilization of software.\n\n\nSpecialized Experience: To qualify for the GS-13 level, applicants must possess at least one (1) year of specialized experience equivalent to at least the GS-12 grade level; or its non-Federal equivalent that demonstrates:\n\n\nApplying qualitative and quantitative methods and techniques to design and conduct studies assessing a programs financial operation, performance and effectiveness of activities; applying knowledge of business regulations to evaluate software/software defects/software inefficiencies and impact upon agency programs and resources; providing briefings or conveying information about complex or sensitive program issues to varying audiences; and evaluating software in relation to its ability to implement policies, procedures, and operations are in compliance with administrative systems, legislation, regulations and program goals and objectives.\n\nNOTE: To be considered for this position, you must meet all qualification and eligibility requirements for the series set forth in the Office of Personnel Management (OPM) Qualification Standards by the closing date of the announcement. A copy is available at: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards .\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\n\nCareer Transition Assistance Plan (CTAP) or Reemployment Priority List (RPL): Visit the OPM website for information on how to apply as a CTAP or RPL eligible. To exercise selection priority for this vacancy, CTAP/RPL candidates must meet the basic eligibility requirements and all selective factors. CTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP applicants must receive a rating of at least 85 out of a possible 100.\nPromotion Potential: If you are selected for a position with further promotion potential, you will be placed under a career development plan, and may be non-competitively promoted if you successfully complete the requirements and if recommended by management. However, promotion is neither implied nor guaranteed.\nPLEASE NOTE: In the interest of filling these positions as efficiently as possible, we are requiring the following:\n\t\nIf called for an interview, applicants must be available to interview within 3 business days of being contacted.\nIf a tentative job offer is extended, selectee will have 2 business days in which to accept or decline.\n\n\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nParticipates in planning sessions and discussions of innovative ways to carry out assigned objectives and new objectives\nAnalyzes and evaluates interrelated issues (i.e. software defects) for effectiveness, efficiency, and productivity\nAdministers studies include long-range rapidly changing program goals and objectives that may change the type or service level provided to customers.\nMonitors activities identified for special interest to keep leadership informed of developments.\n\n"}, {"jobID": "716496900", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "ELECTRONIC INTEGRATED SYSTEMS MECHANIC T32", "companyName": "AirNationalGuardUnits", "link": "https://www.usajobs.gov/job/716496900", "jobLocation": {"remote": "not specified", "city": "Tucson", "state": "AZ", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 3802, "max": 4434}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nARIZONA AIR NATIONAL GUARD MEMBERSHIP IS REQUIRED. Prior to appointment into this position,  selectee must be a current member of the Arizona Air National Guard, in a military position assigned to 162d WG.\nThis is an excepted service position that requires membership in a compatible military assignment in the employing state's National Guard, required prior to the effective date of placement.\nSelectee will be required to wear the military uniform.\nAcceptance of an excepted service position constitutes concurrence with these requirements as a condition of employment.\nApplicants who are not currently a member of the National Guard must be eligible for immediate membership and employment in the National Guard in the military grade listed in this announcement.\nMales born after 31 December 1959 must be registered for Selective Service.\nFederal employment suitability as determined by a background investigation.\nMay be required to successfully complete a probationary period.\nParticipation in direct deposit is mandatory.\nIncumbent must possess and maintain a current state driver?s license.\nMay occasionally be required to work other than normal duty hours.\n\n\n Qualifications\n\nMilitary Grades: AB/E1 - SSgt/E5\n\nCompatible Military Assignments: Possess the AFSC of 2A071\nGENERAL EXPERIENCE: An applicant must have a validated understanding of the basic principles and concepts of the occupational series and grade.\n\nSPECIALIZED EXPERIENCE: Must have at least 24 months experience involved duties such as, inspecting, testing, troubleshooting, repairing and modifying software controlled automated and manually controlled test stations, electronic circuit maintenance pods, peripherals, support equipment and associated subsystems. Knowledgeable of stations that are used to repair and maintain all avionics line-replaceable and pods. Skilled in analyzing performance results, running tests, inspecting, troubleshooting, identifying and isolating malfunctions. Experienced in how to disassemble, modify or repair and reassemble test stations or electronic circuit maintenance pods and their associated peripherals. Skills include the ability to consider the complex inter-related variables arising from a mix of computer hardware and software, stimulus and measurement systems, and special purpose test subsystems. Experienced in analyzing malfunctions using schematics, logic and wiring diagrams, programming tables, computer program flow charts, software user guides, computer program listings and factory drawings. Skilled in the diagnoses of circuit operating characteristics using computer query, system peculiar test equipment, and computer diagnostics. Experiences involved isolating problems to the failing part using self-test diagnostics, oscilloscopes, frequency meters, signal generators, digital, and differential voltmeters, computer registers and printouts and other special and standard tools and test equipment. Skilled in removing and replacing components, assemblies, subassemblies, or parts using special and common hand tools, soldering devices and special electronic instruments. Experiences involved modifying and updating avionics pods, support equipment, and support software according to applicable technical publications. Skilled in analyzing program data to determine if the criteria is sufficient to provide adequate testing and troubleshooting. Experienced in the examination of recurring malfunctions and software deficiencies to determine testing voids and initiated corrective action by submission of quality deficiency reports, software deficiency reports or proposed modifications. Skilled in devising repair procedures based on findings and recommending program changes, procedural changes, or data corrections to correct software deficiencies. Experiences included connecting associated testing equipment to interface the test station system to the aircraft system and pod to facilitate maintenance/repair of the pod or line replaceable units from the avionics systems such as, radar, fire control, instrument, flight control, inertial navigation, malfunction analysis and recording equipment systems. Skilled in determining if failures were caused by the unit under test, the pod, the test station, or the test program. Skilled in identifying malfunctions in the unit under test, pod or the test station and isolating it to the specific component(s). Experienced in repairing and replacing solid state devices, micro miniature modules, gyros, sensors, transducers, and any other required parts, and reassembling and performing operational tests. Experiences included working with engineers and technicians in the development and/or modification of software, interfaces, extender equipment or additional items of test equipment and in validation of technical data concerning the repair, maintenance, and test of the test station and units under test. Skilled in initiating technical data changes. Skilled in providing hands-on training instructions to lower-grade personnel concerned with repair of computer controlled automatic test equipment, manually controlled test equipment, line replaceable units and aircraft integrated systems. Experiences included the preparation and participation in various types of readiness evaluations such as, Operational Readiness Inspections, Inspector General Inspections, and Unit Effectiveness Inspections and mobility and command support exercises. May have general knowledge in structural fire-fighting, aircraft fire, aircraft crash and rescue duty, security guard, snow removal, munitions loading and handling, heavy equipment operator, maintenance of facilities and equipment. Skilled in the compliance requirements concerning safety, fire, security, and housekeeping regulations. Experienced in the procedures involved with the proper storage, protection, and maintenance of all work-related material and equipment.\n\n\n\nEducation\n\nYou must provide transcripts or other documentation to support your Educational claims. To receive credit for Education, you must provide documentation of proof that you meet the Education requirements for this position.\n\n\n\nAdditional information\n\nIf you are a male applicant who was born after 12/31/1959 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency (https://www.sss.gov/RegVer/wfRegistration.aspx).\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        This position is located at the 162d WG in Tucson, Arizona. This is an Air National Guard (ANG) Dual Status Technician position requiring military membership, compatible military skill assignment, and classification. Its purpose is to inspect, test, troubleshoot, repair and modify software controlled automated and manually controlled test stations, ECM Pods, peripherals, support equipment and associated subsystems. The stations are used to repair and maintain all avionics line-replaceable units (LRUs) and Pods.\n\nTHIS IS A NATIONAL GUARD TITLE 32 EXCEPTED SERVICE POSITION.\r\n                                    \n"}, {"jobID": "715448900", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "OFFICE CLERK", "companyName": "AirCombatCommand", "link": "https://www.usajobs.gov/job/715448900", "jobLocation": {"remote": "not specified", "city": "OffuttAFB", "state": "NE", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 33988, "max": 44184}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nFull/part-time employees occupying direct childcare positions are eligible for discounts IAW DAF AFSVC/CC Memo, 30 Sep 22; first child 100% / each additional child 25%. Other assigned CYP and FCC personnel are eligible for 25% discount.\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nMust successfully complete an SF-85 background investigation.\nPCS expenses are not authorized. Travel and Relocation expenses will not be paid.\nThis position is subject to provisions of the DoD Priority Placement Program\nMust have a certification or complete requirements for CPR and First Aid certification, and Food Handler's certificate.\nMay be required to work uncommon tour of duty.\nPosition has \"regular contact with children.\" IAW Public Law 101-647 Section 231, and Public Law 102-190, Section 1094, an FBI fingerprint and State Criminal History Repository (SCHR) Check will be completed on any person selected for this position.\nDisclosure of Political Appointments\nMust satisfactorily complete a physical examination upon hire and every three years thereafter; and, keep current on all immunizations.\nAll federal employees are required to have direct deposit.\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the general experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions.\n\nGENERAL EXPERIENCE: Applicants must have at least one (1) year of general experience. Examples of general experience include progressively responsible clerical, office, or other work that indicates the ability to acquire the particular knowledge and skills needed to perform the duties of the position to be filled, such as knowledge of various office automation software processing procedures, preparing various routine correspondence/reports, maintaining files/records, and reviewing and processing mail.\n\nOR\nEDUCATION: Two (2) years above high school, obtained in an accredited business, secretarial or technical school, junior college or university. One year of full-time academic study is defined as 30 semester hours, 45 quarter hours, or the equivalent in a college or university, or at least 20 hours of classroom instruction per week for approximately 36 weeks in a business, secretarial, or technical school. NOTE: You must submit a copy of your transcripts.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: Equivalent combinations of successfully completed post-high school education and experience may be used to meet total experience requirements. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\nKnowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents, such as letters, reports, spreadsheets, databases, and graphs.\nKnowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\nKnowledge of rules, procedures, or operations applied to clerical assignment to perform the routine, procedural work of the office, such as preparing and editing documents, maintaining files/records, making and preparing travel arrangements, screening telephone calls and visitors, and processing mail.\nKnowledge of filing systems and procedures and the subject matter content of the materials being processed.\nAbility to locate, assemble, and compose routine, nontechnical information for recurring reports and inquiries.\nAbility to communicate effectively, both orally and in writing, using tact and courtesy and ability to plan, organize work, and meet deadlines.\n\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11903443.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nUse varied functions of multiple office automation software to produce a wide range of documents, formats, etc.\nPrepares a wide variety of recurring correspondence, internal reports, and other documents from information obtained from the staff, files, and other sources, and reviews and finalizes documents prepared by other.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives.\nReceives and direct telephone calls or visitors.\nEstablishes, updates, and maintains office records of various types that may be needed or will assist in the efficient operation of the office.\n\n\n"}]