[{"jobID": "715670900", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "IT Specialist", "companyName": "NationalTelecommunicationsandInformationAdministration", "link": "https://www.usajobs.gov/job/715670900", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": "CO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. citizen to apply for this position.\nYou must successfully pass a background investigation. This may include a credit check, a review of financial issues, as well as certain criminal offenses and illegal use of possession of drugs.\nA probationary period may be required.\nSelective Service: Males born after 12/31/59 must be registered or exempt from Selective Service (see https://www.sss.gov/).\nIf you receive a conditional offer of employment for this position, you will be required to complete an Optional Form 306, Declaration for Federal Employment, and to sign and certify the accuracy of all information in your application.\nAll Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choosing.\nDrug Test Required: NO\nLicense required: NO\nPre-employment physical required: NO\nBargaining Unit Position: NO\nConfidential Financial Disclosure Report (OGE form 450): NO\nPermanent Change of Duty Station (PCS) Expense: NOT to be paid\n\n\n\n Qualifications\n\nQualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards. This handbook is available on the Office of Personnel Management's website located at: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/\nApplicants must possess one year of specialized experience equivalent in difficulty and responsibility to the next lower grade level in the Federal Service. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills and abilities to successfully perform the duties of the position. This experience need not have been in the federal government.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations e.g., professional; philanthropic, religious; spiritual; community, student, social). Volunteer work helps build critical competencies; knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTo qualify at the GS-13 Level-\n\nSPECIALIZED EXPERIENCE: You must possess one full year (52 weeks) of specialized experience equivalent to the GS-12 in the Federal service.\n\n- Utilize project management software tools to ensure projects are kept on schedule and within budget.\n- Advise in the development and implementation of automated spectrum management tools, products, and capabilities.\n- Establishing an effective working relationship with operating units, departmental entities, stakeholders, and others associated with the design, implementation, operation, and maintenance of IT systems.\n- Assisting in the development of acquisition documentation such as Performance Work Statements (PWS) and Statements of Work (SOWs) for the acquisition of IT systems, equipment, and services.\n\nTo qualify at the GS-14 Level-\n\nSPECIALIZED EXPERIENCE: You must possess one full year (52 weeks) of specialized experience equivalent to the GS-13 in the Federal service. Specialized experience is defined as:\n\n- Providing electromagnetic spectrum-related technical input to IT software projects and acquisitions.\n- Directing IT projects to ensure established milestones and budget goals.\n- Developing Spectrum Information System testing strategies, plans, or scenarios.\n- Providing presentations or briefings on all aspects of a project and understand the organizational mission and corporate direction.\n\n\n\nEducation\n\r\n                                            There is no positive education requirement for this position.\n\n\n\nAdditional information\n\nThe following links provide information on various hiring authorities that do not fall under competitive examining procedures; however, they may enable you to apply through merit assignment procedures, or be eligible for a non-competitive appointment.\n\nVeterans Recruitment Act (VRA)\nVeterans Employment Opportunities Act (VEOA)\n30% or more disabled veterans\nPersons with disabilities\nCareer Transition Assistance Plan (CTAP)\nInteragency Career Transition Assistance Plan (ICTAP)\n\nICTAP and CTAP Eligibles: CTAP and ICTAP candidates will be eligible if it is determined that they have exceeded the minimum qualifications for the position by attaining at least a rating of 85 out of 100. Information about ICTAP eligibility is on the Office of Personnel Management's Career Transition Resources website at: Employee Guide to Career Transition\n\nCTAP applicants MUST submit the following documents:\n\nA copy of your specific RIF notice; notice of proposed removal for failure to relocate; a Certificate of Expected Separation (CES); or certification that you are in a surplus organization or occupation (this could be a position abolishment letter, a notice eligibility for discontinued service retirement, or similar notice).\nA copy of your SF-50 \"Notification of Personnel Action\", noting current position, grade level, and duty location;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nICTAP applicants MUST submit the following documents:\n\nA copy of your RIF separation notice; notice of proposed removal for failure to relocate; notice of disability annuity termination; certification from your former agency that it cannot place you after your recovery from a compensable injury; or certification from the National Guard Bureau or Military Department that you are eligible for disability retirement;\nA copy of your SF-50 \"Notification of Personnel Action\" documenting your RIF separation, noting your positions, grade level, and duty location, and/or Agency certification of inability to place you through RPL, etc;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nCurrent or Former Political Appointees: The Office of Personnel Management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule C, Non-career SES, or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As an IT Specialist, you will perform the following duties:\n\nOverseeing these systems engineering tasks and software development conducted by contractors and other parties engaged by the SNSS program office. (This position does not include hands-on software development.)\nConducting research and tasks related to development, operations and evolution of radio frequency management software systems, data standards, and corresponding radio frequency management policy, regulation and business processes.\nEstablishing and executing processes for software development, testing, deployment, operations, security, risk management, quality management, configuration management, change management, and ensure compliance with established processes.\nConducting program management including cost, schedule, scope, risk, quality, and communication management. Monitor tasks, and track and evaluate contract deliverables. Support development of acquisition package deliverables and acquisition activities needed for NTIA to meet spectrum IT system objectives.\nCollaborating with and providing expert technical and program management advice to stakeholders in NTIA, the Department of Commerce, and external U.S. government agencies to achieve NTIA objectives.\nOverseeing agile systems development activities, and conducting systems engineering tasks including requirements definition and elaboration, design, test, deployment, and operations.\nGuiding development and execution of NTIA Spectrum IT Systems projects.\n\n\nThis position is also advertised under NTIA-OSM-ST-23-11873073, which is open to Merit Promotion eligible applicants. You must apply to both announcements if you want to be considered for both.\r\n                                    \n"}, {"jobID": "653673000", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (APPSW)", "companyName": "BureauofNavalPersonnel", "link": "https://www.usajobs.gov/job/653673000", "jobLocation": {"remote": "not specified", "city": "Annapolis", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 78592, "max": 122459}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position is designated as a Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area 62  within 12 months of appointment.\nYou may be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\nFor the GS-12 position:  Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Planning and executing complex IT-related assignments using conventional approaches and techniques; 2) Developing, testing, documenting and maintaining solutions, integrations, and data migration using Salesforce resources such as triggers, workflows, validations, approvals, APEX Classes, Visualforce pages, and Lightning Web Components; 3) Translating functional and technical requirements into database designs and application prototypes; 4) Validating and testing application software development quality, logic and functionality by following coding standards and participating in coding reviews; 5) Ensuring compliance with software development, information security/information assurance standards, policies, principles and practices.\nYou must ALSO have IT-related experience demonstrating the following four competencies:  1. ATTENTION TO DETAIL - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Ensures the software complies with regulatory requirements; CUSTOMER SERVICE - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services IT-related experience demonstrating this competency include: Works with customer/end users to support and develop software applications; ORAL COMMUNICATION -Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Presents trainings on new software applications; PROBLEM SOLVING - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Resolves software applications issues.\n\nFor the GS-11 position:  Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Assisting with planning and executing IT-related assignments using conventional approaches and techniques; 2) Translating functional and technical requirements into database designs and application prototypes within the Salesforce platform; 3) Validating and testing application software development quality, logic and functionality by following coding standards and participating in coding reviews; 4) Ensuring compliance with software development, information security/information assurance standards, policies and practices; 5) Working with customers/end users to support, develop, test and troubleshoot applications.\nYou must ALSO have IT-related experience demonstrating the following four competencies: 1. ATTENTION TO DETAIL - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Ensures the software complies with regulatory requirements; CUSTOMER SERVICE - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services IT-related experience demonstrating this competency include: Works with customer/end users to support and develop software applications; ORAL COMMUNICATION -Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Presents trainings on new software applications; PROBLEM SOLVING - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Resolves software applications issues.\n\nFor the GS-11 grade level: You may also qualify based upon the education stated in the Education Section of this announcement.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\n\nFor the GS-11 grade level: Applicants may qualify with the following education in lieu of the specialized experience qualification:\n\nSuccessfully completed a Ph.D. or equivalent doctoral degree.\n\nOR\n\nSuccessfully completed three full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree.\r\n                                        \n\n\nAdditional information\n\nThis announcement uses the Certain Personnel of the DoD/Modified direct hire authority to recruit and appoint qualified candidates to positions in the competitive service.\n\nCertain incentives (such as Recruitment, Relocation or Student Loan Repayment) may be authorized to eligible selectees.\n\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.\n\nVacancies filled from this announcement may be filled at any grade level listed.\n\nIf selected below the full performance level, you may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. Promotion is neither implied nor guaranteed.\n\nA forty-hour work week is typical of this position.\n\nThis position is eligible for part time, substantial or ad-hoc telework at the discretion of management.\n\nThis position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.\n\nPHYSICAL DEMANDS\nThe work is sedentary. No special demands are required to perform the work. Vision must be adequate to permit prolonged work with LCD monitors.\n\nWORK ENVIRONMENT\nThe work is performed in a typical office setting with the incumbent observing normal safety precautions. Travel may be required within or outside the local region.\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will work in all phases of the software development life cycle, including functional analysis, development of technical requirements, prototyping, coding, testing, deployment, and support.\nYou will develop high quality, reusable and maintainable code using Apex, Lightning Web Components, Visualforce, Javascript, and SOQL on the Salesforce Platform using Object-Oriented concepts.\nYou will play a key role designing the underlying Salesforce architecture including configuration, testing, and deployment of Salesforce functionality.\nYou will implement Salesforce configuration changes, including: Flow, Process Builder, objects, fields, page layouts, record types, custom settings, dashboards, profiles, permission sets, sharing rules, and validations.\n\n"}, {"jobID": "716234300", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "Information Technology (Network Services/System Administration)", "companyName": "U.S.ArmyMilitarySurfaceDeploymentandDistributionCommand", "link": "https://www.usajobs.gov/job/716234300", "jobLocation": {"remote": "not specified", "city": "Concord", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 85508, "max": 111157}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be able to obtain and maintain a SECRET Security Clearance.\nMust obtain and maintain all DoD IA training and certification requirements, see \"Additional Information\".\nThis position is DESIGNATED AS KEY, see \"Additional Information\".\nThis position requires the incumbent to hold IA Management Level I certification under DoD Directive 8570.1 (IA Training and Workforce Management) and related implementing policies.\nThe Personnel Security Standard of this position is IT Level II under Army Regulation 25-2 (Information Assurance).\nThis position is eligible for certification in accordance with DoD 8570-01-M, 12/19/05.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet BOTH the Basic Requirement and the Specialized Experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nBasic Requirement: In addition to the specialized experience listed below, your resume must indicate IT-related experience demonstrating the four competencies listed below: 1) Attention to Detail-develop organizational policy and procedures for implementation of guidance. 2) Customer Service-resolve problems with application programs. 3) Oral Communication-prepare and present reports and recommendations concerning IT related systems issues. 4) Problem Solving-evaluate the impact of new technologies on current systems and policies.\n\nSpecialized Experience: To qualify based on your experience, your resume must describe at least one year of experience which prepared you to do the work in this job. Specialized Experience is defined as: assisting in the maintenance and troubleshooting on a variety of computer systems. Using diagnostic and utility software packages to analyze and perform computer and server maintenance. Assisting in the installation of various types of network server systems. Providing guidance and/or training to customers to prevent operating system issues. Troubleshooting software/hardware malfunctions to resolve network system issues.\nOR\nEducation Experience: Possess a Ph.D. or equivalent doctoral degree or 3 full years of progressively higher-level graduate education leading to a Ph.D. or equivalent doctoral degree from a nationally accredited university that demonstrates the knowledge, skills, and abilities necessary to do the work of the position. (Note: You must attach a copy of your transcripts.)\nOR\nCombination of Education and Experience: Successfully completed education and specialized experience described above may be used to meet the total qualification requirements at the GS-11 level. (Note: You must attach a copy of your transcripts.)\r\n                                    \n\n\nEducation\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 34 - Information Technology/Cyber Management position.\nSalary includes applicable locality pay or Local Market Supplement.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\nKey Position: This position is designated as Key. In the event of a crisis situation, the incumbent, or designated alternate, must continue to perform the Key duties until relieved by proper authority. The incumbent, or the designated alternate, may be required to take part in readiness exercises. This position cannot be vacated during a national emergency or mobilization without seriously impairing the capability of the organization to function effectively, therefore, the position is designated \"Key\", which requires the incumbent, or designated alternate, to be screened from military recall status.\nDoD IA Training & Certification Requirements: As part of the IA workforce, incumbent must obtain and maintain all DoD IA training and certification requirements according to DoD 8570.01-M and the certification provider. Within 6 months of assignment of IA duties, all IAT personnel must achieve the appropriate IA certification unless a waiver is granted per DoD8570.01-M. Certification holders must ensure their certifications stay active; expired certifications must be renewed.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nIdentify, report and resolve a variety of IT issues and problems; provide information and assistance to customers; execute established methods and procedures; and ensure the application of appropriate security measures.\nInstall, configure, maintain, and modify hardware used in operating networks, which consists of Routers, VPN devices, Firewalls, Network Switches, and PCs.\nExecute technical solutions in data communication or system management requirements.\nPerform established schedules and procedures to ensure optimum performance and availability of the system.\nDesign and install of Networks and components, i.e., servers, workstations, media, topologies and connectivity devices.\nConfigure and install new enterprise system hardware/software and associated equipment.\nConduct testing to insure operability, efficiency, and compliance with existing standards.\nMonitor operation of enterprise systems/domain(s) and ensures that hardware and software are functioning properly.\nResponsible for protection measures such as file access controls, software and physical safeguards, and personnel and visitor control at central and remote sites.\n\n"}, {"jobID": "711179900", "origin_search": "https://www.usajobs.gov/", "posted": "03/07/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (SYSTEMS ADMINISTRATION) (TITLE 5)", "companyName": "ArmyNationalGuardUnits", "link": "https://www.usajobs.gov/job/711179900", "jobLocation": {"remote": "not specified", "city": "JeffersonCity", "state": "MO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 69996, "max": 90992}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nCreditable Service for Annual Leave accrual may be granted to new employees if he/she possesses superior qualifications essential to the position; and which were acquired through performance in a non-federal or active duty uniformed service position.\nThe duties performed in a non-federal or active duty uniformed service position must directly relate to the position to which appointed and such qualifications are necessary to achieve an important agency mission or performance goal to be eligible.\nAdvanced in hire rate may be granted to set pay above the minimum rate of the grade for a new employee if he/she possesses superior qualifications relevant to the positions' requirements and is essential to accomplish the agency's mission.\nManagement has the right to convert this position to permanent status without re-advertising.\nEmployment can be terminated with a 30 day notice.\nIn the event a permanent (Tenure 1 or 2) employee is selected, and is willing to accept the indefinite appointment, that employee will relinquish permanent status.\nUnited States Citizenship is required.\nFederal employment suitability as determined by a background investigation.\nMales born after 31 December 1959 must be registered for Selective Service.\nParticipation in direct deposit is mandatory.\nAppointments of retired members of the Armed Forces as National Guard employees within 180 days of retirement requires a waiver approved by the Adjutant General of Missouri before an effective date can be established.\nMust be able to obtain and maintain Security Plus Certification.\nMust be able to lift 50 pounds or more.\n\n\n Qualifications\n\nGS-11 SPECIALIZED EXPERIENCE: Must possess one year of specialized experience equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector with the ability to serve as a systems administrator with responsibilities to install and test the system security configuration and monitor, operate, troubleshoot and maintain server hardware and software. The specialized experience must demonstrates you possess thorough knowledge of a variety of operating systems on desktops and servers; system administration of various server platforms and virtual machine infrastructure to include Storage Area Network (SAN); project management techniques and tools sufficient to provide technical guidance on the implementation of emerging technologies; and principles and methods used in planning and managing the implementation, update and integration of information system components. The specialized experience must indicate your ability to troubleshoot problems and implement changes on multi-faceted and interdependent computer platforms; modify application code and devise software patches or workarounds; document problems and advise the responsible party on support issues; apply systems design techniques, program language and hardware capabilities to analyze requests for new and modified applications; apply storage management practices, assignment of resources and file management techniques; and use performance tuning tools and techniques that are used to optimize systems functionality in order to meet installation systems requirements. I also have IT related experience documented in my resume demonstrating each of the following competencies: (1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail.; AND (2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.; AND (3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.; AND (4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\n\nDOD Information Awareness Certification Requirements:\n\nThe employee must obtain and maintain at a minimum a Secret security clearance.\n\nIncumbent must possess or be able to obtain and maintain certifications per DoD Directive 8570.1-M, AR 25-2, and as detailed in the Information Assurance (IA) Training and Certification Best Business Practice (BBP). Failure to satisfactorily obtain and maintain required certifications in accordance with the listed publications are grounds for termination.\n\nSelectee is required to satisfactorily complete the appropriate training and obtain the required certification/recertification for this position as outlined in DoD Publication 8570.01-M, Information Assurance Workforce Improvement Program, dated 19 December 2005 (incorporating Change 1 dated 15 May 2008).\r\n                                    \n\n\nEducation\n\nSubstitution of Education at the GS-11 grade level: Must have successfully completed a Ph.D or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree in a field which demonstrates the knowledge, skills, and abilities necessary to perform the work of the position, such as computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\r\n                                        \n\n\nAdditional information\n\nIf you are a male applicant who was born after 12/31/1959 and are required to register under the Military Selective Service Act, the Defense Authorization Act of 1986 requires that you be registered or you are not eligible for appointment in this agency (https://www.sss.gov/RegVer/wfRegistration.aspx).\n\nVeterans' Preference: A copy of your DD Form 214 which must include character of service or a Statement of Service/Proof of Service which must include service dates and character of service. In addition, if claiming 10-point preference you must submit a VA Letter or a disability determination from a branch of the Armed Forces (or documentation of purple heart, if applicable) and a SF 15 (Application for 10-point veteran preference).\n\nVeterans Information: Veterans' preference must be validated by formal submissions including all necessary supporting documentation. You must provide acceptable documentation of your preference or appointment eligibility. Acceptable documentation may be:\n\n1. A copy of your DD-214, \"Certificate of Release or Discharge from Active Duty,\" which shows dates of service and discharge under honorable conditions.\n2. A \"certification\" that is a written document from the armed forces that certifies the service member is expected to be discharged or released from active duty service in the armed forces under honorable conditions not later than 120 days after the date the certification is signed.\n3. You may obtain a letter from the Department of Veterans Affairs reflecting your level of disability for preference eligibility by visiting a VA Regional Office, contacting a VA call center or online.\n\nNOTE: Prior to appointment, an agency will require the service member to provide a copy of the DD-214.\n\nIf claiming 10 point preference, you will need to submit a Standard Form, SF-15, \"Application for 10-point Veterans' Preference.\"\n\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nManages assigned servers and server resources.\nAnalyzes and defines requirements; analyze workload; and monitors capacity and performance.\nDiagnoses and resolves problems with servers and serve resources.\nDevelops backup and recovery procedures.\nInstalls, configures, and maintains servers and server resources in support of business processing requirements and ensures that servers are tested for stability.\nInstalls and upgrades operating systems and layered software packages, ensuring compatibility with the installation?s standards prior to installation of upgrade or new release.\nDevelops and maintains database of hardware and software configurations.\nConducts hardware and software audits to ensure compliance with higher headquarters standards and maintains system configurations.\nMonitors and manages the performance, capacity, availability, serviceability, and recoverability of installed servers and associated server resources.\nResolves hardware/software interface and interoperability problems, and ensures server functionality, integrity, and efficiency.\nResolves inquiries and problems concerning access, use, and availability of datacenter technologies.\nProvides technical assistance to current and potential users to minimize disruptions of computer operations.\nProvides formal or informal training so users understand the relationships of the system and are able to work with the system without undue interruption.\nTests and analyzes system malfunctions to resolve physical and logical processing problems.\nAnalyzes, evaluates, and resolves malfunctions by adjusting equipment configurations, realigning port allocations, recommending appropriate acquisitions, and distinguishing between equipment, software, and operation problems.\nAssists in solving problems associated with deliveries in support of individual hardware or software orders.\nPerforms other duties as assigned.\n\n"}, {"jobID": "712617000", "origin_search": "https://www.usajobs.gov/", "posted": "03/13/2023", "jobTitle": "Physician - Section Chief Emergency Department", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/712617000", "jobLocation": {"remote": "not specified", "city": "Cincinnati", "state": "OH", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 280000, "max": 335000}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nU.S. Citizenship; non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959.\nMust be proficient in written and spoken English.\nYou may be required to serve a probationary period.\nSubject to background/security investigation.\nSelected applicants will be required to complete an online onboarding process.\nMust pass pre-employment physical examination.\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP).\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, you must meet the basic requirements as well as any additional requirements (if applicable) listed in the job announcement. Applicants pending the completion of training or license requirements may be referred and tentatively selected but may not be hired until all requirements are met. Currently employed physician(s) in VA who met the requirements for appointment under the previous qualification standard at the time of their initial appointment are deemed to have met the basic requirements of the occupation.\n\nBasic Requirements:\n\nUnited States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\nDegree of doctor of medicine or an equivalent degree resulting from a course of education in medicine or osteopathic medicine. The degree must have been obtained from one of the schools approved by the Department of Veterans Affairs for the year in which the course of study was completed.\nCurrent, full and unrestricted license to practice medicine or surgery in a State, Territory, or Commonwealth of the United States, or in the District of Columbia.\nResidency Training: Physicians must have completed residency training, approved by the Secretary of Veterans Affairs in an accredited core specialty training program leading to eligibility for board certification. (NOTE: VA physicians involved in academic training programs may be required to be board certified for faculty status.) Approved residencies are: (1) Those approved by the Accreditation Council for Graduate Medical Education (ACGME), b) OR\n\t[(2) Those approved by the American Osteopathic Association (AOA),OR\n\t(3) Other residencies (non-US residency training programs followed by a minimum of five years of verified practice in the United States), which the local Medical Staff Executive Committee deems to have provided the applicant with appropriate professional training and believes has exposed the physician to an appropriate range of patient care experiences.\n\tResidents currently enrolled in ACGME/AOA accredited residency training programs and who would otherwise meet the basic requirements for appointment are eligible to be appointed as \"Physician Resident Providers\" (PRPs). PRPs must be fully licensed physicians (i.e., not a training license) and may only be appointed on an intermittent or fee-basis. PRPs are not considered independent practitioners and will not be privileged; rather, they are to have a \"scope of practice\" that allows them to perform certain restricted duties under supervision. Additionally, surgery residents in gap years may also be appointed as PRPs.\nProficiency in spoken and written English.\n\nAdditional Requirement:\n\nEmergency Medicine Residency trained and Board Eligible/Board Certified in Emergency Medicine \nAmerican Heart BLS/ACLS certification.\n\nPreferred Experience: \n\nGraduate of a 4-year residency training program in Emergency Medicine (or a 3-year program with one year of additional emergency medicine experience) and board certified/board eligible in Emergency Medicine.\nA broad background in emergency medicine, skill in performing clinical and procedural care including enacting ACLS, performing moderate sedation, and radiological and EKG interpretation Computer literacy\nSupervisory experience \nTwo years of Emergency Department practice experience.\n\nReference: VA Regulations, specifically VA Handbook 5005, Part II, Appendix G-2 Physician Qualification Standard. This can be found in the local Human Resources Office.\n\nPhysical Requirements: Per VA Directive and Handbook 5019 - a physical examination will be conducted based on the physical requirements of the position. A physical examination prior to placement is required. The work requires walking, standing, bending and carrying of light items like papers or books or repositioning patients. The work may require some light physical effort, but no special physical demands are required to perform the work. Travel between the VAMC and University sites will be necessary.\r\n                                    \n\n\nEducation\n\nDegree of Doctor of Medicine or an equivalent degree resulting from a course of education in allopathic medicine or osteopathic medicine. The degree must have been obtained from an institution whose accreditation was in place for the year in which the course of study was completed. Approved schools are:\n\nSchools of medicine accredited by the Liaison Committee on Medical Education (LCME) for the year in which the degree was granted, or\nSchools of osteopathic medicine approved by the Commission on Osteopathic College Accreditation of the American Osteopathic Association for the year in which the degree was granted.\nFor foreign medical graduates not covered in (1) or (2) above, facility officials must verify with the Educational Commission for Foreign Medical Graduates (ECFMG) that the applicant has met requirements for certification, and must obtain a copy of the ECFMG certificate, if claimed by the applicant. [If the applicant does not claim an ECFMG certificate, facility officials must still confirm that the medical school meets (or met) ECFMG eligibility requirements for the year the candidate graduated.] \n\nNOTE: The Under Secretary of Health or designee in the VHA Central Office may approve the appointment under authority of 38 U.S.C. § 7405 of a physician graduate of a school of medicine not covered above if the candidate is to be assigned to a research, academic, or administrative position with no patient care responsibilities. The appointment will be made only in exceptional circumstances where the candidate's credentials clearly demonstrate high professional attainment or expertise in the specialty area.\n\n\n\nAdditional information\n\nThis is an OPEN CONTINUOUS ANNOUNCEMENT and will remain open until October 2, 2023 OR until all open positions are filled. The initial cut-off date for referral of eligible applications will be March 19, 2023 and every two weeks qualified applicants will be referred to the hiring manager. Applications will remain on file for 7 months.\n\nIt is the policy of the VA to not deny employment to those that have faced financial hardships or periods of unemployment.\n\nThis position is in the Excepted Service and does not confer competitive status.\n\nVA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38, and are not covered by the Schedule A excepted appointment authority.\n\nVeterans and Transitioning Service Members: Please visit the VA for Vets site for career-search tools for Veterans seeking employment at VA, career development services for our existing Veterans, and coaching and reintegration support for military service members.\n\nFinancial Disclosure Report:Not required\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The VA has been named as one of the Top 5 Best Places to Work in the federal government.\n\nCincinnati is a family friendly, affordable, metropolitan city with great parks, fine arts, and food scene.\n\nWith both an urban energy and southern charm, the Cincinnati region has a vibrant and unique culture that flows from the Ohio River to the things to do, landmarks and events all around town. With rich cultural offerings, award-winning family adventures, an ever-expanding art scene, a foodie's paradise, and breweries galore, this is one picturesque river region with much to explore! With major league sports, big-city arts, fun festivals and award-winning attractions, it can be hard to decide what to do in our dynamic river region!\nhttps://www.frommers.com/destinations/cincinnati\n\nVA offers a comprehensive total rewards package. VHA Physician Total Rewards.\n\nRecruitment Incentive (Sign-on Bonus): Available for well qualified applicants.\nPermanent Change of Station (Relocation Assistance): Available to current VA employees\n\nPay: Competitive salary, annual performance bonus, regular salary increases\nPaid Time Off: 50-55 days of paid time off per year (26 days of annual leave, 13 days of sick leave, 11 paid Federal holidays per year and possible 5 day paid absence for CME)\nRetirement: Traditional federal pension (5 years vesting) and federal 401K with up to 5% in contributions by VA\nInsurance: Federal health/vision/dental/term life/long-term care (many federal insurance programs can be carried into retirement)\nLicensure: 1 full and unrestricted license from any US State or territory\nCME: Possible $1,000 per year reimbursement (must be full-time with board certification)\nMalpractice: Free liability protection with tail coverage provided\nContract: No Physician Employment Contract and no significant restriction on moonlighting\n\nSECTION CHIEF, EMERGENCY DEPARTMENT:\nThe Cincinnati VA Medical Center is an active teaching hospital affiliated with the University of Cincinnati College of Medicine. The Medical Center is a level 1b complexity hospital that offers a wide range of specialty and subspecialty services. There are opportunities for engaging in research and educational programs in affiliation with the University of Cincinnati. The 16-bed Emergency Department has approximately 24,000 patient visits/year and is 24/7, triple-covered during the day and single-covered at night. There is management of acute stroke in collaboration with the Cincinnati Stroke Team and acute coronary syndrome management in collaboration with the University of Cincinnati. The department does not see pediatrics, OB, or trauma.\n\nResponsibilities include but are not limited to:\n\nLeading the Emergency Department at the Cincinnati VAMC.\nDirecting patient care duties.\nParticipating in the facility Emergency Preparedness Response.\nProviding effective outpatient care while meeting and exceeding compliance standards.\nMaintaining current clinical privileges and keeping licensure, and all other appropriate documents up to date.\nMonitoring the quality performance including measures of wait time and patient flow delineated in EDIS (Emergency Department Integrated Software).\nPartnering with other clinical service chiefs.\nWill work with utilization review and the hospitalists to effect improvements in patient flow.\nResponsible for the EDIS compliance in the ED and reduction of wait times.\nEfforts to reduce the number of patients who leave the ED without being seen and improvements in discharge planning from the ED including the RAC initiative require ongoing oversight.\nMonitor ED efficiency, patient care, productivity, and quality measures.\nProvide ED representation on CEB, Peer Review, Emergency Management, and other committees for which the ED should have dedicated representation.\nSupport hiring, orientation, retention, appraisals, and disciplinary matters for the staff assigned to him/her.\nProvide team guidance in patient care in accordance with professional standards, core values and commitment to service excellence using the VA's Patient Aligned Care Team 'medical home' model.\nOther duties as assigned.\n\nThe Section Chief for the Cincinnati VAMC Emergency Department will report to the Chief of Primary Care\n\nWork Schedule: The ED Section Chief will divide time between administrative and clinical time at the Cincinnati VA Medical Center with expectations to work a combined minimum of a 40-hour week in the context of 24/7 Emergency Department coverage and as part of a collaborative team which includes physicians, physician assistants, and nurse practitioners. Shifts may include off tour (nights, weekends and holidays) along with weekday shifts.\r\n                                    \n"}, {"jobID": "714849300", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "IT Specialist (APPSW/CUSTSPT)", "companyName": "NationalOceanicandAtmosphericAdministration", "link": "https://www.usajobs.gov/job/714849300", "jobLocation": {"remote": "not specified", "city": "CollegePark", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nThis position requires a Public Trust (Moderate Risk) Security Clearance.\n\n* A one year probationary period may be required.\n* Payment of relocation expenses is not authorized.\n*This position is in the bargaining unit. This position is covered by (1538).\nApplicants must meet ALL application requirements, to include a complete online resume, by 11:59 p.m. EASTERN TIME (ET) on the closing date of this announcement.\nKey Requirements:\n\nApplicants must be U.S. Citizens.\nSuitable for Federal employment, as determined by background investigation.\nSelectee may be subject to serving a one-year probationary period.\nMore requirements are listed under Qualifications and Other Information.\nMust be registered for Selective Service, if applicable (www.sss.gov).\n\nAre There Any Special Requirements For This Position?\n\nIf selected you may be asked to provide information regarding your COVID-19 vaccination status for the purposes of implementing workplace safety protocols, such as those related to masking, physical distancing, testing, travel, and quarantine. \nA background investigation will be required for this position. Continued employment will be subject to the applicant's successful completion of a background security investigation and favorable adjudication. Failure to successfully meet these requirements will be grounds for termination.\nThroughout the recruitment and hiring process we will be communicating with you via email; therefore, it is imperative that the email address you provide when applying for this vacancy remains active. Should your email address change, please notify the point of contact identified in the vacancy announcement as soon as possible so that we can update our system. \nIf  you are a Federal employee applying for a promotion (under merit promotion procedures) you must meet time-in-grade requirements by the closing date of the announcement.\n\n\n\n Qualifications\n\r\n                                        Qualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards. This handbook is available on the Office of Personnel Management's website located at: https://www.opm.gov/policy.\n\nEDUCATION: There is no positive education requirement for this position.\n\nIT COMPETENCIES: For all positions, individuals must have IT-related experience (which may be obtained by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate) demonstrating each of the four competencies listed below:\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\n-AND-\n\nSPECIALIZED EXPERIENCE: Applicants must possess one year of specialized experience equivalent in difficulty and responsibility to the next lower grade level in the Federal Service. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills and abilities to successfully perform the duties of the position. This experience need not have been in the federal government.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations e.g., professional; philanthropic, religious; spiritual; community, student, social). Volunteer work helps build critical competencies; knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTo qualify at the GS-13 level:\nSPECIALIZED EXPERIENCE: In addition to meeting the IT Competencies above, applicants must also possess one full year (52 weeks) of specialized experience equivalent to the GS-12 in the Federal service. Specialized experience MUST include all of the following:\n\n\nDiagnosing and resolving customer's software, hardware, or other IT systems management issues;\nInstalling, maintaining, and configuring new or enhanced hardware and software applications; and\nProviding technical expertise in the implementation, testing, and modification of IT systems.\n\n\n\n\nEducation\n\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g. Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\nEducation completed in colleges or universities outside the United States may be used to meet the above requirements. You must provide acceptable documentation that the foreign education is comparable to that received in an accredited educational institution in the United States. For more information on how foreign education is evaluated, visit: OPM Foreign Education Evaluation\n\n\n\n\nAdditional information\n\nCTAP and ICTAP candidates will be eligible if it is determined that they have exceeded the minimum qualifications for the position by attaining at least a rating of 85 out of 100. Information about CTAP and ICTAP eligibility is on the Office of Personnel Management's Career Transition Resources website at: Employee Guide Career Transition\n\nCTAP applicants MUST submit the following documents:\n\nA copy of your specific RIF notice; notice of proposed removal for failure to relocate; a Certificate of Expected Separation (CES); or certification that you are in a surplus organization or occupation (this could be a position abolishment letter, a notice eligibility for discontinued service retirement, or similar notice).\nA copy of your SF-50 \"Notification of Personnel Action\", noting current position, grade level, and duty location;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nICTAP applicants MUST submit the following documents: \n\n\nA copy of your RIF separation notice; notice of proposed removal for failure to relocate; notice of disability annuity termination; certification from your former agency that it cannot place you after your recovery from a compensable injury; or certification from the National Guard Bureau or Military Department that you are eligible for disability retirement;\nA copy of your SF-50 \"Notification of Personnel Action\" documenting your RIF separation, noting your positions, grade level, and duty location, and/or Agency certification of inability to place you through RPL, etc;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nNon-Competitive Reinstatement to a Higher Grade/Band than Previously Held MUST submit the following documents:\n1. SF-50, \"Notification of Personnel Action: you must provide the most current Notification of Personnel Action (Form SF-50) that verifies career/career-conditional status, title, series, and highest grade level held on a permanent basis for your previous position. (do not submit an Award SF-50) AND, the SF-50 that verifies your separation date; AND.\n2. Performance Appraisal - most recent performance appraisal showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable. Do not submit a performance plan that does not include this information.\nNOAA participates in e-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees.\n\nThe Department of the Commerce (DOC) places a high value on diversity of experience and cultural perspectives and encourages applications from all interested eligible candidates. Diversity, equity, inclusion, and accessibility (DEIA) are fundamental principles that guide the Department and allow us to successfully achieve our mission.\n\nTHE FEDERAL GOVERNMENT IS AN EQUAL OPPORTUNITY EMPLOYER.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs an IT Specialist (APPSW/CUSTSPT), you will perform the following duties:\n\nDesign, plan, and schedule the installation of new or modified hardware and operating systems and application software, ensuring the integration of all systems components (e.g., procedures, databases, policies, software, and hardware).\nSupport subject matter users such as the National Weather Service (NWS) field offices, other National Centers for Environmental Prediction (NCEP) Centers and numerous private weather forecasting companies by developing or designing applications for computers and in selecting or assisting in selecting computer equipment.\nConsult with customers to identify and specify requirements, including responding to and resolving problems with software, hardware and systems management.\n\n\n"}, {"jobID": "714852900", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "IT Specialist (APPSW/CUSTSPT)", "companyName": "NationalOceanicandAtmosphericAdministration", "link": "https://www.usajobs.gov/job/714852900", "jobLocation": {"remote": "not specified", "city": "CollegePark", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\nThis position requires a Public Trust (Moderate Risk) Security Clearance.\n\n* A one year probationary period may be required.\n* Payment of relocation expenses is not authorized.\n*This position is in the bargaining unit. This position is covered by (1538).\nApplicants must meet ALL application requirements, to include a complete online resume, by 11:59 p.m. EASTERN TIME (ET) on the closing date of this announcement.\nKey Requirements:\n\nApplicants must be U.S. Citizens.\nSuitable for Federal employment, as determined by background investigation.\nSelectee may be subject to serving a one-year probationary period.\nMore requirements are listed under Qualifications and Other Information.\nMust be registered for Selective Service, if applicable (www.sss.gov).\n\nAre There Any Special Requirements For This Position?\n\nIf selected you may be asked to provide information regarding your COVID-19 vaccination status for the purposes of implementing workplace safety protocols, such as those related to masking, physical distancing, testing, travel, and quarantine.\nA background investigation will be required for this position. Continued employment will be subject to the applicant's successful completion of a background security investigation and favorable adjudication. Failure to successfully meet these requirements will be grounds for termination.\nThroughout the recruitment and hiring process we will be communicating with you via email; therefore, it is imperative that the email address you provide when applying for this vacancy remains active. Should your email address change, please notify the point of contact identified in the vacancy announcement as soon as possible so that we can update our system.\nIf you are a Federal employee applying for a promotion (under merit promotion procedures) you must meet time-in-grade requirements by the closing date of the announcement.\n\n\n\n Qualifications\n\nQualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards. This handbook is available on the Office of Personnel Management's website located at: https://www.opm.gov/policy.\n\nEDUCATION: There is no positive education requirement for this position.\n\nIT COMPETENCIES: For all positions, individuals must have IT-related experience (which may be obtained by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate) demonstrating each of the four competencies listed below:\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\n-AND-\n\nSPECIALIZED EXPERIENCE: Applicants must possess one year of specialized experience equivalent in difficulty and responsibility to the next lower grade level in the Federal Service. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills and abilities to successfully perform the duties of the position. This experience need not have been in the federal government.Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations e.g., professional; philanthropic, religious; spiritual; community, student, social). Volunteer work helps build critical competencies; knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTo qualify at the GS-13 level:\nSPECIALIZED EXPERIENCE: In addition to meeting the IT Competencies above, applicants must also possess one full year (52 weeks) of specialized experience equivalent to the GS-12 in the Federal service. Specialized experience MUST include all of the following:\n\n\nDiagnosing and resolving customer's software, hardware, or other IT systems management issues;\nInstalling, maintaining, and configuring new or enhanced hardware and software applications; and\nProviding technical expertise in the implementation, testing, and modification of IT systems.\n\n\n\n\nEducation\n\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g. Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\nEducation completed in colleges or universities outside the United States may be used to meet the above requirements. You must provide acceptable documentation that the foreign education is comparable to that received in an accredited educational institution in the United States. For more information on how foreign education is evaluated, visit: OPM Foreign Education Evaluation\n\n\n\n\nAdditional information\n\nWell-qualified for CTAP and ICTAP eligibility includes those candidates who have been determined to exceed minimum qualifications for the position by attaining at least a rating of 85, but otherwise may or may not be among the highly or best-qualified candidates. Information about CTAP and ICTAP eligibility is on the Office of Personnel Management's Career Transition Resources website at: http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-\ntransition/.\n\nCTAP applicants MUST submit the following documents:\n\nA copy of your specific RIF notice; notice of proposed removal for failure to relocate; a Certificate of Expected Separation (CES); or certification that you are in a surplus organization or occupation (this could be a position abolishment letter, a notice eligibility for discontinued service retirement, or similar notice).\nA copy of your SF-50 \"Notification of Personnel Action\", noting current position, grade level, and duty location;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\nICTAP applicants MUST submit the following documents:\n\n\nA copy of your RIF separation notice; notice of proposed removal for failure to relocate; notice of disability annuity termination; certification from your former agency that it cannot place you after your recovery from a compensable injury; or certification from the National Guard Bureau or Military Department that you are eligible for disability retirement;\nA copy of your SF-50 \"Notification of Personnel Action\" documenting your RIF separation, noting your positions, grade level, and duty location, and/or Agency certification of inability to place you through RPL, etc;\nA copy of your latest performance appraisal including your rating; and\nAny documentation from your agency that shows your current promotion potential.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs an IT Specialist (APPSW/CUSTSPT), you will perform the following duties:\n\nDesign, plan, and schedule the installation of new or modified hardware and operating systems and application software, ensuring the integration of all systems components (e.g., procedures, databases, policies, software, and hardware).\nSupport subject matter users such as the National Weather Service (NWS) field offices, other National Centers for Environmental Prediction (NCEP) Centers and numerous private weather forecasting companies by developing or designing applications for computers and in selecting or assisting in selecting computer equipment.\nConsult with customers to identify and specify requirements, including responding to and resolving problems with software, hardware and systems management.\n\n\n"}, {"jobID": "714592100", "origin_search": "https://www.usajobs.gov/", "posted": "03/22/2023", "jobTitle": "Health Technician (Dietetic)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/714592100", "jobLocation": {"remote": "not specified", "city": "Providence", "state": "RI", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 42404, "max": 55130}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/05/2023.\n\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-04 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: experience where you applied knowledge of quantity food service operations, proper nutrition, food items and appropriate quantities; working with clients, patients, and/or, customers to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; use computers, software applications, databases, and automated systems to accomplish work. NOTE: Experience must be fully documented on your resume and must include job title, duties, month and year start/end dates AND hours worked per week. OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have successfully completed a full four (4) year course of study leading to a bachelor's degree, with a major study or at least 24 semester hours in subjects directly related to this position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited business or technical school, junior college, college or university for which high school graduation or the equivalent is the normal prerequisite. NOTE: Transcripts (unofficial or official) must be submitted with your application materials. Education cannot be credited without documentation. OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an equivalent combination of successfully completed post-high school education (beyond the second year) and specialized experience, as listed above. The education portion must include courses directly related to the work of the position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited college or university. NOTE: Your experience must be documented in your resume and transcripts are required.\n\nYou will be rated on the following Competencies for this position:\n\nComputer SkillsCustomer Service (Clerical/Technical)Food ServicePatient Care\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: The work requires walking, standing, bending, lifting and carrying of light items, such as food trays, instruction materials, books, and manuals. NCC Associate functions require long periods of sitting and moving about in an office environment, including repetitive motion activities of the hands and fingers for extensive keyboard and computer mouse use, and office tasks such as answering and holding a telephone phone, and writing.\nThe work may require walking indoors, outdoors or to and from other areas of the medical center. It may be necessary to lift and/or push equipment. Incumbent is subject to periods continuous standing, sitting, walking and frequent stooping, reaching, pushing, pulling, and bending. Frequently lifts or moves objects weighing up to 20 pounds.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.This job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The primary purpose of the position is to provide administrative and customer service support for the VA hospital food service program. The incumbent performs routine duties that require exceptional customer service, computer skills, proper phone etiquette, proficiency in special food service and therapeutic diet procedures, a broad knowledge of routine modified diets, combinations of diet modifications and knowledge of Commercial Off the Shelf (COTS).The duties include but are not limited to:\n\nProvides professional and courteous customer service;\nCommunicates with customers in a pleasant, friendly, personable, and professional manner via telephone and in-person;\nUtilizes dietetic software programs to retrieve diet orders, recipes, and menu and inventory data;\nPrints and assembles tray ticket packets in accordance with local facility policies and procedures;\nProperly operates telephone equipment to transfer or place calls on hold;\nTriages calls from inpatient units or outpatient clinics and procedure areas relating to patient meal trays or nourishments;\nProvides basic-level education and information on therapeutic diets to patients, guests, and nursing staff;\nResolves customer and/or patient complaints;\nUtilizes knowledge of basic and routine modified diets to identify problems in diet order information and take appropriate corrective action;\nCorrectly interprets diet activity and patient information, to ensure appropriate food items on meals trays;\nVerifies physician orders for unusual diets, conflicting modifications, tube feeding orders and nutritional supplements;\nAssist with food selections, ensuring appropriateness of menu selections for complex diets;\nAnswers the telephone using proper business etiquette;\nAttends to both verbal and nonverbal aspects of communication.\n\nWork Schedule: Full-Time, Mon-Wed 10:30am-7pm, Sat-Sun 6:00am-2:30 pm with Thu/Fri Off\nCompressed/Flexible:  Not Available\nTelework: Not Available\nVirtual: This is not a virtual position.\nPosition Description/PD#: Health Technician (Dietetic)/PD99796S\nRelocation/Recruitment Incentives: Not Authorized\nFinancial Disclosure Report: Not required\n\nNotifications:\n\nThis position is covered by locality-based comparability pay.\nThis position is a LUINA Bargaining Unit position.\nCurrent Federal employees must submit copies of their most recent SF-50, (Notice of Personnel Action). The SF-50 must identify the position title, series, grade, step, tenure and type of service (Competitive or Excepted). In some cases, more than one SF-50 may be required to show a higher grade previously held.\nVeterans' preference does not apply for other current permanent Federal agency employees.\n\n\n"}, {"jobID": "716640000", "origin_search": "https://www.usajobs.gov/", "posted": "04/01/2023", "jobTitle": "Biomedical Equipment Support Specialist", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/716640000", "jobLocation": {"remote": "not specified", "city": "Dayton", "state": "OH", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 81911, "max": 106489}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. Citizen to apply for this job\nDesignated and/or random drug testing may be required\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to a background/security investigation\nMust be proficient in written and spoken English\nSelected applicants will be required to complete an online onboarding process\n\n\n Qualifications\n\r\n                                        Applicants pending the completion of educational or certification/licensure requirements may be referred and tentatively selected but may not be hired until all requirements are met.\n\nBasic Requirements:\n\nUnited States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\n\nExperience and Education. Associates degree in Biomedical Electronics Technology, Biomedical Equipment Technology or Biomedical Engineering Technology or in a related technical field such as Electronic Technology or Information Technology and two years of experience as a Biomedical Equipment Support Specialist, Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer, or Information Technology Specialist.\n\nOr, \n\nBachelor's degree in Biomedical Engineering Technology or in a related field such as Electronics Engineering Technology (EET) or Information Technology.\n\nOr, Completion of a military training program in biomedical equipment and two years of experience as a Biomedical Equipment Support Specialist or Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer or Information Technology Specialist.\n\nMay qualify based on being covered by the Grandfathering Provision as described in the VA Qualification Standard for this occupation (only applicable to current VHA employees who are in this occupation and meet the criteria).\n\nGrade Determinations:\n\n(1) Experience. At least one year of specialized experience equivalent to the GS-11 grade level.\n\nExamples of experience include but are not limited to: Responsible for the life-cycle management of diagnostic, therapeutic, and other patient related medical equipment and systems. Performs routine and complex tasks involved in the installation, maintenance, modification, troubleshooting and calibration of complex therapeutic, diagnostic and life support biomedical equipment; Responsible for monitoring system backups, file integrity, ensuring network connectivity between systems, servers, databases, and the electronic medical record; Must be able to reload operating systems and clinical application software in the event of a system failure and interface with Office of Information and Technology (OI&T) locally and at other sites to keep systems operational; and/or Conducts pre-purchase evaluations and addresses pre-implementation security issues to ensure that medical device isolation architecture (MDIA) requirements are met.\n\n(2) Demonstrated Knowledge, Skills, and Abilities (KSAs).\n\nIn addition to the experience above, the candidate must demonstrate all of the following KSAs:\n\n(a) Current knowledge of computer virus protection software, available software patches and upgrades, and information security tools.\n\n(b) Expert knowledge of electronics, computer and networking theory with experience maintaining, interfacing and troubleshooting networked medical equipment to include VLAN configuration, IP addressing, sub-netting, and network security.\n\n(c) Ability to utilize and maintain computer and server based medical equipment, medical record databases, and proprietary and generic software, Experience with TCP/IP, HL7, networking, network security, and DICOM standards.\n\n(d) Ability to interpret, identify, and apply network engineering principles and practices where there often times is no previous example to follow, or precedence.\n\n(e) Skill to distinguish networking problems from non-networking problems and discuss various options with IT networking and operations staff members.\n\nReferences: VA Handbook 5005, Part 2, Appendix G49, Biomedical Equipment Support Specialist\n\nThe full performance level of this vacancy is GS-12.\n\nPhysical Requirements: A significant portion of tasks performed will involve utilizing a computer workstation for extended periods of time configuring software and managing networked medical system. This will involve prolonged periods of sitting or standing while viewing digital displays. The position will also involve lifting and carrying items weighing up to 40lbs on an occasional basis. The work requires frequent standing, walking, bending, crouching, reaching, and stooping. Climbing and working on ladders may be required. Some work may require the use of magnifying lenses and or microscopes to accomplish repairs on miniature components. The majority of work will be performed in well lighted, heated, and ventilated areas.\r\n                                    \n\n\nEducation\n\nIMPORTANT: A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nIt is the policy of the VA to not deny employment to those that have faced financial hardships or periods of unemployment.\n\nThis position is in the Excepted Service and does not confer competitive status.\n\nVA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38, and are not covered by the Schedule A excepted appointment authority.\n\nVeterans and Transitioning Service Members: Please visit the VA for Vets site for career-search tools for Veterans seeking employment at VA, career development services for our existing Veterans, and coaching and reintegration support for military service members.\n\nIf you are unable to apply online view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Duties include but are not limited to:\n\nLifecycle management of network equipment including but not limited to network switches, servers, routers and related infrastructure for any and all networked complex medical devices and systems such as imaging, life support, dialysis, and monitoring.\n\nCompletes both routine and complex assignments involved identifying and troubleshooting issues related to VLAN configuration, IP addressing, sub-netting, HL7, DICOM, Access Control List (ACL) and network security across the medical device network.\n\nCoordinates and works effectively with other facility support departments including but not limited to Facilities Management Service (FMS), Office of Information Technology (OIT), Sterile Processing Service (SPS), and Environmental Management Service (EMS).\n\nUtilizes advanced network test equipment and software including but not limited to tracers, wireless spectrum analyzers, network traffic monitors, command prompt, physical and virtual server software.\n\nManages, troubleshoots and maintains complete systems of computerized networks, databases and servers including but not limited to biomedical information systems that store or facilitate patient information.\n\nThese biomedical information systems include but are not limited to Picture Archiving Communication Systems (PACS), physiological monitoring systems, Clinical Information Systems (CIS), Anesthesia Record Keeping (ARK), and other systems for which Medical Device Isolation Architecture (MDIA) would apply.\n\nImplements and plans for new and emerging technologies including but not limited to diagnostic modalities, network management and storage, and virtual data centers.\n\nDesigns, implements and manages network incident response due to infection, loss of service or regional and local policy changes according to VA guidelines.\n\nEnsures proper security configuration for assigned devices and networks.\n\nRegularly reviews and installs available approved software updates and virus definitions for applicable networked medical devices.\n\nLeads development of disaster recovery procedures for critical systems to be enacted in the event of device failure.\n\nAdheres to MDIA Guidelines in both pre- procurement and during system implementation.\n\nLoads operating system (OS) and clinical application software as needed. \n\nAs assigned, employee is responsible for lifecycle management of any and all medical devices and systems such as imaging, life support, dialysis, and monitoring to include physical and network support.\n\nCompletes both routine and complex assignments involved in the installation, maintenance, modification, troubleshooting, repair and calibration of these complex therapeutic, diagnostic and life support medical devices and systems.\n\nSpecific tasks include but are not limited to incoming inspections, regular and unscheduled maintenance, and planning for end of life replacement in conjunction with clinical services.\n\nUtilizes common test equipment including, but not limited to, electrical safety analyzers, oscilloscopes, patient simulators, pulse generators, network analyzers, and multimeters.\n\nWork Schedule: Monday-Friday 8:00am to 4:30pm\nCompressed/Flexible Schedule: Available\nTelework: Available\nVirtual: This is not a virtual position.\nPosition Title/Functional Statement #:Biomedical Equipment Support Specialist/PD000000\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "715118500", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "ITSPEC", "companyName": "ForeignAgriculturalService", "link": "https://www.usajobs.gov/job/715118500", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 122459}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National.\nMales born after 12/31/1959 must be Selective Service registered or exempt.\nSubject to satisfactory adjudication of background investigation and/or fingerprint check.\nSuccessful completion of one-year probationary period, unless previously served.\nDirect Deposit: Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution.\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit E-Verify at https://www.e-verify.gov/\n\n\n Qualifications\n\r\n                                        Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement, including specialized experience and/or education, as defined below.\n\nBASIC REQUIREMENT: For all positions individuals must have IT-related experience demonstrating each of the four competencies listed below:\n\nAttention to Detail\nCustomer Service\nOral Communication\nProblem Solving\n\nFOR THE GS-12 LEVEL: Applicants must have one year of specialized experience (equivalent to the GS-11 grade level) that demonstrates: coordinating customer support activities sufficient to receive, respond to, and ensure complete resolution of complex issues beyond what a help desk can resolve; providing comprehensive software, IT systems, or equipment guidance and/or training to enhance customer knowledge, as well as plans and procures IT goods and services.\n\nNote: There is no education substitution for this grade level.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\n\nCareer Transition Assistance Plan (CTAP), Reemployment Priority List (RPL), or Interagency Career Transition Assistance Plan (ICTAP): Visit the OPM website for information on how to apply as a CTAP, RPL, or ICTAP eligible. To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.\nFirst time hires to the federal government normally start at the lowest rate of the salary range for the grade selected.\nTravel, transportation, and relocation expenses will not be paid. Any travel, transportation, and relocation expense associated with reporting for duty will be the responsibility of the selected employee.\nThis position may be eligible to telework up to four days per week, based upon the duties of the position. This position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.\nLocality pay will vary based upon the selectee's duty location. A final salary determination will be made upon selection.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nIdentifies and resolves a wide variety of large and small-scale problems with computer and telephone systems, equipment, and software, including that which involves system integration and configuration management.\nProvides tier-1, customer-based services including account creation, password recovery and resets, account and object deletion, certification issuance and revocation, service request creation, modification, closure and reports generation\nPlans and procures IT goods and services including life-cycle hardware replacement, commercial and government off-the-shelf software, specialized administrative tools, third-party applications and middle-ware and logistics.\nTroubleshoots, diagnoses, and resolves hardware, software, operating systems and data communications system failures to maximize user \neffectiveness and efficiency.\nSupports the Information Systems Security Officer (ISSO) in the implementation of Agency compliant physical security measures, software security measures, and management controls\n\n"}, {"jobID": "696549800", "origin_search": "https://www.usajobs.gov/", "posted": "12/23/2022", "jobTitle": "Biomedical Equipment Support Specialist (Information Systems)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/696549800", "jobLocation": {"remote": "not specified", "city": "Muskogee", "state": "OK", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 79363, "max": 103176}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job.\nSelective Service Registration is required for males born after 12/31/1959.\nMust be proficient in written and spoken English.\nYou may be required to serve a probationary period.\nSubject to background/security investigation.\nSelected applicants will be required to complete an online onboarding process.\nMust pass pre-employment physical examination.\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP).\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP)\n\n\n\n Qualifications\n\nBasic Requirements:\n\nUnited States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\nEnglish Language Proficiency: Must be proficient in spoken and written English in accordance with VA Handbook 5005, Part II, chapter 3, section A, paragraph 3j, this part.\n\nEducation and/or Experience: Associates degree in Biomedical Electronics Technology, Biomedical Equipment Technology or Biomedical Engineering Technology or in a related technical field such as Electronic Technology or Information Technology and two years of experience as a Biomedical Equipment Support Specialist, Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer, or Information Technology Specialist.\n\nOR,\n\nBachelor's degree in Biomedical Engineering Technology or in a related field such as Electronics Engineering Technology (EET) or Information Technology.\n\nOR,\n\nCompletion of a military training program in biomedical equipment and two years of experience as a Biomedical Equipment Support Specialist or Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer or Information Technology Specialist.\n\nGrade Determinations:GS-12 (Full-Performance Level):\n\nExperience: At least one year of specialized experience equivalent to the GS-11 grade level.\nDemonstrated Knowledge Skills, and Abilities: In addition to the experience above, the candidate must demonstrate all the following KSAs:\n\n(a) Current knowledge of computer virus protection software, available software patches and upgrades, and information security tools\n(b) Expert knowledge of electronics, computer and networking theory with experience maintaining, interfacing and troubleshooting networked medical equipment to include VLAN configuration, IP addressing, sub-netting, and network security.\n(c) Ability to utilize and maintain computer and server based medical equipment, medical record databases, and proprietary and generic software, Experience with TCP/IP, HL7, networking, network security, and DICOM standards.\n(d) Ability to interpret, identify, and apply network engineering principles and practices where there often times is no previous example to follow, or precedence.\n(e) Skill to distinguish networking problems from non-networking problems and discuss various options with IT networking and operations staff members.\n\nReferences: VA Handbook 5005/95; PART II; APPENDIX G49.\n\nThe full performance level of this vacancy is GS-11. Selections for this position will be at GS-12.\n\nPhysical Requirements: The work requires frequent standing, walking, bending, crouching, reaching, and stooping.\r\n                                    \n\n\nEducation\n\nIMPORTANT: A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nThis position is in the Excepted Service and does not confer competitive status.VA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38 and are not covered by the Schedule A excepted appointment authority.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The incumbent provides clinical and administrative support to staff, patients, and administrators for all matters of concern relating to the facility wide lifecycle management of networks, networked medical equipment and associated systems.\n\nLifecycle management of network equipment including but not limited to network switches, servers, routers and related infrastructure for any and all networked complex medical devices and systems such as imaging, life support, dialysis, and monitoring. Completes both routine and complex assignments involved identifying and troubleshooting issues related to VLAN configuration, IP addressing, sub-netting, HL7,DICOM, Access Control List (ACL) and network security across the medical device network. Coordinates and works effectively with other facility support departments including but not limited to Facilities Management Service (FMS), Office of Information Technology (OIT), Sterile Processing Service (SPS), and Environmental Management Service (EMS). Utilizes advanced network test equipment and software including but not limited to tracers, wireless spectrum analyzers, network traffic monitors, command prompt, physical and virtual server software.\nImplements and plans for new and emerging technologies including but not limited to diagnostic modalities, network management and storage, and virtual data centers.\nDesigns, implements and manages network incident response due to infection, loss of service or regional and local policy changes according to VA guidelines. Ensures proper security configuration for assigned devices and networks. Regularly reviews and installs available approved software updates and virus definitions for applicable networked medical devices. Leads development of disaster recovery procedures for critical systems to be enacted in the event of device failure. Adheres to MDIA Guidelines in both pre procurement and during system implementation. Loads operating system (OS) and clinical application software as needed.\nAs assigned, employee is responsible for lifecycle management of any and all medical devices and systems such as imaging, life support, dialysis, and monitoring to include physical and network support. Completes both routine and complex assignments involved in the installation, maintenance, modification, Biomedical Equipment Support Specialist (Biomedical Info Systems) GS-1601-12troubleshooting, repair and calibration of these complex therapeutic, diagnostic and life support medical devices and systems. Specific tasks include but are not limited to incoming inspections, regular and unscheduled maintenance, and planning for end-of-life replacement in conjunction with clinical services. Utilizes common test equipment including, but not limited to, electrical safety analyzers, oscilloscopes, patient simulators, pulse generators, network analyzers, and multimeters.\nMaintains functional knowledge of relevant safety codes and standards of regulatory bodies including but not limited to The Joint Commission (TJC), National Fire Protection Association (NFPA), Food and Drug Administration (FDA), Nuclear Regulatory Commission (NRC), Association for the Advancement of Medical Instrumentation (AAMI), American College of Radiology (ACR), Federal Information Processing Standards (FIPS).\nDocuments all work performed in the computerized maintenance management system (CMMS). This documentation is completed in accordance with regulatory body requirements, Healthcare Technology Management (HTM) Documentation of Services guidelines and other organizational requirements. Maintains documentation of biomedical information systems covering ePHI requirements, VLAN, IP address, anti-virus software, security and other required information.\nProvides training and education as appropriate to medical technology end users and clinical staff.\nAdditional duties are performed as assigned by supervisor related to maintenance, remediation, and tracking of medical systems (action items, special projects, etc.) to meet mission critical requirements. May be asked to assist in other administrative duties as well, including participating in hiring panels or working on VISN/National initiatives as a technical expert.\n\nWork Schedule: FT, Monday thru Friday 7:30am to 4:00pm.\nCompressed/Flexible: Not Authorized\nTelework: Authorized\nVirtual: This is not a virtual position.\nFunctional Statement #: 51125-A\nRelocation/Recruitment Incentives: Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "696551800", "origin_search": "https://www.usajobs.gov/", "posted": "12/23/2022", "jobTitle": "Biomedical Equipment Support Specialist (Information Systems)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/696551800", "jobLocation": {"remote": "not specified", "city": "Muskogee", "state": "OK", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 79363, "max": 103176}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job.\nSelective Service Registration is required for males born after 12/31/1959.\nMust be proficient in written and spoken English.\nYou may be required to serve a probationary period.\nSubject to background/security investigation.\nSelected applicants will be required to complete an online onboarding process.\nMust pass pre-employment physical examination.\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP).\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP)\n\n\n\n Qualifications\n\nBasic Requirements:\n\nUnited States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\nEnglish Language Proficiency: Must be proficient in spoken and written English in accordance with VA Handbook 5005, Part II, chapter 3, section A, paragraph 3j, this part.\n\n\nEducation and/or Experience: Associates degree in Biomedical Electronics Technology, Biomedical Equipment Technology or Biomedical Engineering Technology or in a related technical field such as Electronic Technology or Information Technology and two years of experience as a Biomedical Equipment Support Specialist, Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer, or Information Technology Specialist.\n\nOR,\n\nBachelor's degree in Biomedical Engineering Technology or in a related field such as Electronics Engineering Technology (EET) or Information Technology.\n\nOR,\n\nCompletion of a military training program in biomedical equipment and two years of experience as a Biomedical Equipment Support Specialist or Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer or Information Technology Specialist.\n\nGrade Determinations:GS-12 (Full-Performance Level):\n\nExperience: At least one year of specialized experience equivalent to the GS-11 grade level.\nDemonstrated Knowledge Skills, and Abilities: In addition to the experience above, the candidate must demonstrate all the following KSAs:\n\n(a) Current knowledge of computer virus protection software, available software patches and upgrades, and information security tools\n(b) Expert knowledge of electronics, computer and networking theory with experience maintaining, interfacing and troubleshooting networked medical equipment to include VLAN configuration, IP addressing, sub-netting, and network security.\n(c) Ability to utilize and maintain computer and server based medical equipment, medical record databases, and proprietary and generic software, Experience with TCP/IP, HL7, networking, network security, and DICOM standards.\n(d) Ability to interpret, identify, and apply network engineering principles and practices where there often times is no previous example to follow, or precedence.\n(e) Skill to distinguish networking problems from non-networking problems and discuss various options with IT networking and operations staff members.\n\nReferences: VA Handbook 5005/95; PART II; APPENDIX G49.\n\nThe full performance level of this vacancy is GS-11. Selections for this position will be at GS-12.\n\nPhysical Requirements: The work requires frequent standing, walking, bending, crouching, reaching, and stooping.\n\n\n\nEducation\n\nIMPORTANT: A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nThis position is in the Excepted Service and does not confer competitive status.VA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38 and are not covered by the Schedule A excepted appointment authority.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The incumbent provides clinical and administrative support to staff, patients, and administrators for all matters of concern relating to the facility wide lifecycle management of networks, networked medical equipment and associated systems.\n\nLifecycle management of network equipment including but not limited to network switches, servers, routers and related infrastructure for any and all networked complex medical devices and systems such as imaging, life support, dialysis, and monitoring. Completes both routine and complex assignments involved identifying and troubleshooting issues related to VLAN configuration, IP addressing, sub-netting, HL7,DICOM, Access Control List (ACL) and network security across the medical device network. Coordinates and works effectively with other facility support departments including but not limited to Facilities Management Service (FMS), Office of Information Technology (OIT), Sterile Processing Service (SPS), and Environmental Management Service (EMS). Utilizes advanced network test equipment and software including but not limited to tracers, wireless spectrum analyzers, network traffic monitors, command prompt, physical and virtual server software.\nImplements and plans for new and emerging technologies including but not limited to diagnostic modalities, network management and storage, and virtual data centers.\nDesigns, implements and manages network incident response due to infection, loss of service or regional and local policy changes according to VA guidelines. Ensures proper security configuration for assigned devices and networks. Regularly reviews and installs available approved software updates and virus definitions for applicable networked medical devices. Leads development of disaster recovery procedures for critical systems to be enacted in the event of device failure. Adheres to MDIA Guidelines in both pre procurement and during system implementation. Loads operating system (OS) and clinical application software as needed.\nAs assigned, employee is responsible for lifecycle management of any and all medical devices and systems such as imaging, life support, dialysis, and monitoring to include physical and network support. Completes both routine and complex assignments involved in the installation, maintenance, modification, Biomedical Equipment Support Specialist (Biomedical Info Systems) GS-1601-12troubleshooting, repair and calibration of these complex therapeutic, diagnostic and life support medical devices and systems. Specific tasks include but are not limited to incoming inspections, regular and unscheduled maintenance, and planning for end-of-life replacement in conjunction with clinical services. Utilizes common test equipment including, but not limited to, electrical safety analyzers, oscilloscopes, patient simulators, pulse generators, network analyzers, and multimeters.\nMaintains functional knowledge of relevant safety codes and standards of regulatory bodies including but not limited to The Joint Commission (TJC), National Fire Protection Association (NFPA), Food and Drug Administration (FDA), Nuclear Regulatory Commission (NRC), Association for the Advancement of Medical Instrumentation (AAMI), American College of Radiology (ACR), Federal Information Processing Standards (FIPS).\nDocuments all work performed in the computerized maintenance management system (CMMS). This documentation is completed in accordance with regulatory body requirements, Healthcare Technology Management (HTM) Documentation of Services guidelines and other organizational requirements. Maintains documentation of biomedical information systems covering ePHI requirements, VLAN, IP address, anti-virus software, security and other required information.\nProvides training and education as appropriate to medical technology end users and clinical staff.\nAdditional duties are performed as assigned by supervisor related to maintenance, remediation, and tracking of medical systems (action items, special projects, etc.) to meet mission critical requirements. May be asked to assist in other administrative duties as well, including participating in hiring panels or working on VISN/National initiatives as a technical expert.\n\nWork Schedule: FT, Monday thru Friday 7:30am to 4:00pm.\nCompressed/Flexible: Not Authorized\nTelework: Authorized\nVirtual: This is not a virtual position.\nFunctional Statement #: 51125-A\nRelocation/Recruitment Incentives: Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "716039900", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "Instructional System Specialist, GS-1750-11", "companyName": "U.S.CoastGuard", "link": "https://www.usajobs.gov/job/716039900", "jobLocation": {"remote": "not specified", "city": "Petaluma", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 85508, "max": 111157}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship is required.\nMales born after 12/31/1959 must be registered for Selective Service.\nYou MUST provide a copy of your unofficial transcripts\nA one-year probationary period may be required\nBackground Investigation is required.\n\n\nAll qualification requirements must be met by the closing date of the announcement.\n\n\n Qualifications\n\nTo qualify, applicant must meet the BASIC REQUIREMENTS of the position.\nBasic Requirements:\nDegree: that included or was supplemented by at least 24 semester hours appropriate to the work of the position to be filled. The course work MUST have included study in at least four of the following five areas:\n\nLearning theory, psychology of learning, educational psychology: Study of learning theories as they relate to the systematic design, development, and validation of instructional material.\nInstructional design practices: Study of the principles and techniques used in designing training programs, developing design strategy and models, and applying design methods to the improvement of instructional effectiveness.\nEducational evaluation: Study of the techniques for evaluating the effectiveness of instructional/educational programs, including developing written and performance tests and survey instruments, and determining reliability and validity of evaluation instruments.\nInstructional product development: Study of the techniques appropriate for developing training materials, including identifying learner characteristics, specifying objectives, applying training strategy, validating training materials, and evaluating training.\nComputers in education and training: Study of the application of computers in education and training, including selecting appropriate computer software.\n\nAt the GS-11: In addition to meeting the basic education requirements above, applicants must possess one year of specialized experience equivalent to at least the GS-09 level in the federal service. \nSpecialized experience is experience that has equipped you with the particular ability, skill, and knowledge to successfully perform the duties of this position and is typically in or related to this line of work.\nExamples of specialized experience include:\n\nDesigning, reviewing, and revising instructional material.\nPlanning, coordinating, designing traditional classroom delivery methodologies based on various Instructional Systems Development (ISD) systematic practices.\nDesigning, developing and evaluating a wide variety of training aids and devices such as job aids, practice exercises, visual aids, pre-requisite instruction, preview instruction, remedial instruction, computer assisted instruction, or other types of training and performance support materials.\nPlanning and conducting evaluations of instructional programs.\nStudying and analyzing the results of complete full-length testing and validation testing for instructional materials.\nEvaluating, selecting, and recommending procumbent of appropriate electronic delivery systems and/or media and coursework.\nClarifying conditions and standards for task outputs and performance objectives.\n\nORPossess a combination of specialized experience equivalent to the GS-09 level in or related to the work of this position AND graduate level education that provided the specific knowledge, skills and abilities to successfully perform the duties of this position and experience. The total percentages must equal at least 100 percent to qualify at that grade level.\nHave 3 full years of progressively higher-level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree.\nORPossess a combination of specialized experience equivalent to the GS-09 level in or related to the work of this position AND graduate level education that provided the specific knowledge, skills and abilities to successfully perform the duties of this position and experience. The total percentages must equal at least 100 percent to qualify at that grade level.\nNational Service Experience (i.e., volunteer experience): Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\nThe Office of Personnel management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule, C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.\n\n\n\nEducation\n\nThis position does have a positive education requirement. If you are including education on your resume, report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. See Required Documents section for detail.\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet Federal qualification requirements if you can show that your foreign education is comparable to education received in accredited educational institutions in the United States. It is your responsibility to provide such evidence with your application. See Recognition of Foreign Qualifications click here\n\n\n\nAdditional information\n\nApplicants will be required to complete questions contained on the Declaration for Federal Employment (OF-306) at the time a tentative job offer is made. Certain responses on the form could pose a problem with suitability for employment determinations. If you receive a conditional offer of employment for this position, you will be required to complete/make updates to the OF-306 and to sign and certify the accuracy of all information in your application, prior to entry on duty. False statements on any part of the application may result in withdrawal of offer of employment, dismissal after beginning work, or imprisonment.\nDHS uses e-Verify, an Internet-based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about e-Verify, including your rights and responsibilities at click here\nRecruitment incentives may be authorized.\n**Must provide a copy of your unofficial transcripts**\nAll Federal employees are required to have Federal salary payments made by direct deposit.\nThe Department of Homeland Security encourages persons with disabilities to apply, to include persons with intellectual, severe physical or psychiatric disabilities, as defined by 5 CFR § 213.3102(u), and/or Disabled Veterans with a compensable service-connected disability of 30 percent or more as defined by 5 CFR § 315.707. Veterans, Peace Corps/VISTA volunteers, and persons with disabilities possess a wealth of unique talents, experiences, and competencies that can be invaluable to the DHS mission. If you are a member of one of these groups, you may not have to compete with the public for federal jobs. To determine your eligibility for non-competitive appointment and to understand the required documentation, click on the links above or contact the Servicing Human Resources Office listed at the bottom of this announcement.\nMore than 1 selection may be made from this announcement if additional identical vacancies in the same title, series, grade, and unit occur within 45 days from the date the certificate was issued.\nIf you need a reasonable accommodation for the application and hiring process, please contact 410-636-7905. Decisions on granting reasonable accommodation will be made on a case-by-case basis. Visit Reasonable Accommodation\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nDHS offers competitive salaries and an attractive benefits package, including: health, dental, vision, life, and long-term care insurance; retirement plan; Thrift Savings Plan [similar to a 401(K)]; Flexible Spending Account; Employee Assistance Program; personal leave days; and paid federal holidays.  Other benefits may include:  flexible work schedules; telework; tuition reimbursement; transportation subsidies; uniform allowance; health and wellness programs; and fitness centers.  DHS is committed to employee development and offers a variety of employee training and development opportunities.  For more information, go to the DHS Careers website and select “Benefits”.  Disabled veteran leave will be available to any Federal employee hired on or after November 5, 2016, who is a veteran with a service-connected disability rating of 30 percent or more.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs an Instructional System Specialist, you will analyze, design, develop, implement, and evaluate educational curriculum through application of instruction and educational technology. Employing traditional and innovative performance improvement systems and interventions to include alternative delivery methods (modeling and simulation, computer-based training, videos, job aids, etc.). Conducts research, formulates design strategies and milestones, and implements courseware design utilizing knowledge of educational principles and instructional design technology and processes.\nBeing a Coast Guard civilian makes you a valuable member of the Coast Guard team.\nTypical work assignments include:\n\nDeveloping, reviewing and revising instructional materials in accordance with specific criterion-referenced job performance objectives and an Instructional Systems Development (ISD)/Systems Approach to Training (SAT), specifically the Accomplishment-Based Curriculum Development (ABCD) system.\nDeveloping job aids; criterion-referenced performance test, practice exercises, memory-building exercises, pre-requisite instruction, preview instruction, remedial instruction, student materials, and instructor guides. \nPlans coordinates, and designs instruction based on the findings of accomplishment, task, and job aid analysis while using an ISD/SAT process, specifically the ABCD system\nEvaluating, selecting and recommending procurement of appropriate electronic delivery systems including media and courseware from government organizations, commercially developed software, and contractor developed materials.\nConducting operant-level task analysis to document the critical thinking and actions required for successful task performance.\nPlanning and conducting evaluations of instructional programs for a specialty area using various methodologies.\nProviding advice and guidance to program and training managers in the analysis, design, development, implementation, and evaluation of training programs.\nDeveloping the basic concepts, procedures, guidelines, and models for packaging a complete instructional system for a major training organization within the USCG.\n\n\n"}, {"jobID": "716043700", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "Instructional System Specialist, GS-1750-11", "companyName": "U.S.CoastGuard", "link": "https://www.usajobs.gov/job/716043700", "jobLocation": {"remote": "not specified", "city": "Petaluma", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 85508, "max": 111157}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship is required.\nMales born after 12/31/1959 must be registered for Selective Service.\nYou MUST provide a copy of your unofficial transcripts\nA one-year probationary period may be required\nBackground Investigation is required.\n\n\nAll qualification requirements must be met by the closing date of the announcement.\n\n\n Qualifications\n\nTo qualify, applicant must meet the BASIC REQUIREMENTS of the position.\nBasic Requirements:\nDegree: that included or was supplemented by at least 24 semester hours appropriate to the work of the position to be filled. The course work MUST have included study in at least four of the following five areas:\n\nLearning theory, psychology of learning, educational psychology: Study of learning theories as they relate to the systematic design, development, and validation of instructional material.\nInstructional design practices: Study of the principles and techniques used in designing training programs, developing design strategy and models, and applying design methods to the improvement of instructional effectiveness.\nEducational evaluation: Study of the techniques for evaluating the effectiveness of instructional/educational programs, including developing written and performance tests and survey instruments, and determining reliability and validity of evaluation instruments.\nInstructional product development: Study of the techniques appropriate for developing training materials, including identifying learner characteristics, specifying objectives, applying training strategy, validating training materials, and evaluating training.\nComputers in education and training: Study of the application of computers in education and training, including selecting appropriate computer software.\n\nAt the GS-11: In addition to meeting the basic education requirements above, applicants must possess one year of specialized experience equivalent to at least the GS-09 level in the federal service. \nSpecialized experience is experience that has equipped you with the particular ability, skill, and knowledge to successfully perform the duties of this position and is typically in or related to this line of work.\nExamples of specialized experience include:\n\nDesigning, reviewing, and revising instructional material.\nPlanning, coordinating, designing traditional classroom delivery methodologies based on various Instructional Systems Development (ISD) systematic practices.\nDesigning, developing and evaluating a wide variety of training aids and devices such as job aids, practice exercises, visual aids, pre-requisite instruction, preview instruction, remedial instruction, computer assisted instruction, or other types of training and performance support materials.\nPlanning and conducting evaluations of instructional programs.\nStudying and analyzing the results of complete full-length testing and validation testing for instructional materials.\nEvaluating, selecting, and recommending procumbent of appropriate electronic delivery systems and/or media and coursework.\nClarifying conditions and standards for task outputs and performance objectives.\n\nORPossess a combination of specialized experience equivalent to the GS-09 level in or related to the work of this position AND graduate level education that provided the specific knowledge, skills and abilities to successfully perform the duties of this position and experience. The total percentages must equal at least 100 percent to qualify at that grade level.\nHave 3 full years of progressively higher-level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree.\nORPossess a combination of specialized experience equivalent to the GS-09 level in or related to the work of this position AND graduate level education that provided the specific knowledge, skills and abilities to successfully perform the duties of this position and experience. The total percentages must equal at least 100 percent to qualify at that grade level.\nNational Service Experience (i.e., volunteer experience): Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\nThe Office of Personnel management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule, C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.\n\n\n\nEducation\n\nThis position does have a positive education requirement. If you are including education on your resume, report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. See Required Documents section for detail.\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet Federal qualification requirements if you can show that your foreign education is comparable to education received in accredited educational institutions in the United States. It is your responsibility to provide such evidence with your application. See Recognition of Foreign Qualifications click here\n\n\n\nAdditional information\n\nApplicants will be required to complete questions contained on the Declaration for Federal Employment (OF-306) at the time a tentative job offer is made. Certain responses on the form could pose a problem with suitability for employment determinations. If you receive a conditional offer of employment for this position, you will be required to complete/make updates to the OF-306 and to sign and certify the accuracy of all information in your application, prior to entry on duty. False statements on any part of the application may result in withdrawal of offer of employment, dismissal after beginning work, or imprisonment.\nDHS uses e-Verify, an Internet-based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about e-Verify, including your rights and responsibilities at click here\nRecruitment incentives may be authorized.\n**Must provide a copy of your unofficial transcripts**\nAll Federal employees are required to have Federal salary payments made by direct deposit.\nThe Department of Homeland Security encourages persons with disabilities to apply, to include persons with intellectual, severe physical or psychiatric disabilities, as defined by 5 CFR § 213.3102(u), and/or Disabled Veterans with a compensable service-connected disability of 30 percent or more as defined by 5 CFR § 315.707. Veterans, Peace Corps/VISTA volunteers, and persons with disabilities possess a wealth of unique talents, experiences, and competencies that can be invaluable to the DHS mission. If you are a member of one of these groups, you may not have to compete with the public for federal jobs. To determine your eligibility for non-competitive appointment and to understand the required documentation, click on the links above or contact the Servicing Human Resources Office listed at the bottom of this announcement.\nMore than 1 selection may be made from this announcement if additional identical vacancies in the same title, series, grade, and unit occur within 45 days from the date the certificate was issued.\nIf you need a reasonable accommodation for the application and hiring process, please contact 410-636-7905. Decisions on granting reasonable accommodation will be made on a case-by-case basis. Visit Reasonable Accommodation\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nDHS offers competitive salaries and an attractive benefits package, including: health, dental, vision, life, and long-term care insurance; retirement plan; Thrift Savings Plan [similar to a 401(K)]; Flexible Spending Account; Employee Assistance Program; personal leave days; and paid federal holidays.  Other benefits may include:  flexible work schedules; telework; tuition reimbursement; transportation subsidies; uniform allowance; health and wellness programs; and fitness centers.  DHS is committed to employee development and offers a variety of employee training and development opportunities.  For more information, go to the DHS Careers website and select “Benefits”.  Disabled veteran leave will be available to any Federal employee hired on or after November 5, 2016, who is a veteran with a service-connected disability rating of 30 percent or more.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAs an Instructional System Specialist, you will analyze, design, develop, implement, and evaluate educational curriculum through application of instruction and educational technology. Employing traditional and innovative performance improvement systems and interventions to include alternative delivery methods (modeling and simulation, computer-based training, videos, job aids, etc.). Conducts research, formulates design strategies and milestones, and implements courseware design utilizing knowledge of educational principles and instructional design technology and processes.\nBeing a Coast Guard civilian makes you a valuable member of the Coast Guard team.\nTypical work assignments include:\n\nDeveloping, reviewing and revising instructional materials in accordance with specific criterion-referenced job performance objectives and an Instructional Systems Development (ISD)/Systems Approach to Training (SAT), specifically the Accomplishment-Based Curriculum Development (ABCD) system.\nDeveloping job aids; criterion-referenced performance test, practice exercises, memory-building exercises, pre-requisite instruction, preview instruction, remedial instruction, student materials, and instructor guides. \nPlans coordinates, and designs instruction based on the findings of accomplishment, task, and job aid analysis while using an ISD/SAT process, specifically the ABCD system\nEvaluating, selecting and recommending procurement of appropriate electronic delivery systems including media and courseware from government organizations, commercially developed software, and contractor developed materials.\nConducting operant-level task analysis to document the critical thinking and actions required for successful task performance.\nPlanning and conducting evaluations of instructional programs for a specialty area using various methodologies.\nProviding advice and guidance to program and training managers in the analysis, design, development, implementation, and evaluation of training programs.\nDeveloping the basic concepts, procedures, guidelines, and models for packaging a complete instructional system for a major training organization within the USCG.\n\n\n"}, {"jobID": "716629900", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Engraving Machine Operator NA-06", "companyName": "ArmyInstallationManagementCommand", "link": "https://www.usajobs.gov/job/716629900", "jobLocation": {"remote": "not specified", "city": "WestPoint", "state": "NY", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 1932, "max": 225411932}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nA Medical Examination is required; work involves standing, stooping, bending, reaching, and involves the continuous handling of light objects.\nDirect Deposit and Social Security Card is required.\nMeet qualification/eligibility/background requirements for this position.\nA one year probationary period may be required.\nSatisfactorily complete an employment verification (E-Verify) check.\nMust be willing to accept varying and/or rotating shifts to include nights, weekends and holidays.\nThe dual compensation guidelines DO NOT apply to this position. All GS and NAF employees whether full time or part time are eligible to apply for this position.\n\n\n Qualifications\n\r\n                                        Must have comparable work experience that provided the applicant with the knowledge, skills and ability to carry out the above duties.\n\nWork experience using specialized equipment (e.g. computer based embroidery machines, technical CAD software programs) and other specialized equipment that includes but is not limited to beveling machines, pantograph and/or laser engraver, COREL DRAW software, heatpresses, copy machines, plastic shears, and engraving controller.\n\nKnowledge and skill using tools of the trade de which includes but is not limited to milling tools, grinders, miter and/or scroll saw and sander.\n\nThis experience must be reflected on your resume to be considered eligible for this position.\n\nSkills and Knowledge:\nMust have a complete knowledge of the engraving machine, its spacing and accessories. Must have some knowledge of the metals and materials being utilized. Possess the skills necessary to adjust gauges and controls. Must be able to determine from drawings what markings are needed on items and where the markings should be located.\n\nYour qualifications will be evaluated on the following competencies: knowledge, skills, abilities, additional screening criteria and other characteristics.\n\nHighly Preferred Criteria:\n\n18 years of age at time of appointment\n\nApplicants meeting the Highly Preferred criteria will be referred first to the Selecting Official. All other applicants will be referred for consideration if the certificate (referral list) is returned with no selection.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nInitial Cutoff: Monday, April 17th 2023 (Applications must be received by 11:59 PM EST)\nApplications received by the Initial Cut-Off Date will be reviewed and possibly referred to the Selecting Official PRIOR to the Closing Date of this Vacancy Announcement.\n\nSubsequent referrals to the Hiring Manager will occur every two weeks thereafter based on management's need to fill positions.\n\nArea of Consideration:\n\nThe Area of Consideration for this vacancy announcement is for U.S. Citizens and Non Citizens residing within a 30 mile radius of West Point, NY. (Military Spouse Preference (MSP) and Involuntarily Separated Military Preference (ISMP) eligible candidates are included in the area of consideration.)\n\n\nManual Applications:\n\nWest Point is not receiving manual applications at this time due to the COVID-19 pandemic. If you are interested in a manual application, please send your request to the email listed below with the Vacancy Number and the position's title. An application will be emailed to you. The completed application and supporting documentation can be emailed back.\nNOTE: Applications will not be reviewed for completeness and any incomplete applications will result in an ineligible rating. We appreciate your understanding during this difficult time.\n\n\tusarmy.westpoint.chra-ne.mbx.cpac-naf-hro@army.mil\n\nNeglecting to respond to the job related questions will result in an ineligible rating.\n\nAllowances, Incentives, and PCS Costs:\n\nAllowances, differentials, or incentives will not be paid.\nPayment Permanent Change of Station (PCS) costs are not authorized, based on a determination that a PCS move is not in the Government's interest.\n\nPlease check out our Applicant Information Kit:\n\nIt contains additional information applicants may find useful when applying for our jobs. (To view the kit, click or copy and paste this URL: https://publicfileshare.chra.army.mil/Applicants/NAF%20Applicant%20Information%20Kit.pdf ).\n\nOther:\n\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/\nAdditional referrals may be made from this vacancy announcement for up to 90 days after the closing date.\nApplications are valid for 90 days after submission date. Applicants will be referred to selecting officials as additional vacancies occur.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nSets up and operates engraving machines to engrave markings on gages, jigs, fixtures, and a variety of other items. Aligns and secures work pieces on vise, turntable, or table of machine to engrave flat, curved, and/or irregular surfaces.\nAssigns sequential identification numbers to gages and maintains individual records for each number. Retrieves material from storage requiring marking updates or changes.\nUses specialized, computer based equipment such as engraving and embroidery machines to inscribe identification markings on variety of items. Digitizes custom, camera-ready designs using technical CAD software programs.\nProvides information and general instruction on the use of equipment, facilities and machinery. Provides safety instruction and demonstrates safe use of equipment.  Participates in special events to market the engraving/embroidery services.\nUses specialized equipment such as beveling machine, pantograph engraver, laser engraver and COREL DRAW software, heat presses, copy machines and plastic shears. Performs other duties as assigned.\n\n"}, {"jobID": "689661400", "origin_search": "https://www.usajobs.gov/", "posted": "11/16/2022", "jobTitle": "Information Technology Specialist", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/689661400", "jobLocation": {"remote": "not specified", "city": "Guam", "state": "GU", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 47097, "max": 105579}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nPlease read this Public Notice in its entirety prior to submitting your application for consideration.\nU.S. Citizenship is required\nMales must be registered for Selective Service, see www.sss.gov\nTotal salary varies depending on location of position\nPCS expenses if authorized will be paid IAW JTR and Air Force Regulations\nRecruitment incentives may be authorized\nPosition may be subject to random drug testing\nEmployee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays\nShift work and emergency overtime may be required\nEmployee must maintain current certifications\nA security clearance may be required\nDisclosure of Political Appointments\n\n\n Qualifications\n\r\n                                        Appointments are on a time-limited basis, Temporary or Term. Initial Term appointments will not exceed 2 years with the ability to extend for two additional terms (not to exceed 2 years for each extension) NTE a total of 6 years.\n\nSpouses must accompany sponsor on PCS orders, be in the local commuting area, and currently reside with the sponsor. This authority allows military spouses to be hired for positions on a temporary basis, while maintaining their military spouse preference entitlements to seek permanent job opportunities. See common vacancies at the following locations: MILDENHALL UNITED KINGDOM; RAMSTEIN AB, GERMANY; SPANGDAHLEM AB, GERMANY; AVIANO AB, ITALY; INCIRLIK AB, TURKEY; YOKOTA AB, JAPAN; KADENA AB, JAPAN; MISAWA, JAPAN, KUNSAN, KOREA, OSAN AB, KOREA; LAJES FIELD, PORTUGUL and ANDERSEN AFB, GUAM\n\nIn order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Information Technology (IT) Management Series, 2210 (Alternative A)\n\nBASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: \nThis standard allows eligibility through meeting either the requirements specified in the section titled Education or the requirements specified in the section titled Experience.\nEducation: All academic degrees and coursework must be from accredited or pre-accredited institutions\nUndergraduate or Graduate Education: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\nOR\nExperience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate\nGS-5 through GS-15 (or equivalent): For all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nInformation Technology (IT) Management Series 2210 (Alternative A) (opm.gov)\n\nEXPERIENCE REQUIRED: Your resume must reflect the quality level of experience which demonstrates the possession of the knowledge, skills, abilities, and competencies necessary for successful job performance required for this position. Examples of creditable experience include: Knowledge of IT systems analysis and applications software concepts, functions, techniques, and capabilities sufficient to evaluate new and emerging IT security methods and principles, the feasibility of proposed new systems and applications software projects; and to design, write, test, debug, and maintain information systems and applications software and ensure successful integration with existing and anticipated infrastructure in the database environment\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1.  Knowledge of IT systems analysis and applications software concepts, functions, techniques, and capabilities sufficient to evaluate new and emerging IT security methods and principles, the feasibility of proposed new systems and applications software projects; and to design, write, test, debug, and maintain information systems and applications software and ensure successful integration with existing and anticipated infrastructure in the database environment.\n\n2.  Knowledge of operational activities (such as special operations, personnel recovery, airlift, etc...), weapon systems, and command, control, and mission process, systems, and applications.\n\n3.  Knowledge of IT management information systems and applications software technology to isolate causes of problems between hardware, system, and applications software programs and to measure system performance and/or extend operating system capabilities to support organizational business processes and operations. \n\n4.  Knowledge of IT management information systems requirements and application software development techniques required in carrying out project assignments of considerable difficulty and with little specificity regarding approach to be followed.\n\n5. Ability to maintain an up-to-date awareness of technological advances and predict how management can meet future requirements.\n\n\n6.  Ability to plan, organize, and direct the functions and staff of an organization.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience; transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\n\nFor Direct Hire (DHA) Positions:\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application.\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\nTemporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position.\n\nSelective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11734004\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n****Duties may vary depending on grade level****\nAnalyzes a variety of unusual problems, questions, or conditions relative to develop and employ command, control, and mission information, processes, and systems in order to support related mission activities.\nDevelops and maintains required programs to support mission needs\nPerforms required testing, troubleshoots, and corrects system and applications software discrepancies.\nManages mission knowledge, information, and situational awareness processes and systems for operational and tactical operating centers and units.\nDetermines requirements and recognizes and analyzing trends and providing instruction and orientation services.\n\n"}, {"jobID": "715326300", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Program Analyst", "companyName": "U.S.FishandWildlifeService", "link": "https://www.usajobs.gov/job/715326300", "jobLocation": {"remote": "not specified", "city": "LocationNegotiableAfterSelection", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 107680}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. Citizen or National.\nResume (See \"Required Documents\").  Failure to provide ALL required information on your resume will result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all information is provided on resume.\nEligibility and Supporting documents - You will ONLY be considered for the eligibilities that you select \"yes\" to AND submit the required supporting documentation, as listed in the Required Documents section.\nMerit promotion applicants must meet time-in-grade requirement as defined in 5 CFR 300, Subpart F.\nSuitability for employment, as determined by background investigation.\nProbationary Period: Selectees may be required to successfully complete a probationary period.\nIndividuals assigned male at birth after 12-31-59 must be registered for the Selective Service. To verify registration visit SSS.gov.\n\n\n Qualifications\n\r\n                                        Only experience and education obtained by 04/07/2023 will be considered.\n\nIn order to qualify for this position you must possess the Minimum Qualification.\n\nMinimum Qualification [GS-12]\n\nOne year of specialized experience comparable in scope and responsibility equivalent to grade GS-11 in the Federal service. Experience may include: 1) Defining and documenting business processes in software development requirements gathering sessions. 2) Identifying areas for improvement, anticipate requirements, problem solve and/or implement of solutions. 3) Conducting development testing of new systems and/or training initiatives.\n\nMinimum Qualification [GS-13]\n\nOne year of specialized experience comparable in scope and responsibility equivalent to grade GS-12 in the Federal service. Experience may include: 1) Defining and documenting business processes in software development requirements gathering sessions. 2) Identifying areas for improvement, anticipate requirements, problem solve and/or implement of solutions. 3) Conducting development testing of new systems and/or training initiatives. 4) Developing and implementing long range business or project management plans.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTime In Grade Requirement: Applicants must meet both eligibility and qualification requirements for the position of interest by the closing date of the JOA. Specifically,\ni. Area of Consideration.\nii. Time-in-grade (TIG) requirements as specified in 5 CFR 300, Subpart F.\niii. Time after competitive appointment as specified in 5 CFR 330.502.\niv. Qualification requirements outlined in OPM's Qualifications Standards for General Schedule Positions or for Federal Wage System (FWS), wage grade positions, applicants are evaluated using the OPM Job Qualification System for Trades and Labor Occupations and the job element examining method\n\nYour SF-50 will be used to confirm you meet all requirements\n\nPublic Land Corps (PLC) Hiring Authority: Served as a qualified youth on an appropriate conservation project completing a minimum of 640 hours of satisfactory service that included at least 120 hours through the PLC and received a certificate of non-competitive eligibility. Completed most recent Corps service, for which a certificate of non-competitive eligibility was issued, within the last 2 years. Appointment must be effected within the 2 year period.\r\n                                    \n\n\nEducation\n\nPROOF OF EDUCATION: All applicants who are using education or a combination of education and experience to qualify must submit copies of official or unofficial transcripts which include grades, credit hours earned, major(s), grade point average or class ranking, institution name, and student name.  If any required coursework is not easily recognizable on transcripts, or if you believe a portion of a particular course can be credited toward meeting an educational requirement, you must also provide a memorandum on letterhead from the institution's registrar, dean, or other appropriate official stating the percentage of the course that should be considered to meet the requirement and the equivalent number of units. Unofficial transcripts are acceptable; however, if you are selected for the position, you will be required to produce the original official transcripts.\n\nPASS/FAIL COURSES: If more than 10 percent of your undergraduate course work (credit hours) were taken on a pass/fail basis, your claim of superior academic achievement must be based upon class standing or membership in an honor society.\n\nGRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study.\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\nThe salary will be based upon duty station and locality pay once selected.  Locality tables may be found at: www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/2023/general-schedule?trk=public_post_comment-textPlease Note:  If selected, you may be placed at a regional office, field office, current duty station, or other DOI-owned or leased worksite at the discretion of management.  Additions questions regarding placement should be reserved for the interview process.  \n\nPCS INFORMATION: \n-No PCS entitlements authorized\n\nTelework:\nThis position is suitable for telework and may be allowed to telework with supervisory approval.\n\nAdditional Vacancies: One or more positions may be filled from applications received under this announcement in the advertised office or other U.S. Fish & Wildlife Service offices in the local commuting area.\n\nCareer Transition Assistance Plan (CTAP) or Interagency Career Transition Assistance Plan (ICTAP):Department of Interior (DOI) Career Transition Assistance Plan (CTAP) procedures apply in filling this vacancy. CTAP/ICTAP provides placement assistance to permanent Federal employees who are surplus, displaced, or involuntarily separated. Applicants claiming CTAP/ICTAP eligibility must submit a copy of their most recent performance appraisal, proof of eligibility, and most current SF-50 noting position, grade level, and duty location with their application. To be considered under CTAP/ICTAP, applicants must be well-qualified (i.e., meet the minimum qualification requirements, including any selective placement factors; education, and experience requirements), score at least 85 on the assessment questionnaire, and be able to perform the duties of the position upon entry.\nFor information on CTAP and ICTAP click here\nThe Land Management Workforce Flexibility Act (LMWFA),P.L. 114-47, allows certain individuals who currently or formerly were under time-limited competitive appointments at certain land management agencies to compete under merit promotion procedures.\nFor Eligibility Information click here: USAJOBS Help Center | Land Management\nReasonable Accommodation (RA) Requests: If you believe you have a disability (i.e., physical or mental), covered by the Rehabilitation Act of 1973 as amended and Americans with Disabilities Act 1990 as amended, that would interfere with completing the USA Hire Competency Based Assessments, you will be granted the opportunity to request a RA in your online application. Requests for RA for the USA Hire Competency Based Assessments and appropriate supporting documentation for RA must be received prior to starting the USA Hire Competency Based Assessments. Decisions on requests for RA are made on a case-by-case basis. If you meet the minimum qualifications of the position, after notification of the adjudication of your request, you will receive an email invitation to complete the USA Hire Competency Based Assessments. You must complete all assessments within 48 hours of receiving the URL to access the USA Hire Competency Based Assessments, if you received the link after the close of the announcement. To determine if you need a RA, please review the Procedures for Requesting a Reasonable Accommodation for Online Assessments here: https://help.usastaffing.gov/Apply/index.php?title=Reasonable_Accommodations_for_USA_Hire\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        As a Program Analyst your duties will include but are not limited to the following:\n\nWork with cross-programmatic team to transform business processes from paper-based to digital.\nUse a variety of communication tools to translate biological business and customer service needs into technical language to enable software development to meet the needs.\nUpdate and maintain a development backlog for a multifaceted project.\nAssist with customer support activities including training, software demonstrations, report generation, and testing of new solutions.\n\n\n"}, {"jobID": "689240500", "origin_search": "https://www.usajobs.gov/", "posted": "11/15/2022", "jobTitle": "Public Notice for Computer Scientist - Cybersecurity (Direct Hire)", "companyName": "FederalAviationAdministration", "link": "https://www.usajobs.gov/job/689240500", "jobLocation": {"remote": "not specified", "city": "MaybefilledinvariousFAAdutylocations", "state": "UnitedStates", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 57442, "max": 155403}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nUS Citizenship is required.\nSelective Service Registration is required for males born after 12/31/1959.\nThis position has a positive education requirement. Transcript(s) required.\nSuccessful completion of security investigation may be required.\nA one-year probationary period may be required.\nPlease Review Required Documents & Additional Information.\nPositions may be filled at any pay band level.\nDuty location may be negotiable upon request.\n\n\n Qualifications\n\nQualifications Reference: EMP-1.7 & OPM General Schedule Qualification Standards. To view the complete OPM qualification standard for the Group Coverage Qualification Standard for Computer Science Series, 1550, please refer to: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/computer-science-series-1550.BASIC REQUIREMENT: Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.Evaluation of Education: Applicants should have sufficient knowledge to understand the fundamental concepts and techniques of computer science. Courses designed to provide an introduction to computer science techniques and methodologies, to problems of system design, and other specialized fields are acceptable. Courses or experience in teaching elementary, business, or shop mathematics are not acceptable.In addition to the above basic requirements:FV-H. To qualify at this level, you must demonstrate possession of at least 1 year (52 weeks) of specialized experience equivalent to the FV-G (FG/GS-05-09) level. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position. Specialized Experience may include but is not limited to: experience in conducting threat, risk and vulnerability assessments of surface surveillance systems, weather and/or navigation systems and associated programs throughout the National Airspace System (NAS). Responsible for a variety of complex cybersecurity projects involving the modification and modernization of software/firmware systems etc.OR Education; Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree.FV-I. To qualify at this level, you must demonstrate possession of at least 1 year (52 weeks) of specialized experience equivalent to the FV-I (FG/GS 10-12) level. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position.. Specialized experience may include but is not limited to: experience initiating protective or corrective operations if system security problems are identified; experience with software design and development of complex automation systems; performing software maintenance and developing and maintaining computer software applications; and/or developing, executing and documenting test procedures on software systems.FV-J. To qualify at this level, you must demonstrate possession of at least 1 year (52 weeks) of specialized experience equivalent to the FV-I (FG/GS-13) level. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position. Specialized experience may include but is not limited to: responsibility for a variety of projects providing national level cybersecurity guidance and the use of software development tools, techniques, and sound testing methodologies; direct interaction with customers in requirements analysis, system implementation, and development/delivery of technical guidance for system users; and responsibility for independently analyzing/resolving a wide variety of user problems and system failures involving difficult functional and technical challenges in environment of integrated electronics systems requiring reliability and safety.FV-K. To qualify at this level, you must demonstrate possession of at least 1 year (52 weeks) of specialized experience equivalent to the FV-J (FG/GS-14) level. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position. Specialized experience may include but is not limited to: Experience using technology, experimental and modeling to identify safety issues and conducting risk assessments of air traffic systems, airspace redesigns, engineering and procedural changes; evaluating and assessing security risks threats, and vulnerability of airspace or air traffic systems and computer hardware performance; and skill conducting operational risk assessments of complex NAS computer architecture, communications and software systems.\n\n\n\nEducation\n\r\n                                            This position has a positive education requirement: Applicants must submit a copy of their college or university transcripts(s) and certificates by the closing date of announcement to verify qualifications. If selected, an official transcript will be required prior to appointment. You may upload these documents with your application in USAJOBS or fax it to fax number provided in the announcement (please include announcement number on each page).Failure to do so will result in loss of consideration.Schools must be accredited by an accrediting institution recognized by the U.S. Department of Education. Accreditation may be verified at the following website: www.ed.gov/admins/finaid/accred/index.html.Foreign education must be evaluated by a private professional organization specializing in interpretation of foreign education credentials or an accredited U.S. educational institution in terms of equivalence to a degree acquired at an American college or university. A copy of the evaluation results must be included, otherwise your foreign education will not be considered.\n\n\n\n\r\n                                            Preview Job Questionnaire\r\n                                        \n\r\n                                            Make sure your resume includes detailed information to support your qualifications and answers to the job questionnaire.\r\n                                        \n\n\nAdditional information\n\nWe may use this vacancy to fill other similar vacant positions.Position may be subject to a background investigation.A one-year probationary period may be required.The person selected for this position may be required to file a financial disclosure statement within 30 days of entry on duty. FAA policy limits certain outside employment and financial investments in aviation-related companies. www.faa.gov/jobs/working_here/financial_disclosure_requirementsThe U.S. Department of Transportation strives to ensure that equity, transparency, accountability, collaboration, and communication permeate all that we do for the betterment of the Department, the traveling public, and our nation. As such, DOT values a highly diverse workforce of persons who promote a culture of belonging by respecting the personal dignity and worth of each individual and fostering a positive environment where all feel safe and welcome. If these commitments coincide with your personal ideals and professional aspirations, please consider joining the DOT family.Leave Enhancement: FAA organizations may offer enhanced annual leave accrual to newly appointed or reappointed employees. In order to receive consideration for such a benefit, applicants' prior non-Federal service or active duty uniformed service must directly relate to the duties of the position to which appointed. Granting enhanced annual leave is at the sole discretion of the hiring organization, and granting such benefit is not an entitlement nor guaranteed to any newly hired employee.Applications will be accepted from any U.S. citizen. On-the-Spot will be used to fill this position. The 'Rule of Three', Veterans Preference and traditional rating and ranking of applicants does not apply to this vacancy.NOTES:1) Applicants must apply on-line to receive consideration for this vacancy announcement. Faxed, mailed or emailed applications cannot be accepted.2) Some, none, or all candidates may be interviewed.3) This position has a positive education requirement. Please see required documents.4) Please ensure you answer all questions and follow all instructions carefully. Errors or omissions may impact your rating or may result in you not being considered for the job.5) Please upload supporting documents into USAJOBS or 9-AMC-AHF-C400@faa.gov and reference the announcement number. To confirm receipt of documents, please email 9-AMC-AHF-C400@faa.gov.6) Positions may be filled at any pay band level.7) This Public Notice will serve as a resume repository – positions may or may not be filled from this announcement.8) Duty Location may be negotiable upon request.9) Bargaining and non-bargaining positions may be filled.This is not a bargaining unit position.Links to Important Information: Locality Pay , COLA \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThis series includes professional positions which primarily involve the application of, or research into, computer science methods and techniques that involve the security of computer operations in cyberspace. This encompasses the full range of threat reduction, vulnerability reduction, deterrence, international engagement, incident response, resiliency, and recovery activities for computer network operations, information assurance, securing agency information systems and communication infrastructure. Requirements of the work are professional competence in applying the theoretical foundations of computer science, including the security of computer system architecture, computer communications, system hardware/software and the representation and transformation of information structures.\n\n"}, {"jobID": "716176000", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "HUMAN RESOURCES SPECIALIST (MILITARY/INFO SYS)", "companyName": "AirMobilityCommand", "link": "https://www.usajobs.gov/job/716176000", "jobLocation": {"remote": "not specified", "city": "ScottAFB", "state": "IL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 70649, "max": 91840}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust complete initial online questionnaire and additional assessment(s)\nU.S. Citizenship is required\nMales must be registered for Selective Service, see www.sss.gov\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\nThis position is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nAll federal employees are required to have direct deposit.\nMay be subject to recall during other than normal duty hours.\nEmergency overtime may be required.\nThe employee may be required to travel on military and commercial aircraft to perform temporary duty.\nThe employee must be able to obtain and maintain a SECRET security clearance.\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Administrative and Management Positions, Human Resources Management, Series 0201.\n\nSPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-09, or equivalent in other pay systems. Examples of specialized experience includes knowledge of military personnel policies, processes, and specialty areas, and the ability to relate these knowledges to system processes/functions/capabilities; to provide positive assistance in solving workforce issues; to provide advice on organizational structure; to conduct planned, systematic studies to identify long- and short-term needs of serviced organizations; and to help plan organizational or procedural changes. General knowledge of the mission, objectives, terminology, and management practices of the activity, the agency, and the department lo recognize probable areas of interaction and overlap between legacy and proposed systems. Knowledge of a wide range of computer/automated data processing techniques, requirements, methods, sources, procedures, system software/hardware and systems development life cycles, analytical and diagnostic methods, programming, and systems analysis. Extensive knowledge of MilPDS, Structured Query Language (SQL), SAS, Oracle's Discoverer, and Microsoft Access; detailed knowledge of the work processes, data models, work rules, file/database design/structure and content, equipment, internal computer processes, applications, and utility programs, to advise on alternative approaches, to identify problems and plan and implement solutions, and to collaborate with design center personnel in effecting needed changes. In-depth knowledge of the capabilities and limitations or local and wide area networks, technical microcomputer/mainframe integration and communication/distributed processing techniques, systems software, utility programs, and programming aids to accomplish applications programming supporting network maintenance or to accomplish tasks associated with network/communications software projects. Ability to identify needed network system modifications and to relate all aspects of work to the network and user requirements. Knowledge of established security techniques and procedures to ensure network security requirements related lo physical, personnel, emanations, and information security are accomplished.\n\nOR\nEDUCATION: Successfully completed a Ph.D or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree or LL.M. in a field which demonstrates the knowledge, skills, and abilities necessary to perform the work of the position. NOTE: You must submit a copy of your transcripts.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. NOTE: You must submit a copy of your transcripts.\n\nFEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in­-grade requirements to be considered eligible. One year at the GS-09 level is required to meet the time-in-grade requirements for the GS-11 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of the principles, concepts, techniques, standards, processes, and guides of military personnel management and ability to relate to personnel data systems.\n2. Knowledge of automated data processing functions, techniques, and capabilities including Microsoft Windows operating system(s), relational database principles, Structured Query Language (SQL), SAS, microcomputer operation, and the network operating system.\n3. Ability to communicate effectively with others, both orally and in writing, in working out solutions to problems or questions relating to work.\n4. Ability to gather facts and use effective analytical and evaluative methods to accurately assesses information and makes sound decisions.\n5. Ability to develop improvements in and design new personnel work methods and procedures using automated systems.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\n\n********************ADDITIONAL INFORMATION FOR ACTIVE DUTY SERVICES MEMBERS********************\n\nACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following:\n\nName/Rank/Grade of Service Member\nBranch of Armed Forces\nDates of Active Service (Start and End Date(s)\nExpected Date of Discharge/Release from Active Duty\nTerminal leave start date (if applicable)\nExpected character of service (honorable or general) and type of separation (i.e. separation or retirement)\nMust be certified within 120 days of anticipated discharge \nSignature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander.\n\nNote: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nResponsible for all Network Management, Database, Server, and Systems Management for the AMC/A1 staff. Conducts all management actions relating to AMC/A1 hardware and software on Office Information Systems (OIS) workstations to include installing software, administering the ITAM inventory program, and troubleshooting user software/hardware problems.\nEnsures system availability performance monitoring, and proper operation of the AMC/A1 maintained servers including AMC/A1 Backup Utility of staff personnel's most important data.\nAdministers Military Personnel Data Systems (MilPDS) including all updates to the Air Force's Personnel Accounting Symbol (PAS) system for the AMC command.\nConstructs, executes, and trains staff personnel on the use of an array of query tools used by and for the AMC/A1 staff such as: Structured Query Language, SAS, Oracle's Discoverer, and Microsoft Access. Responsible for the development and maintenance of AMC/A1 personnel website.\n\n\n"}, {"jobID": "716644700", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "ELECTRICAL ENGINEER", "companyName": "UnitedStatesArmyFuturesCommand", "link": "https://www.usajobs.gov/job/716644700", "jobLocation": {"remote": "not specified", "city": "Warren", "state": "MI", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 91270, "max": 141089}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nMust be able to obtain and maintain a secret security clearance.\nThis position requires travel of up to 20% of the time.\nThis position requires a Financial Disclosure Statement, OGE-450.\nThis is a Defense Acquisition Workforce (AWF) position. The employee must meet the DoDI 5000.66 requirements applicable to the Career Category/Functional Area and the Career Level Certification assigned.\nFoundational Career Level Certification or Contracting Professional Certification must be met within 3 years.\nAdvanced Career Level Certification must be met within 4 years.\nPractitioner Career Level Certification must be met within 5 years.\nSubject to a three year trial period.\n\n\n Qualifications\n\nThis is a Direct Hire Authority (DHA) solicitation utilizing the DHA for STRL Mission Support to recruit and appoint qualified candidates to positions in the competitive service.\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nBasic Requirement for Electrical Engineer:\n\nA. Degree: Bachelor's degree (or higher degree) in engineering. To be acceptable, the program must: (1) lead to a bachelor's degree (or higher degree) in a school of engineering with at least one program accredited by the Accreditation Board for Engineering and Technology (ABET); OR (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.\n\nOR\n\nB. Combination of Education and Experience: College-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n\n1. Professional registration or licensure - Current registration as an Engineer Intern (EI), Engineer in Training (EIT), or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\n\n2. Written Test - Evidence of having successfully passed the Fundamentals of Engineering (FE) examination, or any other written test required for professional registration, by an engineering licensure board in the various States, the District of Columbia, Guam, or Puerto Rico.\n\n3. Specified academic courses - Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in A above. The courses must be fully acceptable toward meeting the requirements of an engineering program.\n\n4. Related curriculum - Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions.\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\n\nSpecialized Experience: One year of specialized experience which includes: (1) Conducting, monitoring, directing and coordinating research, design, development and engineering activities related to software for electronic systems on assigned technology areas; (2) Conducting specific research and trade off analysis, executing market surveys, investigating technology transfer/insertion opportunities, requirements and specification development, contract and test monitoring, failure analysis, cost reduction analysis, production engineering, configuration management, and technical field support; and (3) Reviewing and advising on preliminary design studies on new or improved items, components, structures, and major subsystems, as well as engineering changes which may affect military characteristics and monitors testing and modeling /simulation activities. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (DB-2/GS-11).\n\n\nMinimum Qualifications:\n\nMust be a US Citizen.\nMust have at least a Bachelor's Degree in an engineering field (must be a college, university, or other educational institution that has been accredited by one of the accrediting agencies or associations recognized by the U.S. Department of Education).\nMust have strong writing skills to generate scope of works, schedules, technical studies, and reports.\nMust thrive in a collaborative team environment.\nMust have proven ability to work independently with limited supervision.\nStrong attention to detail and ability to follow through on tasks.\nStrong understanding of Microsoft Office applications.\n\n\nPreferred Qualifications:\n\nBachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Mechanical Engineering, Mechatronics Engineering, Robotics Engineering or Safety Engineering.\n5+ years' experience in System/Software/Hardware development per MILSTD 882 and/or DO 178 and/or ISO 2626 preferred. \n3+ years' experience with unmanned and/or robotic systems.\nKnowledge and experience with engineering and integration of automotive or military ground vehicle safety. \nKnowledge of software safety test and automation to include scripting, debugging, execution, and analysis.\n\n\n\n\nEducation\n\nSome federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.\n\n***NOTE: TRANSCRIPTS ARE REQUIRED even if you are a current federal employee.***\n\nOnly degrees from an accredited college or university recognized by the Department of Education are acceptable to meet positive education requirements or to substitute education for experience. For additional information, please go to the Office of Personnel Management (OPM) and U.S. Department of Education websites at - http://www.opm.gov/qualifications and http://www.ed.gov/admins/finaid/accred/index.html\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nThis announcement uses the DHA for STRL Mission Support direct hire authority to recruit and appoint qualified candidates to certain positions in the competitive service.\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nThree year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nThis position requires you to submit a Confidential Financial Disclosure Report (OGE450) upon entry, and annually thereafter.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 16 - Engineers & Scientists (Non-Construction) position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nStudent Loan Repayment may be authorized.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nServes as senior electrical engineer responsible for conducting, monitoring, directing and coordinating research, design, development and engineering activities related to software for\nelectronic systems on assigned technology areas which are applied across vehicle system lines and/or on emerging or fielded components, subsystems and total systems.\nSenior expert in assuring that components, structures, software, electronics, electrical, power train, hydraulics, vulnerability/survivability elements comprising the system are compatible.\nSenior Engineer in the vehicle/system design are beneficial to system performance and performs and evaluates engineering studies, such as operational and functional characteristics pertaining to assigned systems/components.\nSeeking a self-driven professional to support development of System Safety Standards for unmanned ground vehicle and robotic systems.\nReview, Update, and Implement current system safety standard while ensuring it meets DO 178 and is aligned to meet MILSTD 882.\nReview safety standard requirements for unmanned ground vehicle and robotic system programs and ensure they meet Safety Standard Guidelines\nWork with the software safety architect to implement the software safety standards into the overarching Ground Vehicle architecture.\nEnsure software unit verification and test meet Safety Standard requirement in software-in-the-loop (SIL), hardware-in-the-loop (HIL), bench, and at system level integration.\nSupport Ground Vehicle Robotics Safety Council to create vital work products per DO 178 and collect required test evidence to build software safety cases.\nDevelopment of DO 178 products will be aligned to meet MILSTD 882.\nSupport the unmanned system safety to ensure DO 178 and MILSTD 882 compliance to the safety standards including safety auditing.\nSupport safety analysis at the system and software level.\nParticipate in the preparation of program/project plans, documentation, engineering data and models, project schedules, budgets, and milestones necessary for the overall planning and execution of the assigned programs.\nExpected to travel occasionally to various locations in support of related meetings and test events as testing, site assessments, and product/process audits and acceptance.\nLead or participate in multiple Integrated Product Teams/Working Groups simultaneously to work with all key stakeholders.\nUnderstanding of unmanned vehicles and robotic system performance attributes as well as supporting subsystems functionality that is provided by other subject matter experts for mobility, automotive, sensors, vehicle electronics, and autonomy.\nThe ability to research, define, develop, assess, document, and iterate innovative concepts for various internal and external customers.\n\n"}, {"jobID": "715490100", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "Information Technology Specialist (INFOSEC/SYSADMIN)", "companyName": "ArmyTank-AutomotiveandArmamentCommand(TACOM)", "link": "https://www.usajobs.gov/job/715490100", "jobLocation": {"remote": "not specified", "city": "Watervliet", "state": "NY", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 70857, "max": 92110}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nThis position has a data analytics requirement. The incumbent must meet all requirements for data analytics level 1 certification within 12 months of being placed on the position.\nThe incumbent must obtain and maintain, at a minimum, Secret level access with a T5 investigation enabling ADP IT-I access. Failure to do so may result in separation for the efficiency of the Federal Service.\nThis is an Information Assurance, critical-sensitive position of trust, which requires a T5 investigation.\nThe must have or obtain the required Information Assurance Certifications per DoD 8570.01-M Information Assurance Workforce Improvement Program within 6 months of appointment to the position.\nThe incumbent may be required to work overtime, overtime on an emergency basis and may be recalled to work.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nSpecialized and Other Experience: One year of specialized experience which includes (1) Conducting risk and vulnerability assessments of planned and/or installed information systems to identify vulnerabilities; (2) Develop and/or apply methods and procedures for system operations, system security and software and hardware installation; and (3) Implement and/or maintain new or modified hardware, operating systems and/or applications software. This definition of specialized experience is typical of work performed at the second lower grade/level position in the federal service (GS-09).\n\n\nThe specialized experience must include, or be supplemented by, information technology related experience (paid or unpaid experience and/or completion of specific, intensive training, as appropriate) which demonstrates each of the four competencies, as defined:\n\n(1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail. Examples of IT-related experience demonstrating this competency include: completing work independently that rarely requires editing or review by others.\n\n(2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Examples of IT-related experience demonstrating this competency include: resolving simple and routine problems, questions, or complaints and providing support and guidance to customers on non-routine issues; serving as a primary resource for customers, requesting assistance with complex issues when necessary; and participating in meetings and providing advice to customers in own area of expertise.\n\n(3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Examples of IT-related experience demonstrating this competency include: expressing facts and ideas in a clear, concise, convincing, and organized manner; clearly conveying moderately complex ideas, concepts, and information to customers; exhibiting active listening by demonstrating understanding of audience comments and/or questions.\n\n(4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. Examples of IT-related experience demonstrating this competency include: identifying and solving  problems by gathering and applying information from a variety of materials or sources that provide several alternatives; recognizing and taking action to address non-routine problems; soliciting feedback from multiple stakeholders to understand an issue or problem and accurately assess its root causes and potential solutions; seeking supervisory review where appropriate.\n\nOR\n\nEducation: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree from an accredited or pre-accredited institution in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management; or, three full years of graduate education from an accredited or pre-accredited institution that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems, or networks.\n\n\n\n\n\nEducation\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 34 - Information/Technology Management position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nImplements new system hardware and software and develops local documentation and operating procedures.\nMaintains software and hardware platforms by performing firmware and software updates.\nManage accounts, network rights and access to systems. Recommend and prepare operating policies and procedures for servers, system operations, and other software products.\nPerforms analysis to determine root causes of vulnerabilities and best methodology to remediate identified vulnerabilities.\nResponsible for assessing the security posture of classified and unclassified Information Systems (ISs) using a variety of automated tools.\nProvides instruction to functional area users on database and file accessing techniques, search strategies, processing and space utilization efficiencies, database security procedures, backup and program recovery techniques, and testing techniques.\nResponsible for keeping patch and remediation systems and tools up-to-date with the latest system releases and approved updates.\n\n"}, {"jobID": "715599000", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "Consult Tracking Coordinator (Office Automation)", "companyName": "MilitaryTreatmentFacilitiesunderDHA", "link": "https://www.usajobs.gov/job/715599000", "jobLocation": {"remote": "not specified", "city": "Monterey", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 51995, "max": 67589}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation  (NACI) (Tier 1).\nAppointment to this position is subject to a one-year probationary period unless the appointee has previously met the requirements as described in 5 CFR Part 315.\nThis position is subject to screening and update of required immunizations.\nThis position has a mandatory seasonal influenza vaccination requirement and is subject to annual vaccination.\n\n\n Qualifications\n\nWho May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected.\n30 Percent or More Disabled VeteransCurrent Civilian Employees of the Defense Health Agency (DHA)Current Permanent Department of Defense (DoD) Civilian EmployeeDomestic Defense Industrial Base/Major Range and Test Facilities Base Civilian Personnel WorkforceExecutive Order (E.O.) 12721Interagency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Appropriated Fund Instrumentality (NAFI)Non-Department of Defense (DoD) TransferOffice of Personnel Management (OPM) Interchange Agreement EligiblePeople with Disabilities, Schedule APriority Placement Program, DoD Military Spouse Preference (MSP) EligibleReinstatementVeterans Employment Opportunity Act (VEOA) of 1998Veterans Recruitment Appointment (VRA)\n\nIn order to qualify, you must meet the Experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nSpecialized Experience: One year of specialized experience which includes: performing clerical and administrative to support work as maintaining files; tracking and retrieval process progress reports and/or usage of office automation software i.e. Microsoft Office, electronic medical software programs, or other related programs to record, retrieve, correct, and merging provided data and reports. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS- 05 or above]).\n\nYou will be evaluated on the basis of your level of competency in the following areas:\nAttention to DetailHealth Systems Data ManagementInformation ManagementInterpersonal Skills\n\nThis position requires a typing proficiency of at least 40 words per minute (WPM).\n\nTime in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-05.\r\n                                    \n\n\nEducation\n\r\n                                            Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.\r\n                                        \n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959 must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nRecruitment or relocation incentives Not authorized.\nAdvanced In-hire: May be authorized.\nYou may claim military spouse preference (MSP).\nIf a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration.\nMultiple positions may be filled from this announcement. \nSalary includes applicable locality pay or Local Market Supplement.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nServe as the Tracking Coordinator for the Medical Treatment Facility.\nAssist and coordinate patient information needed for continued medical care not provided on initial referral.\nInterpret directives to implement processes described in the directives.\nAdvise the Medical Treatment Facility staff on referral tracking procedures.\nReview patient or staff complaints involving the referral tracking systems.\nUtilize office automation equipment, word processing software, and mission specific medical software to compile and type a variety of material including progress reports or memos.\nMaintain suspense report of referrals s through an automated system to completion.\n\n"}, {"jobID": "716266000", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "ENGINEERING TECHNICIAN", "companyName": "U.S.ArmyCorpsofEngineers", "link": "https://www.usajobs.gov/job/716266000", "jobLocation": {"remote": "not specified", "city": "Pittsburgh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 85582, "max": 111257}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nObtain Security + CE Certification within 24 months of coming on board and maintain for the duration of employment.\n\n\n Qualifications\n\nWho May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities.\n30 Percent or More Disabled VeteransCurrent Department of Army Civilian EmployeesCurrent Department of Defense (DOD) Civilian Employee (non-Army)Domestic Defense Industrial Base/Major Range and Test Facilities Base Civilian Personnel WorkforceInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Department of Defense (DoD) TransferOffice of Personnel Management (OPM) Interchange Agreement EligiblePriority Placement Program, DoD Military Spouse Preference (MSP) EligibleReinstatementVeterans Employment Opportunity Act (VEOA) of 1998\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nSpecialized Experience: One year of specialized experience which includes include use of an Engineering Data Management System\nproviding technical expertise to support the technical and functional aspects; facilitating the installation of software and troubleshooting of software/hardware issues on behalf of end users; and managing CAD/BIM/PW system hardware to include replacement and implementation, procurement process involving coordination with contracting. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11).\n\nSome federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.\n\nYou will be evaluated on the basis of your level of competency in the following areas:\nCustomer ServiceTechnical CompetenceTechnology Application\n\nTime in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11).\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect deposit of pay is required.\nTelework Eligibility: This position is eligible for Regular and Recurring Telework\nRelocation/ Student Loan Repayment incentive(s) MAY BE authorized to highly qualified candidate.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 18 position.\nYou may claim military spouse preference (MSP).\nIf a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nInteragency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nServes as the District's Engineering Data Management System (EDMS)Manager\nParticipates in the planning, budgeting, management, and execution of the District CAD Facility Account.\nFacilitate hardware replacement and implementation, including procurement process involving coordination with Contracting and IT departments.\nMaintains technical expertise in various CAD/BIM software.\nFacilitates software procurement, upgrades and implementation including procurement process involving coordination with Contracting and USACE IT.\nManages CAD/BIM/PW system hardware including, but not limited to, servers, storage, plotters, scanners, and 3D printers.\nServes as the Division's IT Representative to USACE IT.\n\n"}, {"jobID": "715017400", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "County Key Program Technician", "companyName": "FarmServiceAgency", "link": "https://www.usajobs.gov/job/715017400", "jobLocation": {"remote": "not specified", "city": "SaintPaul", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 51713, "max": 72938}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National.\nMales born after 12/31/1959 must be Selective Service Registered or Exempt.\nSubject to satisfactory adjudication of background investigation and/or fingerprint check.\nSuccessful completion of one year probationary period, unless previously served.\nDirect Deposit - Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution.\nSuccessfully pass the E-Verify employment verification check.  To learn more about E-Verify, including your rights and responsibilities, visit https://www.e-verify.gov/.\nMust be a high school graduate, or have a GED.\nMust be 18 years of age, or 17 years of age for high school graduates.\n\n\n Qualifications\n\r\n                                        Qualifications are in accordance with requirements in Handbook 27-PM.\n\nApplicants must meet all qualification and eligibility requirements by the closing date in the announcement, including the following specialized experience and/or education, as identified below:\n\nYou may start at the CO-08 level if you have the following qualifications:\n\nOne year of specialized experience directly related to the functions of the position to be filled equivalent to the CO-07 in FSA County service or GS-07 in FSA Federal service. Experience that shows your ability to perform progressively more complex, responsible, or difficult duties: and that shows your ability to learn the specific work of this position.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\n\nVeterans preference does not apply since this position is being advertised under Title 7 authorities.\nRelocation expenses are not authorized.\nWhen promotion potential is shown, the agency is not making a commitment and is not obligated to provide future promotions to you if you are selected. Future promotions will be dependent on your ability to perform the duties at a higher level, the continuing need for an employee assigned to the higher level, and administrative approval.\nThis is a Title 7, Non-Federal, Non-Civil Service position.\nThis announcement may be used to fill one or more vacancies.\nPersons with disabilities who require alternative means for communication of program information (Braille, large print, audiotape, etc.) should contact: USDAs TARGET Center at 202-720-2600 (voice and TDD).\nOptional - This position may be eligible to telework up to four (4) days per pay period, based upon the duties of the position. This position may also be eligible for flexible work arrangements in accordance with Department and Agency directives.\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement\n\tSafer Federal Workforce Task Force 2 pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAssists the State Office with projects as assigned.\nServe as a central resource for expert guidance, coordination, and assistance at the county office level with a district-wide or statewide collaboration for assigned programs.\nExplains procedures, program regulations and forms in the assigned programs to agency personnel.\nProvides guidance on web-based software applications to Program Technicians.\nDevelops and contributes creative ideas and solutions to program operations and/or issues resulting in added value to the State's products and services.\n\n"}, {"jobID": "680966100", "origin_search": "https://www.usajobs.gov/", "posted": "10/01/2022", "jobTitle": "Computer Engineer", "companyName": "AirForceCivilianCareerTraining", "link": "https://www.usajobs.gov/job/680966100", "jobLocation": {"remote": "not specified", "city": "ScottAFB", "state": "IL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 51209, "max": 82656}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nPlease read this Public Notice in its entirety prior to submitting your application for consideration.\nU.S. Citizenship is required\nMales must be registered for Selective Service, see www.sss.gov\nTotal salary varies depending on location of position\nPermanent Change of Station (PCS) expenses may or may not be authorized.  PCS expenses if authorized will be paid IAW JTR and Air Force Regulations\nRecruitment incentives may be authorized\nPosition may be subject to random drug testing\nEmployee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays\nShift work and emergency overtime may be required\nEmployee must maintain current certifications\nA security clearance may be required\nDisclosure of Political Appointments\nMobility - you may be required to relocate during or after completion of your training\nYou will be required to serve a one year probationary period\nSuccessful completion of all training and regulatory requirements as identified in the applicable training plan\nMust meet suitability for Federal employment\nGrade Point Average - 2.95 or higher out of a possible 4.0\nTotal salary varies depending on location of position\nPosition may be subject to random drug testing\n\n\n Qualifications\n\nBASIC REQUIREMENTS: A Bachelor's degree in operations research; or at least 24 semester hours in a combination of operations research, mathematics, probability, statistics, mathematical logic, science, or subject-matter courses requiring substantial competence in college-level mathematics or statistics. At least 3 of the 24 semester hours must have been in calculus.\n\nIn addition to meeting the basic entry qualification requirements, applicants must have specialized experience and/or directly related education. All educational requirements must be met not later than 31 Aug 2023.\n\nYou may qualify if you meet one of the following:\n\n1. GS-7: You must have completed or will complete a 4 year course of study leading to a bachelor's from an accredited institution AND must have documented Superior Academic Achievement (SAA) at the undergraduate level in one of the following:\na) Class standing-upper third of the graduating class based on completed courses in the college, university, or major subdivision;\nb) Grade Point Average 2.95 or higher out of a possible 4.0 as recorded on your official transcript or as computed based on 4 years of education or as computed based on courses completed during the final 2 years of curriculum; OR 3.45 or higher out of a possible 4.0 based on the average of the required courses completed in your major field or the required courses in your major field completed during the final 2 years of your curriculum.\nc) Election to membership in a national scholastic honor society (note: freshman honor society cannot be used to meet the requirements of this position). (Submit a copy of your transcript, a degree audit will not be accepted) If qualifying based on class standing or honor society membership, provide appropriate documentation.\nOR\nHave a combination of graduation education and experience when combined meets 100% of the qualifications requirements of this position.\n\n2. GS-9: You must have completed 2 years of progressively higher level graduate education leading to a master's degree or master's or equivalent graduate degree or one year of specialized experience equivalent to at least a GS-07 at the graduate level in one of the following:\na) Class Standing - upper third of the graduating class based on completed courses in the college, university, or major subdivision;\nb) Grade Point Average - 2.95 or higher out of a possible 4.0 as recorded on your official transcript or as computed based on 4 years of education or as computed based on courses completed during the final 2 years of curriculum; OR 3.45 or higher out of a possible 4.0 based on the average of the required courses completed in your major field or the required courses in your major field completed during the final 2 years of your curriculum. If more than 10 percent of total undergraduate credit hours are non-graded, i.e. pass/fail, CLEP, CCAF, DANTES, military credit, etc. you cannot qualify based on GPA;\nc) Election to membership in a national scholastic honor society (note: freshman honor society cannot be used to meet the requirements of this position). (If qualifying based on class standing or honor society membership, provide appropriate documentation). OR\nOR\nHave one full year (18 semester hours or the equivalent) of graduate level study, or possess a master's or higher degree, e.g., LL.B., J.D., LL.M., Ph.D., in a field that provided the knowledge, skills, and abilities to do the work of this position. Such fields include business administration, industrial management, industrial engineering, industrial psychology, public administration, political science, or government.(Submit copy of transcripts).OR\nOR\nHave a combination of graduate education as described above and the type of specialized experience as described above, which when combined would equate to 100%. (To compute, first determine your total qualifying graduate level education as a percentage of the graduate education required; then determine your total qualifying experience as a percentage of experience described above; add the two percentages. The total percentage must equal to at least 100%.) (Submit a copy of your transcript.)\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Not rated upon entry, your qualifications will be acquired and attained throughout the developmental program:\n\nProfessional knowledge of basic principles, concepts, and practices of operations research analysis to apply scientific methods and techniques to analyze systems, processes, and/or operational problems and procedures.\nKnowledge of mathematics and analysis to perform minor phases of a larger assignment and prepare reports, documentation, and correspondence to communicate factual and procedural information clearly.\nSkill in applying basic principles, concepts, and practices of the occupation sufficient to perform routine to difficult but well precedented assignments in operations research analysis.\nAbility to analyze, interpret, and apply operations research rules and procedures in a variety of situations and recommend solutions to senior analysts.\nAbility to analyze problems to identify significant factors, gather pertinent data, and recognize solutions.\nAbility to plan and organize work, and confer with co-workers effectively.\n\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education.\n\nThis position has an education requirement. You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. http://www2.ed.gov/admins/finaid/accred/index.html\n\nPlease submit copies of all transcripts to include transferred hours. Official copies are not required at the time of application, but if selected you will be required to provide official copies of all transcripts.***NOTE*** Degree Audits are not accepted.\n\nIf you qualify based on undergraduate education, but you have not graduated prior to applying for this position, you may be offered a position contingent upon your final grade point average or class ranking.\n\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nFor DHA Positions: These positions are being filled under Direct-Hire Authority for the Department of Defense for Post-Secondary Students and Recent Graduates. The Secretary of the Air Force has delegated authority by the Office of the Secretary of Defense to directly appoint qualified post-secondary students and recent graduates directly into competitive service positions; these positions may be professional or administrative occupations and are located Air Force-Wide. Positions may be filled as permanent or term with a full-time or part-time work schedule. Pay will vary by geographic location.\n\n*** The term \"Current post-secondary student\" means a person who is currently enrolled in, and in good academic standing at a full-time program at an institution of higher education; and is making satisfactory progress toward receipt of a baccalaureate or graduate degree; and has completed at least one year of the program.\n\n*** The term \"recent graduate\" means a person who was awarded a degree by an institution of higher education not more than two years before the date of the appointment of such person, except in the case of a person who has completed a period of obligated service in a uniform service of more than four years\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\nSelective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nTax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017 suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities, please visit: https://www.gsa.gov/cdnstatic/FTR%20Bulletin%2018_05%20Relocation%20Allowances_0.pdf\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nGS-07\n\nPerforms computer engineering tasks of limited scope and difficulty, which are screened by a higher-grade engineer.\nPerforms computer engineering work of limited scope and complexity in support of projects assigned to higher-grade\n\tengineers.\nUses engineering manuals, standard publications and technical material to obtain information and pertinent data to be\n\tused by higher level engineers, contractors and/or customers.\nKeeps abreast of emerging technologies and professional developments to maintain current in the field and for\n\tapplication to work assignments.\n\nGS-09\n\nPerforms computer engineering assignments which are routine and recurring.\nPerforms computer engineering work in support of projects assigned to higher grade engineers.\nParticipates in the collection and analysis of the information, data and standards used by the assigned organization to\n\tperform a variety of computer engineering assignments.\nUses engineering manuals, standard publications and technical material to obtain information and pertinent data to be\n\tused by higher level engineers, contractors and/or customers.\nKeeps abreast of emerging technologies and professional developments to maintain current in the field and for\n\tapplication to work assignments.\n\n\n"}]