[{"jobID": "716400900", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "AirMobilityCommand", "link": "https://www.usajobs.gov/job/716400900", "jobLocation": {"remote": "not specified", "city": "CharlestonAFB", "state": "SC", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 42022, "max": 54625}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAdvance in hire may be authorized if there is demonstrable proof provided on your resume.\nU.S. Citizenship is required\nMales must be registered for Selective Service, see www.sss.gov\nEmployee must be able to obtain and maintain a Secret security clearance.\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\nThis posn is subject to provisions of the DoD Priority Placement Program\nThe incumbent must have the ability to type a minimum of 40 WPM.\nDisclosure of Political Appointments\nAll federal employees are required to have direct deposit.\nMay be required to travel by military or commercial transportation to accomplish temporary duty.\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialize experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, for Clerical and Administrative Support Positions.\n\nSPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-05, or equivalent in other pay systems. Examples of specialized experience includes performing office automation support using multiple automated programs and software such as databases, spreadsheets, and graphics in support of the administrative and clerical work; knowledge of correct grammar, spelling, punctuation, capitalization, and format to prepare and edit written correspondence and reports; and knowledge of substantive programs of the organization as they relate to administrative and clerical support functions.\n\nFEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in­-grade requirements to be considered eligible. One year at the GS-05 level is required to meet the time-in-grade requirements for theGS-06 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of extensive rules, procedures, operations, functions, and commitments applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as screening calls and visitors, maintaining supervisor's calendar, preparing, reviewing and editing documents, locating and assembling information for various reports, maintaining files/records, and making and preparing travel arrangements.\n\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports, and transcribed material.\n\n3. Knowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\n\n4. Skill in typing; a qualified typist is required.\n\n5. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\n********************ADDITIONAL INFORMATION FOR ACTIVE DUTY SERVICES MEMBERS********************\n\nACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following:\n\nName/Rank/Grade of Service Member\nBranch of Armed Forces\nDates of Active Service (Start and End Date(s)\nExpected Date of Discharge/Release from Active Duty\nTerminal leave start date (if applicable)\nExpected character of service (honorable or general) and type of separation (i.e. separation or retirement)\nMust be certified within 120 days of anticipated discharge \nSignature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander.\n\nNote: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts. Composes and signs correspondence of a nontechnical nature in the supervisor's name or in own name as secretary.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office. Personally answers substantive nontechnical requests for information which can be provided based on information from records and files or personal knowledge of the organization.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Schedules appointments and meetings without prior approval in accordance with supervisor's policies and priorities, and coordinates with the supervisor as necessary.\nPerforms other administrative and clerical work in support of the office/organization. Establishes, updates, and maintains office procedures and records of various types that may be needed or will assist in the efficient operation of the office. Serves as liaison between supervisor and subordinate units.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}, {"jobID": "715175600", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "IT Specialist", "companyName": "DeputyAssistantSecretaryforInformationandTechnology", "link": "https://www.usajobs.gov/job/715175600", "jobLocation": {"remote": "not specified", "city": "LocationNegotiableAfterSelection", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 59319, "max": 92429}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. citizen to apply for this job.\nSelectees are subject to a background/suitability investigation.\nDesignated and/or random drug testing may be required\nSelectees may be required to serve a probationary period.\nSelective Service Registration is required for males born after 12/31/1959.\nA complete application package, i.e., Resume, Transcripts, etc., as required by the job announcement.\nSelected applicants will be required to complete an online onboarding process.\nParticipation in the Seasonal Influenza Prevention Program for VHA Health Care Personnel (HCP) is a requirement for all Department of Veterans Affairs HCP.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nMust be proficient in written and spoken English.\nPre-employment physical evaluation may be required.\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 09/29/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-11 position you must have served 52 weeks at the GS-9. For a GS-12 position you must have served 52 weeks at the GS-11.\n\nThe grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials.\n\nProvide a copy of your last or most recent SF-50, \"Notification of Personnel Action\" to indicate your current federal status. You must also submit additional SF-50(s) to clearly demonstrate one year time-in-grade as required in the announcement. If the most recent SF-50 has an effective within the past year, it may not clearly demonstrate that you possess one year time-in-grade. In this instance, you must provide an additional SF-50 that clearly demonstrates one year time-in-grade.\n\nTime-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nAND\n\nYou may qualify based on your education or experience as described below.\n\nA transcript must be submitted with your application if you are basing our qualifications on education.\n\nEducation: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\nGS-11 Education: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree;\n\nOR\n\nExperience - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate.\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nAND\n\nGS-11 Specialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-9 in the normal line of progression for the occupation in the organization. Specialized experience is defined as experience with Windows and/or Linux operating systems; experience providing remote support for an organization's users and IT/Medical systems.\n\nGS-12 Specialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-11 in the normal line of progression for the occupation in the organization. Specialized experience is defined as experience in management and oversight of VistA or VistA Imaging systems hardware and software; utilization of Windows Server and/or Linux operating systems; experience with VistA or VistA Imaging systems administration and/or database administration supporting critical systems in an enterprise environment.\n\nSuch experience is typically gained in the IT field or through the performance of work where the primary concern is IT.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nPer Office of Personnel Management General Schedule Qualification Policies, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not normally be part of the employee's position is creditable when documented by satisfactory evidence (e.g., a memorandum from the manager, human resources director, or official documentation such as SF-52, SF-50 documenting an official detail/assignments, or other comparable documentation). The documentation must indicate whether the employee performed the duties full time or, if part-time, the percentage of times the employee performed the additional duties.\n\nTo receive credit for experience in your resume that is not within the official series and grade level of your position, you must provide official documentation of such experience as indicated above.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment. For more information on these qualification standards, please visit OPM's web site at http://www.opm.gov/qualifications/standards/indexes/alph-ndx.asp. \r\n                                    \n\n\nEducation\n\nThere is no education substitute or requirement for the GS-12 level.\n\nPLEASE NOTE: Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications (particularly positions with a positive education requirement). Therefore, applicants must report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html. All education claimed by applicants will be verified by the appointing agency accordingly. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education.\r\n                                        \n\n\nAdditional information\n\nCOVID-19 Pandemic Expanded Telework Program - Due to COVID-19, VA is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement. Management officials will provide information about returning to the official, pre-pandemic worksite, when applicable. At that time, you may be eligible to request to continue to telework depending upon the terms of your organization's telework policy and the duties of the position.VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be well-qualified, applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors if applicable, and must be proficient in most of the requirements of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website which can be found at https://www.opm.gov/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThis is a bargaining unit position. \n\nPlease read this public notice in its entirety before submitting your application.\n\nVacancies may not presently exist but may become available at any point during the opening period of this vacancy announcement. We will not review applicant resumes until there is a request to fill a vacancy.\n\nYou are applying to a public notice to fill current and future vacancies. Please note, that there may or may not be actual/projected vacancies when you submit your application. Your resume and supporting documentation will be retained with other applicants and reviewed as vacancies occur. You will not receive a notice regarding your application's status other than the initial acknowledgment until a request is received to fill a position.\n\nThis announcement will remain open until September 29, 2023. The initial cut-off date is 4/3/2023 OR the point at which the first 100 applications are received, whichever comes first. Applications submitted after 4/3/2023 may not receive consideration.\n\nIn addition, due to the potential of a high volume of applicants, not all applicants may receive consideration.\n\nAfter the initial cut-off period, once additional requests to fill a vacancy are received, applications will be reviewed in increments of 100 based upon the date in which the application was received.\n\nNOTE: Submitting multiple applications will change the order in which your application is received and reviewed.\n\nWe will refer qualified applicants to the selecting official for consideration. The organization's hiring needs will determine the referral of additional applicants. Applicants will be notified about their application's status if referred or if we fill all vacancies.\n\nThis position is primarily aligned to the following NICE Cybersecurity Workforce Framework work roles:\n\nOPM Cyber Code 411- Tech Support Specialist\nOPM Cyber Code 421- Database Administrator\nOPM Cyber Code 451- System Administrator\n\nFor more information about these work roles, where they fit within the larger Cyber Workforce, and how they can support your unique career journey, please visit the Cyber Career Pathways tool on the National Initiative for Cybersecurity Careers and Studies website: https://niccs.us-cert.gov/workforce-development/cyber-career-pathways\n\nDo you want an opportunity to improve the lives of millions of Veterans? Use your technical expertise to develop and deliver cutting-edge digital capabilities to Veterans and those who care for them!\n\nWe're looking for experts in data science, software engineering, product design, product management, and user experience (UX) who are passionate about using their skills to ensure Veterans and their families receive seamless care and services to join our team of technologists. Our technologists help develop cutting-edge technology, advocate for Veteran needs, and ensure the Department of Veterans Affairs can provide Veterans home loans, G.I. Bill, healthcare, and other services. We are committed to building a team that reflects the communities we serve and strongly encourage people of color, LGBTQ+ individuals, women, minorities, people with disabilities, system-impacted people, Veterans, and people of all ages to apply.\n\nAbout Our Technologist Teams If selected, technologists will be appointed to serve in our Office of Chief Technology Officer (CTO) or Software Product Management (SPM).At OIT, you will be working on a wide variety of projects that are relevant to your specific area of expertise.\n\nMajor Duties:\n\nPlan and coordinate the design, development, testing, installation, and support of new and modified systems, including state-of-the-art security applications; hardware and software.\nMonitor, diagnose, troubleshoot, and resolve system malfunctions.\nUtilize experience, discretion, judgment and knowledge in the planning, execution, operation and maintenance of business critical technologies.\nCreate and maintain documentation on business systems technology to include configuration standards, as-built diagrams and historical and trending information.\nAssist in implementing new technologies to enhance health systems operation in support of critical applications and business\n\tprocesses.\n\nWork Schedule: Monday - Friday, 8:00 am - 4:30 pm\nCompressed/Flexible Schedule: Available\nDuty Location Status: Will work remotely from home\nPosition Description Title/PD#: IT Specialist/ PD10074A and PD10073A\nRelocation/Recruitment Incentives: Not Authorized\nFinancial Disclosure Report: Not Required\nPhysical Demands: The work is sedentary, but may involve intermediate periods of walking, bending, stooping, lifting, carrying, moving (up to 50 pounds) computer components and supplies, reaching, pulling, and working at a keyboard and monitor. This division provides 24 hour coverage throughout the calendar year. Incumbent is subject to shift work, rotating shifts and shift covering weekends and/or holidays. Subject to call back outside tour of duty.\r\n                                    \n"}, {"jobID": "715540000", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "AirCombatCommand", "link": "https://www.usajobs.gov/job/715540000", "jobLocation": {"remote": "not specified", "city": "MountainHomeAFB", "state": "ID", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 49009}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nMust be able and willing to submit to a background investigation to verify suitability for employment\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\nThis position is subject to provisions of the DoD Priority Placement Program\nThe incumbent must have the ability to type a minimum of 40 WPM\nEmployee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays\nDisclosure of Political Appointments\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions.\n\nSPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-04, or equivalent in other pay systems. Examples of specialized experience includes performing duties, priorities, commitments, policies, and program goals of the organization sufficient to perform non-routine assignments, such as independently noting and following-up on commitments made at meetings/conferences; advising others on preparing correspondence, requirements for various reports, and interpreting new instructions and procedures.\n\nOR\nEDUCATION: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college, or university. NOTE: You must submit a copy of your transcripts.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience as described above may be used to qualify for this position. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\nKnowledge of extensive rules, procedures, or operations applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as preparing and editing documents, maintaining files/records, making and preparing travel arrangements, and locating and assembling information for various reports.\nKnowledge of office functions to screen telephone calls and visitors, maintain supervisor's calendar, prepare and review correspondence and perform other administrative work of the organization.\nKnowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\nKnowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\nSkill in typing; a qualified typist is required. Ability to communicate effectively, both orally and in writing.\nAbility to locate, assemble, and compose information for routine reports, inquiries, and nontechnical correspondence. ability to plan, organization work, and meet deadlines.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11904018.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and some nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Performs other clerical and administrative work in support of the office/organization.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}, {"jobID": "714621500", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Supervisory IT Specialist", "companyName": "U.S.CensusBureau", "link": "https://www.usajobs.gov/job/714621500", "jobLocation": {"remote": "not specified", "city": "Suitland", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 132368, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nApplicants must meet all qualification requirements by the closing date of this announcement.\nU.S. Citizen\nSuitable for Federal employment.\nRegistered for Selective Service if applicable. (www.sss.gov)\nA one-year probationary period may be required.\nA supervisory probationary period may be required.\nThis is a NON-BARGAINING unit position.\nYou may be required to complete a financial disclosure (OGE-450).\n\n\n Qualifications\n\nThis vacancy is advertised under 2 different announcements. Please read the 'This Job Is Open To' section carefully to determine your eligibility. If you are not eligible under this announcement, please see 23-ADSD-11892990-ST-JLK, Supervisory IT Specialist, GS-2210-14.\n\nSpecialized Experience: For the GS-14, you must have one year of experience at a level of difficulty and responsibility equivalent to the GS-13 in the Federal service. Experience for this position includes: Assigning and reviewing employee work; leading teams in advanced systems software/hardware project efforts; evaluating software and systems to identify and solve problems; managing Federal resources and contractors; and managing budgets and contracts.\n\nIn addition to specialized experience, individuals must have IT-related experience demonstrating each of the four competencies listed below:\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer.\n\n\n\nAdditional information\n\nThe following links provide information on various hiring authorities that may enable you to apply through merit assignment procedures, or be eligible for a non-competitive appointment.\n\nVEOA (permanent positions)\n30% or more disabled\nPersons with Disabilities\nCTAP\nICTAP\n\nThe Department of Commerce provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the Human Resources Office. The decision on granting reasonable accommodation will be on a case-by-case basis. TTY users can contact the Human Resources Office via the Federal Relay Service, 1-800-877-8339.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nLeads task forces/project teams in advanced systems software/hardware project efforts to maximize efficient management and use of personnel, fiscal and contractual resources.\nSupports subject matter users by developing or designing applications for computers and/or in selecting or assisting in selecting computer equipment.\nResponds to and resolves problems with software, hardware, and systems management.\nIntegrates, schedules, and plans operational implementation of coverage measurement programs; monitors implementation and reports progress senior staff for related programs including headquarters data processing and software testing.\n\n"}, {"jobID": "716512400", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Aerospace Engineer, AST, Flight Systems Test", "companyName": "GoddardSpaceFlightCenter", "link": "https://www.usajobs.gov/job/716512400", "jobLocation": {"remote": "not specified", "city": "Greenbelt", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 132368, "max": 183500}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nThis position is open to U.S. citizens, nationals or those who owe allegiance to the U.S.\nPosition subject to pre-employment background investigation\nYou must meet qualifications requirements by the closing date of this announcement\nThis position may require a one year trial period.\n\n\n Qualifications\n\r\n                                        In addition to the Basic Education Requirement (in the Education section below), to qualify for this position you must meet the requirements below. Specialized experience is experience that has equipped you with the particular ability, skill, and knowledge to successfully perform the duties of this position and is typically in or related to this line of work.\n\nNASA utilizes OPM-approved qualification and rating requirements specific for Aerospace Technology (AST) positions which recognizes NASA's unique aerospace work. The specific qualifications and minimum education requirements are further described below and within the education section of the job announcement.\n\nTo qualify for GS-14, you must have one year of directly related specialized experience equivalent to the GS-13 level\n\nLeading engineering activities, such as system design, command planning, telemetry trending, procedure development, data verification and validation;\nCoordinating with team members to plan and execute engineering system tests and evaluate system requirements;\nSupporting anomaly investigations for technical engineering projects; \nSupporting data processing, utilizing data analysis software or tools. \n\nTo qualify for GS-15, you must have one year of directly related specialized experience equivalent to the GS-14 level\n\n\nPlanning and conducting Functional, Environmental (Vibration, EMI/EMC, Thermal Vacuum) and Pre-Ship Testing; \nProviding management, engineering and technical support to design, develop, test and operate flight systems with multiple interfaces;\nProviding programmatic leadership on engineering projects such as project plans, system test results, budget estimates or project schedule; \nCoordinating technical engineering integration and test campaigns.\n\n\n\nYour resume must include a clear and detailed narrative description, in your own words, of how you meet the required specialized experience. Experience statements copied from a position description, vacancy announcement or other reference material constitutes plagiarism and may result in disqualification and losing consideration for the job.\r\n                                    \n\n\nEducation\n\nBasic Education Requirement: You must have successfully completed a bachelor's degree with a major in one of the following:\na) Engineering from a college or university that has ABET accredited engineering programs\nb) Physical Science, Mathematics, Life Science or other field of Science\nc) Computer Science that included 30 semester hours or 45 quarter hours of course work in any combination of mathematics, statistics and computer science with at least half of those hours in mathematics and statistics courses that included differential and integral calculus.\n\nIf you did not complete a qualifying bachelor's degree, you may be eligible if you have obtained a graduate degree in an AST qualifying field, as listed above.\n\nDegrees in engineering technology are not considered qualifying for this position.\n\nEngineering degrees earned within the United States: Engineering degrees earned within the United States must be from a college or university that has at least one ABET accredited engineering program. To find out if a school has at least one ABET accredited program, please visit http://www.abet.org.\n\nEngineering degrees earned outside the United States: Engineering degrees earned outside the United States must be recognized by a Mutual Recognition Agreement (MRA), often known as accords. These are non-governmental agreements among organizations that accredit academic degree programs. MRAs recognize the substantial equivalence of mature accreditation systems and programs accredited by signatory organizations within their jurisdictions. For a listing of Signatories, please visit, https://www.abet.org/global-presence/mutual-recognition-agreements/is-your-program-recognized/.\n\nScience and other related degrees earned within the United States: Science and other related degrees must have been awarded from colleges or universities that are accredited by recognized accrediting organizations. For a list of schools that meet this criteria, go to http://ope.ed.gov/accreditation/.\n\nScience and other related degrees earned outside the United States: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs. These education credentials must be deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\n\nAll degrees must have been received in the year of, or any year subsequent to the original date of accreditation.\r\n                                        \n\n\nAdditional information\n\nAdditional selections may be made for similar positions across NASA within the local commuting area(s) of the location(s) identified in this announcement. By applying, you agree to have your application shared with interested selecting official(s) within NASA. CTAP/ICTAP will be cleared for any additional selection from this announcement.\n\nThis appointment is at the maximum of six years.\n\nUnder the NASA Flexibility Act of 2004, individuals appointed under this announcement may be converted to permanent appointment, either non-competitively or through internal agency competitive placement procedures. Conversion is not guaranteed, and is contingent on the employee meeting all legal requirements. For more information, see: Term Appointments | NASA\n\nCurrent Federal civilian employees may apply for this position. If selected, a break in service of at least 4 calendar days may be required prior to appointment to this position.\n\nIf you have special priority selection rights under the Agency Career Transition Assistance Program (CTAP) or the Interagency Career Transition Assistance Program (ICTAP), you must:\n- Indicate your eligibility when applying for a position. The questionnaire asks you to identify your ICTAP/CTAP eligibility.\n-Be well qualified for this position to receive consideration. Candidates rated in the 'Best Qualified' category are considered well-qualified. Please see 'How You Will Be Evaluated' for more information.\n-Submit proof that you meet the requirements for CTAP/ICTAP as indicated in 'Required Documents'\n\nFor additional information about CTAP/ICTAP eligibility, click here - https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/#ictap.\n\nThis is a bargaining unit position. If additional selections are made, those positions may or may not be in a bargaining unit. To learn more about bargaining units at NASA please click here NASA Unions (Bargaining Units) | NASA.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nDuties described below are at the full-performance level. Duties assigned at a lower grade level will be of more limited scope, performed with less independence and limited complexity; duties will be commensurate with the grade of selected employee.\nDefines, formulates, directs and coordinates development of a comprehensive integration and test plan which establishes the order in which spacecraft or instruments are integrated, tested and calibrated on the structure prior to flight testing.\nManages teams of engineers in the technical assessment and implementation of plans and procedures for flight system integration.\nDevelops the overall integration and test activity flow and schedule for NASA spacecraft and instrument modules and associated ground support hardware/software.\nDevelops and recommends tests to evaluate electrical/electronic system performance, interweaving these tests with requirements influencing the mechanical, electrical and thermal systems.\nPlans and manages the environmental test program for spacecraft, payloads and instruments.\nReviews command files and corresponding telemetry responses to be utilized during the complete ground test flow of observatory and instruments.\nDevelops, reviews, and provides recommendations for proposed project requirements, expected results, and budgetary estimates.\nServes as technical liaison between the Contractor and the Contracting Officer by monitoring the Contractor's performance and delivery of the final products and/or services under the contract.\n\n"}, {"jobID": "715472600", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "AirForceGlobalStrikeCommand", "link": "https://www.usajobs.gov/job/715472600", "jobLocation": {"remote": "not specified", "city": "WhitemanAFB", "state": "MO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 38240, "max": 49716}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nThis position is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nAll federal employees are required to have direct deposit\nThe incumbent must have the ability to type a minimum of 40 WPM\nMust be able to obtain and maintain a Secret Clearance\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions.\n\nSPECIALIZED EXPERIENCE:  Applicants must have at least one (1) year of specialized experience at the next lower grade GS-04, or equivalent in other pay systems. Examples of specialized experience includes performing duties, priorities, commitments, policies, and program goals of the organization sufficient to perform nonroutine assignments, such as independently noting and following-up on commitments made at meetings, advising others on preparing correspondence, requirements for various reports, and interpreting new instructions and procedures or locating and summarizing information from files and documents that requires recognizing which information is or is not relevant to the problem at hand.\n\nOR\nEDUCATION: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college, or university. NOTE: You must submit a copy of your transcripts.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience as described above may be used to qualify for this position. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of extensive rules, procedures, operations, functions, and commitments applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as screening calls and visitors, maintaining supervisor's calendar, preparing, reviewing and editing documents, locating and assembling information for various reports, maintaining files/records, and making and preparing travel arrangements.\n\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\n\n3. Knowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\n\n4. Skill in typing; a qualified typist is required.\n\n5. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11903560.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and some nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Schedules appointments and meetings without prior approval in accordance with supervisor's policies and priorities, and coordinates with the supervisor as necessary.\nPerforms other clerical and administrative work in support of the office/organization. Establishes, updates, and maintains office records of various types that may be needed or will assist in the efficient operation of the office.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}, {"jobID": "715595400", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/715595400", "jobLocation": {"remote": "not specified", "city": "LovesPark", "state": "IL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 49009}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nThis position is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nAdvance in hire may be authorized if there is demonstrable proof provided on your resume\nLeave accrual may be authorized upon request\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\nThe incumbent must have the ability to type a minimum of 40 WPM\nTravel by military and/or commercial aircraft or vehicle is required when providing assistance to subordinate units or in the performance of temporary duty assignments\nMust be able and willing to submit to a background investigation to verify suitability for employment\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions.\n\nSPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-04, or equivalent in other pay systems. Examples of specialized experience includes performing duties, priorities, commitments, policies, and program goals of the organization sufficient to perform non-routine assignments, such as independently noting and following-up on commitments made at meetings/conferences; shifting clerical staff in subordinate offices to respond to fluctuating workloads; advising other clerical staff on preparing correspondence, requirements for various reports, and interpreting new instructions and procedures; or locating and summarizing information from files and documents that requires recognizing which information is or is not relevant to the problem at hand.\n\nOR EDUCATION: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college, or university. NOTE: You must submit a copy of your transcripts. \n\nOR COMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience as described above may be used to qualify for this position. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of extensive rules, procedures, operations, functions, and commitments applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as screening calls and visitors, maintaining supervisor's calendar, preparing, reviewing and editing documents, locating and assembling information for various reports, maintaining files/records, and making and preparing travel arrangements.\n\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports. Knowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\n\n3. Skill in typing; a qualified typist is required.  Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11904410.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and some nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Schedules appointments and meetings without prior approval in accordance with supervisor's policies and priorities, and coordinates with the supervisor as necessary.\nPerforms other clerical and administrative work in support of the office/organization. Establishes, updates, and maintains office records of various types that may be needed or will assist in the efficient operation of the office.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}, {"jobID": "716095100", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/716095100", "jobLocation": {"remote": "not specified", "city": "Jacksonville", "state": "FL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 49009}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nMust obtain and maintain the appropriate security clearance. Must be able and willing to submit to an extensive background investigation to verify suitability for employment (SF 85).\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID.\nThis position is subject to provisions of the DoD Priority Placement Program\nThe incumbent must have the ability to type a minimum of 40 WPM.\nTravel by military and/or commercial aircraft or vehicle is required when providing assistance to subordinate units or in the performance of temporary duty assignments.\nDisclosure of Political Appointments\nAdvance in hire may be authorized if there is demonstrable proof provided on your resume\nLeave accrual may be authorized upon request\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions.\n\nSPECIALIZED EXPERIENCE:  Applicants must have at least one (1) year of specialized experience at the next lower grade GS-04, or equivalent in other pay systems. Examples of specialized experience includes knowledge of duties, priorities, commitments, policies, and program goals of the organization sufficient to perform nonroutine assignments, such as independently noting and following-up on commitments made at meetings/conferences; advising others on preparing correspondence, requirements for various reports, and interpreting new instructions and procedures; or locating and summarizing information from files and documents that requires recognizing which information is or is not relevant to the problem at hand.\n\nOR\nEDUCATION: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college, or university. NOTE: You must submit a copy of your transcripts. \n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience as described above may be used to qualify for this position. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of extensive rules, procedures, operations, functions, and commitments applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as screening calls and visitors, maintaining supervisor's calendar, preparing, reviewing and editing documents, locating and assembling information for various reports, maintaining files/records, and making and preparing travel arrangements.\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\n3. Knowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\n4. Skill in typing; a qualified typist is required.\n5. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11906948.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and some nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Schedules appointments and meetings without prior approval in accordance with supervisor's policies and priorities, and coordinates with the supervisor as necessary.\nPerforms other clerical and administrative work in support of the office/organization. Establishes, updates, and maintains office records of various types that may be needed or will assist in the efficient operation of the office.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}, {"jobID": "699927500", "origin_search": "https://www.usajobs.gov/", "posted": "01/13/2023", "jobTitle": "Information Technology Specialist (Customer Service)", "companyName": "DeputyAssistantSecretaryforInformationandTechnology", "link": "https://www.usajobs.gov/job/699927500", "jobLocation": {"remote": "not specified", "city": "Newington", "state": "CT", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 71099, "max": 92429}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. citizen to apply for this job.\nSelectees are subject to a background/suitability investigation.\nDesignated and/or random drug testing may be required\nSelectees may be required to serve a probationary period.\nSelective Service Registration is required for males born after 12/31/1959.\nA complete application package, i.e., Resume, Transcripts, etc., as required by the job announcement.\nSelected applicants will be required to complete an online onboarding process.\nParticipation in the Seasonal Influenza Prevention Program for VHA Health Care Personnel (HCP) is a requirement for all Department of Veterans Affairs HCP.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nMust be proficient in written and spoken English.\nPre-employment physical evaluation may be required.\nPre-employment reference checks are required\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 12/29/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-12 position you must have served 52 weeks at the GS-11. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade.\n\nYou may qualify based on your experience as described below:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-11 in the normal line of progression for the occupation in the organization. Specialized experience is defined as resolving customer related software and hardware problems in accordance with established policies and procedures; overseeing Help Desk activities; configuring devices and software applications following established procedures.\n\nYou will be rated on the following Competencies for this position:\nAttention to DetailCustomer ServiceOperations SupportProblem Solving\n\nSuch experience is typically gained in the IT field or through the performance of work where the primary concern is IT.\n\nPer Office of Personnel Management policy, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not usually be part of the employee's position is creditable; however, the experience is considered creditable when documented by satisfactory evidence, such as a signed memorandum from the employee's supervisor or an SF-50 or SF-52 documenting an official detail or other official assignments. The documentation must indicate whether the employee performed the duties full time or, if part-time, the percentage of times the employee performed the additional duties. The employee should be able to locate this documentation in their official personnel record. To receive credit for experience in your resume that is not within the official series and grade level of your official position, you must provide a copy of the appropriate and official documentation of such experience as indicated above.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: The work is sedentary, but may involve intermediate periods of walking, bending, stooping, lifting, carrying, regularly moving (up to 50 pounds) computer components and supplies, reaching, pulling, and working at a keyboard and monitor.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            There is no educational substitution at this grade level.\r\n                                        \n\n\nAdditional information\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        This is a bargaining unit position\n\nPlease read this public notice in its entirety prior to submitting your application.\n\nVacancies may not presently exist but may become available at any point during the opening period of this vacancy announcement. We will not review applicant resumes until there is a request to fill a vacancy.\n\nYou are applying to a public notice to fill current and future vacancies. Please note, there may or may not be actual/projected vacancies when you submit your application. Your resume and any supporting documentation will be retained with other applicants and reviewed as vacancies occur. You will not receive a notice regarding your application's status other than the initial acknowledgment until a request is received to fill a position.\n\nThis announcement will remain open until December 29, 2023. The cut-off date is January 20, 2023 OR the point at which the first 100 applications are received, whichever comes first.  Due to the potential of a high volume of applicants, not all applicants may receive consideration.\n\nAfter the initial cut-off period, once a request to fill a vacancy is received, applications will be reviewed in increments of 100 applications in date order. Note: Submitting multiple applications will change the order in which your application is reviewed.\n\nWe will refer qualified applicants to the selecting official for consideration. The organization's hiring need will determine the referral of additional applicants. Applicants will be notified about their application's status if referred or if we fill all vacancies.\n\nMajor Duties:\n\nDiagnosing and/or resolving problems in response to customer reported incidents via trouble tickets: escalating problems to the Lead or Supervisory IT Specialist as appropriate.\nManages the movement and installation of IT equipment to assure coordination of IT support and customer service.\nConfiguring devices and software applications following established procedures.\nSubmitting recommendations to improve the efficient use of the system and responding to special requests for system data.\nProviding account management support, client connectivity support and client application support for various devices.\n\nWork Schedule: This Position supports 24/7 operations throughout the calendar year. Work is typically performed on the day shift; however, candidate may be subject to overtime work, shift work, and/or work on rotating shifts to include evenings, weekends, and holidays.  Subject to call back outside tour of duty.\nCompressed/Flexible:  Not Available\nPosition Description/PD#: Information Technology Specialist (Customer Service)/PD17041A\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "716131300", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/716131300", "jobLocation": {"remote": "not specified", "city": "Clearfield", "state": "UT", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 49009}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nMust obtain and maintain the appropriate security clearance. Must be able and willing to submit to an extensive background investigation to verify suitability for employment (SF 85).\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\nThis position is subject to provisions of the DoD Priority Placement Program\nThe incumbent must have the ability to type a minimum of 40 WPM.\nTravel by military and/or commercial aircraft or vehicle is required when providing assistance to subordinate units or in the performance of temporary duty assignments.\nDisclosure of Political Appointments\nAdvance in hire may be authorized if there is demonstrable proof provided on your resume\nLeave accrual may be authorized upon request\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support positions.\n\nSPECIALIZED EXPERIENCE:  Applicants must have at least one (1) year of specialized experience at the next lower grade GS-04, or equivalent in other pay systems. Examples of specialized experience includes knowledge of duties, priorities, commitments, policies, and program goals of the organization sufficient to perform nonroutine assignments, such as independently noting and following-up on commitments made at meetings/conferences; advising others on preparing correspondence, requirements for various reports, and interpreting new instructions and procedures; or locating and summarizing information from files and documents that requires recognizing which information is or is not relevant to the problem at hand.\n\nOR\nEDUCATION: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college, or university. NOTE: You must submit a copy of your transcripts.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience as described above may be used to qualify for this position. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of extensive rules, procedures, operations, functions, and commitments applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as screening calls and visitors, maintaining supervisor's calendar, preparing, reviewing and editing documents, locating and assembling information for various reports, maintaining files/records, and making and preparing travel arrangements.\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\n3. Knowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\n4. Skill in typing; a qualified typist is required.\n5. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11907586.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and some nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts.\nReviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Schedules appointments and meetings without prior approval in accordance with supervisor's policies and priorities, and coordinates with the supervisor as necessary.\nPerforms other clerical and administrative work in support of the office/organization. Establishes, updates, and maintains office records of various types that may be needed or will assist in the efficient operation of the office.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}, {"jobID": "716014300", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "Program Specialist (User Role Assignment Coordinator - URAC)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/716014300", "jobLocation": {"remote": "not specified", "city": "Chicago", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 76990, "max": 100084}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, facility applicants must meet all requirements within 30 days of the closing date of this announcement. Non-facility applicants must meet all requirements by the closing date of this announcement, 04/18/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-11 position you must have served 52 weeks at the GS-09. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade.\n\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: At least one (1) year of specialized experience equivalent to at least the GS-9 level. Specialized experience is defined as experience that equipped the applicant with the particular knowledge, skills and abilities to perform successfully the duties of the position and that is typically in or related to the work of the position to be filled. Specialized experience for this position consists of: Operates a computer system, performs data processing support and service functions requiring knowledge of data processing sequences, procedures, user, programming languages, computer requirements and techniques associated with the development and design of systems; utilization of and training in the VA Electronic Health Record system; experience in health care service administration, continuous quality improvement, data analysis, healthcare principles, theories, and practices, budgeting, planning, administration, and support functions; experience in conducting detailed analyses of complex functions and work processes; skill in written communication and interpersonal skills in presenting recommendations; and experience in networking and building relationships with clinical and non-clinical staff and providing user support when implementing and testing new and existing systems and programs.\nOR\nSubstitution of Education for Experience GS-11: Ph.D. or equivalent doctoral degree, or 3 full years of progressively higher-level graduate education leading to such a degree, obtained in an accredited college or university, or LL.M., if related, may be substituted for specialized experience to qualify for this grade 11, Program Specialist - User Role Assignment Coordinator position. Ph.D. or equivalent doctoral degree must demonstrate the knowledge, skills, and abilities necessary to do the work of the position. One year of full-time graduate education is considered to be the number of credit hours that the school attended has determined to represent one (1) year of full-time study If that number cannot be obtained from the school, 18 semester hours will be considered an academic year of graduate study. Part-time graduate education is creditable in accordance with its relationship to a year of full-time study at the school attended. NOTE: TRANSCRIPTS REQUIRED.\nOR\nCombination Education and Experience GS-11: Equivalent combinations of successfully completed graduate education and specialized experience directly related to the work of the Program Specialist Health Systems Specialist - User Role Assignment Coordinator position may be used to meet the experience requirements for this position. For example, nine (9) months of appropriate specialized experience equivalent to GS-09 (75 percent of the experience requirement for GS-11) and 2 years of successfully completed graduate level education. (50 percent of the required education, i.e., the applicant has year of graduate study beyond that required for the GS-09), would exceed the total requirement and be qualified for the GS-11 position. NOTE: Only education in excess of 2 full years of progressively higher-level graduate education may be used to qualify at the grade 11 level. TRANSCRIPTS REQUIRED.\n\nYou will be rated on the following Competencies for this position:Clinical InformaticsCommunicationsHealth Information ExchangeQuality Management\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: The work is mostly sedentary, but there is a moderate amount of walking involved, with infrequent bending, lifting, and stooping. Incumbent's vision should be sufficient to read from computer screen for prolonged periods without excessive fatigue. Input data into the computer requires prolonged use of keyboard. The regular and recurring work of the position involves sitting at a desk, conference, meetings, etc., and occasional visits to activity work sites. Occasionally incumbent is required to carry light objects, such as files, mail, supplies, and papers. nd manuals are required. Stamina and concentration to meet crucial deadlines is required. Keen hearing and distinct speech are essential due to the extensive use of the telephone as a means of communication. May be a certain amount of mental strain due to time constraints and frequent reviews and surveys.\n\nWorking Environment: The work is generally performed in an office or meeting room setting. Work areas are adequately lighted, heated, and ventilated. Occasional travel may be required.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The Program Specialist - User Role Assignment (URA) coordinator supports the coordination of assignment and end user roles to include training for doctors and students in their respective service in computer software and equipment within Electronic Health Record Modernization (EHRM) at their local facility.\nUser Role Access\n\nEnsures that correct user roles are gathered to be assigned to end users by supervisors, representative super users, or department heads.\nCommunicates process and understanding of access levels.\nCommunicates with supervisors to discuss specific process and role changes that may differ from their current roles and tool sets.\nResponds to required data calls and provides the user role access data to EHRM in compliance with deployment.\nUpdates the user role access page as needed throughout deployment phase.\nAfter user role access completion, tracks clinic end user role access changes through the approved user role access sustainment tracking process.\nReceives and reviews approved user account requests to validate that the supervisor performed the correct role assignments.\nReviews user account request to verify that the background investigation for each end user sufficiently supports the Automated Data Processing (ADP) level required.\nProvides continued maintenance for user role access as needed.\n\nTraining and Coordinates Use of Clinical Applications\n\nDevelops and implements plans for use of clinical information systems.\nAssists managers on using information system to provide data on various management problems and options.\nAnalyzes results and recommends corrections to improve system operations or data consistency.\nPerforms administrative oversight of clerical or technical program support work for a variety of technical and/or program specialists in support of the line programs of an agency.\nOperates a computer system, performs data processing support and service functions requiring knowledge of data processing sequences, procedures, user, programming languages, computer requirements and techniques associated with the development and design of systems.\nCoordinates installation and/or implementation of automated data processing systems to support administrative functions.\nProvides basic computer training on data processing procedures and practices in the organization.\n\nReporting and Troubleshooting Computer Problems\n\nCollects and analyzes/reports trended data sets and makes recommendations to assist in the allocation of resources.\nParticipates in sustainment and continuous improvement plans.\nPresents continuous improvement recommendations to supervisor/service chief, including analyzes and interpreting data.\nResearches and prepares comprehensive reports.\nParticipates in discussions, meetings, conferences, and conference calls with agency administrators.\nPerforms work related to the resolution of user hardware, software applications and/or system problems.\nTroubleshoots a wide range of user application problems.\nServes as point of contact for incoming nd outgoing calls regarding hardware and software application, questions, and problems.\nPoint of contact for questions regarding service software packages and assist with basic needs such as mapping printers, replacing toner, and using software.\nActs as an OI&T and Health Technology Management liaison.\nInitiates equipment turn in and coordinates media sanitization.\n\nPerforms other duties as assigned.\n\nWork Schedule: Monday through Friday, 8:00 AM to 4:30 PM.\nTelework:  Not Available\nVirtual: This is not a virtual position.\nPosition Description/PD#: Program Specialist (User Role Assignment Coordinator - URAC)/PD230950\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "654919100", "origin_search": "https://www.usajobs.gov/", "posted": "05/17/2022", "jobTitle": "Engineering Technician (Civil)", "companyName": "U.S.ArmyCorpsofEngineers", "link": "https://www.usajobs.gov/job/654919100", "jobLocation": {"remote": "not specified", "city": "SaintLouis", "state": "MO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 33221, "max": 87667}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\n\n\n Qualifications\n\nWho May Apply: US Citizens\n\nIn order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nMinimum Qualifications GS-04:\n\nGeneral and/or Specialized Experience: Six months of general experience (1) in any type of work that demonstrates the applicant's ability to perform the work of the position, or (2) experience that provided a familiarity with drafting, surveying construction estimating, physical science, mathematics, aerospace, architecture, and/or electrical or mechanical systems. AND six months of specialized experience equivalent to the GS-03 grade level in the Federal service which includes utilizing Computer Aided Design (CAD) Software to perform routine assignments and collecting data from equipment, instruments, and/or program applications.\n\nOR\n\nEducation: Two years of education above the high school level.\n\nOR\n\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide your semester hours of education by 60. Add the two percentages.\n\nMinimum Qualifications GS-05:\n\nSpecialized Experience: One year of specialized experience which includes utilizing Computer Aided Design (CAD) Software to perform routine assignments and compiling information from technical documents, design reports, plans, and/or specifications. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-04).\n\nOR\n\nEducation: Four year course of study leading to a bachelor's degree.\n\nOR\n\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide your semester hours of education beyond two years (total semester hours minus 60) by 60. Add the two percentages.\n\nMinimum Qualifications GS-06:\n\nSpecialized Experience: One year of specialized experience which includes utilizing Computer Aided Design (CAD) Software to develop preliminary plans, models, and/or details for engineering/construction projects; and identifying errors, inconsistencies, and/or deficiencies within the design process. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-05).\n\nOR\n\nEducation: A half year (i.e., 9 semester hours) of graduate level education in a field directly related to the work of the position.\n\nOR\n\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) by 9. Add the two percentages.\n\n\nMinimum Qualifications GS-07: \n\nSpecialized Experience: One year of specialized experience which includes utilizing Computer Aided Design (CAD) Software to develop draft plans, models, and/or details from templates for engineering/construction projects; and computing quantities of earthwork and/or construction materials. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-06).\n\nOR\n\nEducation: One full year of graduate level education in a field directly related to the work of the position.\n\nOR\n\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) by 18. Add the two percentages.\n\nMinimum Qualifications GS-08: Specialized Experience: One year of specialized experience which includes utilizing Computer Aided Design (CAD) Software to develop final plans, models, and details from templates for engineering/construction projects; and computing quantities of earthwork and/or construction materials. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-07).\n\nOR\n\nEducation: One and a half years of graduate level education in a field directly related to the work of the position.\n\nOR\n\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total semester hours minus 18) by 9. Add the two percentages.\n\nMinimum Qualifications GS-09: Specialized Experience: One year of specialized experience which includes utilizing Computer Aided Design (CAD) Software to develop final plans, models, and details for engineering/construction projects; and computing quantities of earthwork and/or construction materials. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-08).\n\nOR\n\nEducation: Two full years of graduate level education (i.e., 36 semester hours) in a field directly related to the work of the position.\n\nOR\n\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total semester hours minus 18) by 9. Add the two percentages.\n\nMinimum Qualifications GS-10: \n\nSpecialized Experience: One year of specialized experience which includes utilizing advanced Computer Aided Design (CAD) design software and applications to develop final plans, models, and details for engineering/construction projects; finalizing plans, models, and/or details for engineering/construction projects to ensure compliance with CAD standards; and developing CAD resources such as Macros, Feature Definitions, Drawing Seeds, etc.. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-09).\n\n\n\n\nEducation\n\n\nMinimum Qualifications GS-11: \n\nSpecialized Experience: One year of specialized experience which includes at least three of the following statements: reviewing final plans, models, and/or details for engineering/construction projects to ensure compliance with CAD standards; producing quantity take offs for complex engineering projects; developing CAD resources such as Macros, Feature Definitions, Drawing Seeds, etc.; and/or providing instruction and/or recommending corrective actions for technical problems associated with the CAD software. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-10).\n\nSome federal jobs allow you to substitute your education for the required experience in order to qualify. For this job at the GS-10/11 grade level, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.\n\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\nAdditional information\n\n\nThe initial cut-off for consideration is 31-MAY-2022. Applications received after this date will be given consideration as determined by management.\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect Deposit of Pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) #18 - Engineers and Scientists position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nInteragency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPrepares preliminary and final input to planning reports, design documentation reports, contract drawings, as-built drawings and O and M manuals.\nDetailed drawings of intricate and complex civil and/or structural items including earthwork, riprap revetments reinforced concrete, hydraulic steel structures, wood construction, gravity structures, operating machinery layouts and the like.\nIndependently develops new design layouts from instructions, or uses previously approved designs of similar type project as guide, modifying them to meet specific conditions.\nIs responsible for identifying technical, structural, and civil/site design errors, and fixt problems inherent in the assignments.\nMakes modifications to features relating to various navigation, flood control, ecosystem restoration, and operations, where overall design is responsibility of engineers.\nServes on design teams, responsible for coordinating with design engineers and other staff on design layouts, design procedures, structural details and resolution of any problems encountered in the field or during design.\nPerforms technical and drafting design assignments using CADD and engineering design software packages.\nUnderstands and utilizes more advanced CADD applications and modeling features, as well as surveying, civil engineering, and District/USACE drafting standards to complete and/or analyze designs, drawings, and quantity estimates.\n\n"}, {"jobID": "714927500", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Program Applications Specialist", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/714927500", "jobLocation": {"remote": "not specified", "city": "Richmond", "state": "VA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 72001, "max": 93599}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/06/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS 11 position you must have served 52 weeks at the GS 9. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade. Note: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade level to qualify for the GS-11 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to with providing policy development and implementation; develops and utilizes monitoring tools, and provides for the implementation of Business Office programs through on-site education and training; summarizes, and analyzes the data collected and develops reports which reflect the scope of activities and identifies trends and opportunities for improvement.\n\nYou may qualify based on your experience and/or education as described below: You will be rated on the following Competencies for this position:\nAttention to DetailTechnical Competence\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            There is no educational substitution at this grade level.\n\nA transcript must be submitted with your application if you are basing all or part of your qualifications on education. \n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThe incumbent is responsible for the coordination, planning, implementation, and training for service and facility staff in business and functional areas for various information technology VISTA packages, e.g. ADT (Admissions/Discharge/Transfer); Scheduling; PTF (Patient Treatment File); Medical Record Tracking; Fee Basis; PDX (Patient Data Exchange); HINQ (Hospital Inquiry); AMIEII/IBBA (Intranet BDN/BIRLS Access); IB (Integrated Billing); AMIE (Automated Medical Information Exchange); Discharge Summary; PCE (Patient Care Encounter and Visit Tracking); ACRP (Ambulatory Care Reporting); Network Health Exchange; AICS (Automated Information Collection System); KLF Menu; CIRN (Clinical Information Resource Network);TIU (Text Integration Utilities); EWL (Electronic Wait List), Beneficiary Travel V 1.0; Incomplete Record Tracking V 1.0; Claims Manager - VISTA; EAS (Electronic Application Systems) V1.0; and additional business office programs as added. The applications control critical applications, which are used primarily by all care lines/services, i.e. Gains and Losses Sheet, Scheduling, Fee Basis, Admissions/Discharge/Transfer, AMIE, HINQ, PTF and a multitude of other software modules\nIncumbent researches problems that impact the quality and efficiency of Business Office operations. He/She discusses problem areas with personnel concerned to identify and implement remedial action to be taken. He/She follows through to ensure program requirements are met and planned actions have been initiated and are effective. The incumbent recommends and implements amendment of business office programs where necessary.\n\nThe incumbent identifies system inefficiencies and develops studies or data collection techniques related to specific identified problems. He/She coordinates with other staff to identify information needs and develops data collection methods and report formats to meet those needs. The Program Application Specialist organizes, compiles, summarizes, and analyzes the data collected and develops reports which reflect the scope of activities and identifies trends and opportunities for improvement.\n\nIncumbent designs and develops dissemination and training materials, local standard operating procedure (SOP) manuals, develops and utilizes monitoring tools, and provides for the implementation of Business Office programs through on-site education and training\n\nTelework: VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\nVirtual: This is not a virtual position.\nPosition Description/PD#: Program Applications Specialist/PD028170\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "716453500", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "Information Management Officer", "companyName": "ArmyInstallationManagementCommand", "link": "https://www.usajobs.gov/job/716453500", "jobLocation": {"remote": "not specified", "city": "FortMeade", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 122459}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nThis position requires the incumbent be able to obtain and maintain a determination of eligibility for a Secret security clearance or access for the duration of employment. A background investigation and credit check are required.\nThis position has a Temporary Duty (TDY) or business travel requirement of 10% of the time.\nThis position requires the employee to obtain and maintain the appropriate training and earn the required certifications for this position as outlined in DoD 8570.01-M, Information Assurance Workforce Improvement Program, dated 19 December 2005.\nAppointment to this position is subject to a one year probationary period unless the appointee has previously met the requirements as described in 5 CFR Part 315. While probationary the incumbent can be terminated with limited appeal rights.\n\n\n Qualifications\n\nWho May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities.\nCurrent Department of Army Civilian EmployeesCurrent Department of Defense (DOD) Civilian Employee (non-Army)Defense Civilian Intelligence Personnel System (DCIPS) Interchange AgreementInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Appropriated Fund Instrumentality (NAFI)Non-Department of Defense (DoD) TransferOffice of Personnel Management (OPM) Interchange Agreement EligiblePostal Service/Peace Corps and Other Unique AuthoritiesPriority Placement Program, DoD Military Spouse Preference (MSP) EligibleVeterans Employment Opportunity Act (VEOA) of 1998\n\n\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\n\nTo qualify based on your experience, your resume must describe at least one year of experience which prepared you to do the work in this job. Specialized experience is defined as experience providing and coordinating customer support services for organization IT hardware and software systems, interfaces and networks. Function as Contract Officer Representative for Portable Electronic Devices and Multi-Functional copying devices. Manage requirements, procurement, and sustainment of IT resources.  This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11).\n\nYou will be evaluated on the basis of your level of competency in the following areas:\nAttention to DetailCustomer ServiceTechnical Competence\n\nTime in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11).\n\n\nSeparated Military Members: Resumes will be accepted from members of the Armed Forces who indicate in their applications that they are available for appointment within 120 days of the closing date of this announcement. Military members may be appointed while on terminal/transitional leave, before the effective date of their military retirement/separation.\nMilitary Retirees: Within the DoD (Department of Defense), including non-appropriated fund positions, the appointment of retired military members within 180 days immediately following the retirement date to a civilian position is subject to the provisions of 5 United States Code 3326 or 5 U.S.C. 5305.\n\n\n\n\nEducation\n\r\n                                            Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone -- no substitution of education for experience is permitted. \n\n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nOne year trial/probationary period may be required.\nDirect deposit of pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 34 - Information Technology / Cyber Management position.\nYou may claim military spouse preference (MSP).\nIf a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nWhen you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information.\nPermanent Change of Station (PCS) allowances may be authorized, subject to the provisions of the Joint Travel Regulations and an agency determination that a PCS move is in the Government Interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\nAdvanced in-hire MAY be authorized.\nRelocation incentive MAY be authorized.\nRecruitment incentive MAY be authorized.\nAdvanced leave accrual MAY be authorized.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nIdentifies information technology (IT) requirements for the Garrison.\nFunctions as Contract Officer Representative (COR) for automation systems (e.g. Portable Electronic Devices, Multi-Functional copying Devices) utilized by the Fort Meade USAG.\nProvides management oversight, advice, planning, and funding coordination for IT requirements for the Garrison.\n\n"}, {"jobID": "715341300", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Program Applications Specialist (HAS Trainer)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/715341300", "jobLocation": {"remote": "not specified", "city": "LongBeach", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 66134, "max": 104016}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/14/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-09 position you must have served 52 weeks at the GS-07 and for GS-11 position you must have served 52 weeks at the GS-09. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade. Note: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nYou may qualify at the GS-09 grade level based on your experience and/or education as described below:\n\nSpecialized Experience: (In addition to meeting Time and Grade) You must have one year of specialized experience equivalent to at least the next lower grade GS-07 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: prepare reports, performance improvement, data processing, VISTA, software programs, program operational decisions, VA policies, VA directives, PI, MS software, business metadata. (must be in resume) OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have. Master's or equivalent graduate degree or 2 full years of progressively higher-level graduate education leading to such a degree or LL.B. or J.D., OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an combination of specialized experience and education beyond\n\nYou may qualify at the GS-11 grade level based on your experience and/or education as described below:\n\n\nSpecialized Experience: (In addition to meeting Time and Grade) You must have one year of specialized experience equivalent to at least the next lower grade GS-09 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to:prepare reports, performance improvement, data processing, VISTA, software programs, program operational decisions, VA policies, VA directives, PI, MS software, business metadata (must be in resume) OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have. Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree or LL.M., if related, OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an combination of specialized experience and education beyond.\n\nYou will be rated on the following Competencies for this position:\nAdministration and ManagementCommunicationHuman Capital ManagementTechnical Competence\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: Regular and recurring work is mostly sedentary involving sitting at a desk, although the position requires the ability to move from one geographic location of the facility to another. The incumbent works with a computer screen and keyboard. Some physical effort such as standing, walking, bending or prolonged sitting may be required. The incumbent may be exposed to walking to outlying areas. The work places no special physical demands on the employee\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nPerform the following duties and responsibilities:\n\nAssemble ongoing data collection and performs analysis to determine optimal organizational performance.\nDevelop initiatives which will enable the facility to provide quality health care to its population while operating in a more effective and efficient manner.\nPerform a continuing evaluation and analysis to assess program effectiveness and to identify areas requiring management attention.\nDevelop training i.e. materials, local standard operating procedure (SOP) manuals, develops, utilizes monitoring tools, and/or provides for the implementation of Business Office programs through on-site education and training.\nAssure system inefficiencies and develops studies or data collection techniques related to specific identified problems.\nCollaborate with other staff to identify information needs and/or develops data collection methods and report formats to meet those needs.\nOperate compile, summarize, and analyze the data collected and/or develop reports which reflect the scope of activities and identifies trends and opportunities for improvement.\nRepresent the coordination, planning, implementation, training for service and/or facility staff in business and functional areas for various information technology VISTA packages.\nReports as the functional \"expert\" for matters relating Consult Tracking Manager, VetText, Audiocare, and PCI\nProvide training on other service packages, such as Pharmacy, Radiology, Laboratory, and Health Summary, as they relate to the business office process.\nImplement business contingency plans for system failure specifically addressing manual system backup plans addressing how day to day business will be conducted for long and short-term outages.\nAnalyze utilization trend data on a monthly/quarterly basis to verify the accuracy of the data, identify problem areas, provide objective assessments, prioritize identified problems, analyze variances and/or recommend appropriate actions.\n\nPerform the following duties and responsibilities: Promotion Potential: The selectee may be promoted to the full performance level without further competition when all regulatory, qualification, and performance requirements are met. Selection at a lower grade level does not guarantee promotion to the full performance level.\n\nWork Schedule: Full-Time, Monday - Friday 8:00am - 4:30pm\nTelework: Ad Hoc\nVirtual: This is not a virtual position.\nPosition Description/PD#: Program Applications Specialist (HAS Trainer)/PD11940A\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "689474400", "origin_search": "https://www.usajobs.gov/", "posted": "11/15/2022", "jobTitle": "IT Specialist (Systems Administration)", "companyName": "SmithsonianInstitution", "link": "https://www.usajobs.gov/job/689474400", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 77738, "max": 121128}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nPre and Post background Investigation.\nMay be required to serve a one year probationary period.\nDirect deposit/electronic funds transfer required for salary payment.\n\n\r\n                                        For qualification standards please check: http://www.opm.gov/qualifications/Standards/IORs/gs2200/2210-altA.asp\n\n\n Qualifications\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below.1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail.2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.AND\nCandidates for grade 11 must possess minimum of one year of specialized experience equivalent to at least the grade 9 in the normal line of progression for this occupation. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position such as: Linux OS management, NFS, LDAP, and Shell Programming\nCandidates for grade 12 must possess minimum of one year of specialized experience equivalent to at least the grade 11 in the normal line of progression for this occupation. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position such as:Linux Security, Google Compute Engine Virtual Machines, Qemu KVM, and Perl, Python\norEducation:All academic degrees and coursework must be from accredited or pre-accredited institutions. Undergraduate or Graduate Education: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.Grade 11: Ph.D. or equivalent doctoral degreeor 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree. \n\n\n\nAdditional information\n\nThe Smithsonian does not pay relocation expensesThe Smithsonian embraces diversity and equal employment opportunity.\nFor the latest information on the COVID-19 vaccination requirements and its impact on your application, click on Smithsonian Institution’s Frequently Asked Questions\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nWorks with the supervisor to provide Linux operating system management for CF servers and distributed computing systems. Participates in the planning and implementation of the CF Linux System management policy and the purchase of CF servers and client workstations. Deploys hardware and software, develops procedures, and writes software or scripts as necessary to operate and manage a distributed workstation environment. Keeps up-to-date with Linux hardware, operating systems, software, and security developments and trends. Investigates, tests, and documents operating system changes. Ensures user applications and software will work correctly under new operating systems prior to installation.\nWorks with CF Linux staff to maintain system software on the servers and distributed client workstations. This includes initial configuration of the hardware and installation of OS on client workstations, integration of the workstations with CF servers, configuration of client software services on the workstation as needed, and monitoring of the client workstation. Works with the other CF Linux system managers to install system software, provide system software support consultation, and install application software.\nManages user system accounts. Helps scientific and technical staff with operating system questions and problems. Helps staff use scientific applications, editors, command line applications, and web browsers.\nFulfills other system management, contract management, and programming duties and responsibilities as requested by the Supervisor of the CF Linux Support Group.\n\nIn addition to the duties listed above, duties at the grade 12 may include but are not limited to:\n\nDevelops system security plans and procedures for Linux Monitors the system for security breaches. Monitors the network news services for announcements of potential security problems. Take appropriate action to avoid a security breach. In the event of a security breach, has plans for restoring uncompromised system software. Coordinates with CF and SI Security personnel.\nMaintains system software on the CF Linux servers and distributed client workstations. This includes initial configuration of the hardware and installation of OS on client workstations, integration of the workstations with CF servers, configuration of client software services on the workstation as needed, and monitoring of the client workstation. Works with the other CF Linux system managers to install system software, provide system software support consultation, and install application software.\n\n\n"}, {"jobID": "715595500", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "IT SPECIALIST (APPSW)", "companyName": "Commander,NavalInformationWarfareSystemsCommand(NAVWARSYSCOM)", "link": "https://www.usajobs.gov/job/715595500", "jobLocation": {"remote": "not specified", "city": "Arlington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 132368, "max": 18350014171267}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nGenerally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade.  Time-in-grade requirements must be met by the closing date of this announcement.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA). Certification in the Acquisition Functional Area and category assigned to the position is required within established category timeframes.\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\r\n                                        Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-13 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: Responsible for all aspects of the applications software project management lifecycle in the execution of assigned projects to include the initiating, planning, executing monitoring and controlling, and closeout process groups.\n\nYour experience must reflect skill in the following areas: attention to detail, customer service, oral communication, and problem solving.\n1.   Attention to Detail - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Monitor technical accomplishments in terms of cost, schedule, technical performance and risk.\n2.  Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.  IT-related experience demonstrating this competency include:  Evaluate, select, and advise on the application of systems development tool sets to document, maintain, and enhance the systems planning process.\n3.  Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Coordinate with key personnel to develop and monitor decision analysis of network applications.\n4.  Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Coordinate technology integration across the program to develop and maintain a comprehensive program master schedule based upon program activities and discrete work plans.\n\nAdditional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\n\n\n\n\nAdditional information\n\nThis position is in the Personnel Demonstration Project under authority of Title VII of the Civil Service Reform Act of 1978.\n\nThe pay schedule and pay band for all Demonstration Project Professional Positions will be DP-1/2/3/4.\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher. ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will provide leadership and management of application development for Commercial-off-the-Shelf (COTS) and Software as a Service applications that include new solutions and enhancement of existing systems.\nYou will collaborate with key IT stakeholders to plan, prioritize and schedule applications development and enhancements.\nYou will support the Technical Director with the overall initiation and integration of project management across the program.\nYou will execute software development life cycle methodologies, including experience in participating or leading Agile project teams.\nYou will manage projects to the authority, goals, and constraints delegated and seeks approval as required from management, project sponsor, and stakeholders.\nYou will oversee and assure software services ad systems quality and functionality as part of the program's innovation/modernization/retention strategy .\n\n"}, {"jobID": "716356400", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Health Technician (Dietetic)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/716356400", "jobLocation": {"remote": "not specified", "city": "BayPines", "state": "FL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 49009}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/21/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-05 position you must have served 52 weeks at the GS-04. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade. Note: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nThis position has an Individual Occupational Requirement (IOR)\n\nSpecialized Experience: Positions in this series range widely in type and include support duties to medical or health personnel such as audiologists, speech pathologists, medical officers, and optometrists. Therefore, technician experience is experience that required application of the knowledge, methods, and techniques of the position to be filled.\n\nOR,\n\n\nEducation and Training: Successful completion of a full 4-year course of study leading to a bachelor's degree, with major study or at least 24 semester hours in subjects directly related to the position.\n\nAND\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-04 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: Experience where you applied knowledge of quantity food service operations, proper nutrition, food items and appropriate quantities; working with clients, patients, and/or, customers to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; use computers, software applications, databases, and automated systems to accomplish work. OR,\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have successfully completed a full four (4) year course of study leading to a bachelor's degree, with a major study or at least 24 semester hours in subjects directly related to this position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited business or technical school, junior college, college or university for which high school graduation or the equivalent is the normal prerequisite. NOTE: Transcripts (unofficial or official) must be submitted with your application materials. Education cannot be credited without documentation. OR,\nCombination: Applicants may also combine education and experience to qualify at this level. You must have a combination of specialized experience and successfully completed post-high school education (beyond the second year). pleted post-high school education (beyond the second year) and specialized experience, as listed above. The education portion must include courses directly related to the work of the position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited college or university. NOTE: Transcripts (unofficial or official) must be submitted with your application materials. Education cannot be credited without documentation. .\n\nYou will be rated on the following Competencies for this position:\nCommunicationComputer SkillsCustomer ServiceFood Service\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements:The work requires walking, standing, bending, lifting and carrying of light items, such as food trays, instruction materials, books, and manuals. NCC Associate functions require long periods of sitting and moving about in an office environment, including repetitive motion activities of the hands and fingers for extensive keyboard and computer mouse use, and office tasks such as answering and holding a telephone phone, and writing. The work may require walking indoors, outdoors or to and from other areas of the medical center. It may be necessary to lift and/or push equipment. Incumbent is subject to periods continuous standing, sitting, walking and frequent stooping, reaching, pushing, pulling, and bending. Frequently lifts or moves objects weighing up to 20 pounds and pushing loaded carts of trays and/or nourishments.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nReceiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nUtilizes a computer to enter and retrieve basic information.\nUtilizes dietetic software programs to retrieve diet orders, recipes, and menu and inventory data.\nPrints and assembles packets.\nProperly operates telephone equipment to transfer or place calls on hold.\nProvides professional and courteous customer service.\nTriages telephone calls from customers and/or patients.\nProvides basic-level education and information on therapeutic diets to patients, guests, and nursing staff.\nResolves customer and/or patient complaints.\nUtilizes knowledge of basic and routine modified diets to identify problems in diet order information and take appropriate corrective action.\nCorrectly interprets diet activity and patient information, to ensure appropriate food items on meals trays.\n\n\nWork Schedule: Variable and contingent on Service needs. Operational hours are from 5:00 AM to 8:00 PM, 7 days a week and include weekends and Holidays.\nVirtual: This is not a virtual position.\nPosition Description/PD#: Health Technician (Dietetic)/PD99855-S\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nPCS Appraised Value Offer (AVO): Not Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "715704500", "origin_search": "https://www.usajobs.gov/", "posted": "10/24/2022", "jobTitle": "Health Technician (Dietetic)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/715704500", "jobLocation": {"remote": "not specified", "city": "Buffalo", "state": "NY", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 39265, "max": 51050}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. citizen to apply for this job\nSubject to a background/suitability investigation\nDesignated and/or random drug testing may be required\nMay serve a probationary period\nSelective Service Registration is required for males born after 12/31/1959\nA complete application package; Resume, Transcripts, etc.\nSelected applicants will be required to complete an online onboarding process\n\n\n Qualifications\n\nTo qualify for this position, applicants must meet all requirements by the closing date of this announcement.\n\nGS-05 grade level: One year of specialized experience (equivalent to the GS-04 grade level in the federal service); experience that equipped the applicant with the particular knowledge, skills and abilities (KSA's) and other characteristics to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled, in the normal line of progression for the occupation in the organization. Specialized experience includes:\n\nSPECIALIZED EXPERIENCE:\n\nAt least one (1) full year of specialized experience equivalent to at least the next lower grade level (GS-4) in the Federal Service that has given you the particular knowledge, skills and abilities required to successfully perform the duties of a Health Technician (Dietetics).Qualifying specialized experience includes: Experience where you applied knowledge of quantity food service operations, proper nutrition, food items and appropriate quantities; working with clients, patients, and/or, customers to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; use computers, software applications, databases, and automated systems to accomplish work.\n\n~OR~\n\nEDUCATION:\n\nSuccessful completion of a full four (4) year course of study leading to a bachelor's degree, with a major study or at least 24 semester hours in subjects directly related to this position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited business or technical school, junior college, college or university for which high school graduation or the equivalent is the normal prerequisite.\n\nTo calculate, first identify the percentage of required education you have earned (when substituting, you cannot use the first 60 semester hours that you earned). Then identify the percentage of required experience you possess. Add the two percentages. The total percentage must equal at least 100 percent to qualify at the GS-05.For example, an applicant who has 9 semester hours of graduate level education (i.e. 50% of graduate education required) and 6 months of creditable specialized experience (i.e. 50% of the required experience) would equal 100% of the required experience for the position A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNOTE: Transcripts (unofficial or official) must be submitted with your application materials. Education cannot be credited without documentation.\n\n~OR~\n\nCOMBINATION:\n\nEquivalent combination of successfully completed post-high school education (beyond the second year) and specialized experience, as listed above. The education portion must include courses directly related to the work of the position (i.e. nutrition, dietary therapy, food and nutrition science, food service systems management, etc.). This education must have been obtained in an accredited college or university.\n\nNOTE: Transcripts (unofficial or official) must be submitted with your application materials. Education cannot be credited without documentation.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education.\r\n                                        \n\n\nAdditional information\n\nCOVID-19 Pandemic Expanded Telework Program - Due to COVID-19, VA is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement. Management officials will provide information about returning to the official, pre-pandemic worksite, when applicable. At that time, you may be eligible to request to continue to telework depending upon the terms of your organization's telework policy and the duties of the position.\n\nVA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\n\nThe following will be communicated to applicants for VA employment in a testing designated position and will also be included in all VA vacancy announcements for such positions: All applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drugs use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be well-qualified, applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors if applicable, and must be proficient in most of the requirements of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website which can be found at https://www.opm.gov/.\n\nReceiving Service Credit for Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. VA may offer newly-appointed Federal employee's credit for their job-related non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        The Nutrition Communication Center Associate (NCCA) is a team member located in the Nutrition Communication Center (NCC). The incumbent is responsible for handling patient meal service orders, answers patient calls using phone system and may enter meal orders into a COTS Dietetics Software system. The incumbent will interact with veterans, dietitians, nursing staff, and other medical center employees and will provide excellent customer service and be professional and courteous at all times. This position will collaborate with Dietitians regarding Food/Drug Interactions, notifying clinical staff of potential issues with meal service and delivery and taking direction regarding management. The NCC is staffed to receive patient meal orders and preferences meal and nourishment requests from nursing, clinical staff, and other members of the interdisciplinary team during all hours of meal operations, seven days a week.\n\nCustomer Service (50%)The incumbent will practice excellent customer service skills in all forms of communication, either via telephone, e-mail or in-person. The Incumbent will maintain the vital connection between Nutrition Communication Center (NCC) Associates, Registered Dietitian, higher graded dietetic technicians, food service staff, Nursing, patients and guests. NCC Associate will follow local-facility policies and standard procedures for patient feeding, including but not limited to missed patient meals, late tray requests, patient meal ordering, and adherence to prescribed therapeutic diet.\n\nAdministrative (40%)NCC Associate is responsible for the independent and accurate transfer of information received via COTS Dietetics software. Diet activity and patient information must be interpreted correctly to ensure meals trays contain food items adhering to patient requests and preferences, and current therapeutic diet order. The NCC Associate may adjust diet patterns and menu selections to assure the correct meal tickets are generated, as per local facility policy and procedures.\n\nSupport (10%) NCC Associate may be required to adjust menu selections, nourishments as needed for diet changes and NPO orders, as determined by local policies and procedures. Incumbent will use a computer terminal to record, retrieve and print recipes, menus, and inventory reports; to disseminate this information to various work units in the kitchen. Identifies errors in diet information transmitted from inpatient units to Nutrition and Food Services and takes any necessary corrective actions. Prints and assembles tray ticket packets in accordance with local facility policies and procedures and verifies correctness of the information and adherence to prescribed diet NCC Associate may discuss with diet technician and/or dietitian any adjustments of tray tickets, standing orders or supplemental feedings. Verifies physician orders for unusual diets, conflicting modifications, and nutritional supplements with the appropriate RD, informatics RD, or FSSM. NCC Associate completes performance improvement activities as assigned by supervisor and conducts menu review with NFS personnel prior to meal service. Completes all other duties as assigned.\n\nWork Schedule: 6am-2:30p, 10:30am-7p\nPosition Description Title/PD#: Health Technician (Dietetic)/ PD# 99796-S\nPhysical Requirements:\nThe work requires walking, standing, bending, lifting and carrying of light items, such as food trays, instruction materials, books, and manuals. Requires long periods of sitting and moving about in an office environment, including repetitive motion activities of the hands and fingers for extensive keyboard and computer mouse use, and office tasks such as answering and holding a telephone phone, and writing. The work may require walking indoors, outdoors or to and from other areas of the medical center. It may be necessary to lift and/or push equipment. Incumbent is subject to periods continuous standing, sitting, walking and frequent stooping, reaching, pushing, pulling, and bending. Frequently lifts or moves objects weighing up to 20 pounds.\nWork Environment: Work is performed in a hospital and involves some exposure to contagious diseases. The employee must observe ergonomics pertaining to working in an office setting with electrical and stationary equipment. Employee must be alert to wet floors, gas, steam, electrical equipment, and general safety precautions including correct lifting techniques in all potential work areas. Discomfort may exist due to changes in temperature and/or humidity. Standard precautions may necessitate the use of personal protective equipment (PPE) in situations of potential exposure.\n\n"}, {"jobID": "715547800", "origin_search": "https://www.usajobs.gov/", "posted": "03/27/2023", "jobTitle": "Writer-Editor (Public/Internal Webpage), GS-1082-12", "companyName": "U.S.CoastGuard", "link": "https://www.usajobs.gov/job/715547800", "jobLocation": {"remote": "not specified", "city": "Topeka", "state": "KS", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 84025, "max": 109233}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMales born after 12/31/1959 must be registered for Selective Service.\nU.S. Citizenship is required.\n\n\nAll qualification requirements must be met by the closing date of the announcement. This includes Time-In-Grade requirements for current status employees applying through merit promotion procedures. Status applicants applying for a promotion must have 52 weeks of service at the next lower grade.\n\n\n Qualifications\n\nQualifications for GS-12:  At least one year of specialized experience equivalent to at least the GS-11 grade level is required.   Specialized experience is experience that has equipped you with the particular ability, skill, and knowledge to successfully perform the duties of this position and is typically in or related to this line of work.   Examples include: Gathering, developing, and ensuring the accuracy of information by conducting research and by interviewing subject-matter experts, and program personnel;  Utilizing software and hardware to produce drafts, edit and layout material and as necessary design, print and distribute material; and Working closely with technical personnel creating, developing and managing content for an organizations web presence using content management software.\nNational Service Experience (i.e., volunteer experience): Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\nThe Office of Personnel management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule, C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.\n\n\n\nEducation\n\nThis position does not have a positive education requirement. If you are including education on your resume, report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. See Required Documents section for detail.\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet Federal qualification requirements if you can show that your foreign education is comparable to education received in accredited educational institutions in the United States. It is your responsibility to provide such evidence with your application. See Recognition of Foreign Qualifications click here\n\n\n\nAdditional information\n\nApplicants will be required to complete questions contained on the Declaration for Federal Employment (OF-306) at the time a tentative job offer is made. Certain responses on the form could pose a problem with suitability for employment determinations. If you receive a conditional offer of employment for this position, you will be required to complete/make updates to the OF-306 and to sign and certify the accuracy of all information in your application, prior to entry on duty. False statements on any part of the application may result in withdrawal of offer of employment, dismissal after beginning work, or imprisonment.\nDHS uses e-Verify, an Internet-based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about e-Verify, including your rights and responsibilities at click here\nRecruitment incentives may be authorized.\nMoving expenses will not be paid.\nAll Federal employees are required to have Federal salary payments made by direct deposit.\nThe Department of Homeland Security encourages persons with disabilities to apply, to include persons with intellectual, severe physical or psychiatric disabilities, as defined by 5 CFR § 213.3102(u), and/or Disabled Veterans with a compensable service-connected disability of 30 percent or more as defined by 5 CFR § 315.707. Veterans, Peace Corps/VISTA volunteers, and persons with disabilities possess a wealth of unique talents, experiences, and competencies that can be invaluable to the DHS mission. If you are a member of one of these groups, you may not have to compete with the public for federal jobs. To determine your eligibility for non-competitive appointment and to understand the required documentation, click on the links above or contact the Servicing Human Resources Office listed at the bottom of this announcement.\nMore than 1 selection may be made from this announcement if additional identical vacancies in the same title, series, grade, and unit occur within 45 days from the date the certificate was issued.\nIf you need a reasonable accommodation for the application and hiring process, please contact 410-636-3500.  Decisions on granting reasonable accommodation will be made on a case-by-case basis. Visit Reasonable Accommodation\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nDHS offers competitive salaries and an attractive benefits package, including: health, dental, vision, life, and long-term care insurance; retirement plan; Thrift Savings Plan [similar to a 401(K)]; Flexible Spending Account; Employee Assistance Program; personal leave days; and paid federal holidays.  Other benefits may include:  flexible work schedules; telework; tuition reimbursement; transportation subsidies; uniform allowance; health and wellness programs; and fitness centers.  DHS is committed to employee development and offers a variety of employee training and development opportunities.  For more information, go to the DHS Careers website and select “Benefits”.  Disabled veteran leave will be available to any Federal employee hired on or after November 5, 2016, who is a veteran with a service-connected disability rating of 30 percent or more.\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThis role provides writing and editing services for the public and internal webpage for the U.S. Coast Guard Pay and Personnel Center (PPC).\nBeing a Coast Guard civilian makes you a valuable member of the Coast Guard team. Typical work assignments include: \n\nProviding an initial review of specialized products to ensure that they meet approved editorial standards of objectivity, style, and manner of presentation.\nInitiating and maintaining relationships with subject-matter specialists responsible for preparing the products.\nDeveloping all aspects of the organization's online presence, writing, editing, and proofreading site content and working closely with the technical team to maintain site standards.\nDeveloping site promotions, email newsletters, and online outreach campaigns. \nCreating, developing and managing content for the organization's web presence using content management software.\nEditing and proofreading all web content.\nMonitoring responses to posts via the website, social media, or other platforms to better understand the audience.\nWriting and/or editing documents and reports of a factual nature, news, and pamphlets.\nWriting and/or editing copy that is complex or controversial, using many sources.\nResolving inconsistencies in all areas of publications, changing formats in texts, as needed, so that they are more effective.\n\n\n"}, {"jobID": "710959200", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "Computer Assistant", "companyName": "Commander,NavyInstallations", "link": "https://www.usajobs.gov/job/710959200", "jobLocation": {"remote": "not specified", "city": "OkinawaIsland", "state": "Japan", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 1950, "max": 22}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust pass all applicable records and background check.\nThis is a Non-Critical Sensitive Position that requires the occupant to be able to obtain and maintain a Secret Security Clearance (Must be a US Citizen to obtain clearance)\nOccasional travel of less than 20% may be required.\nMay be required to work overtime during emergency situations.\nRequires signed Privileged Access Agreement.\nMust be able to work varied work schedules to include evenings, weekends, and holidays. Schedule should be adjusted to avoid overtime when possible.\nMust meet Department of Defense (DoD) Directive 8140.1 and SECNAV M-5239.2 Cybersecurity? Workforce Requirements for Specialty Area 41, Early/Apprentice, which include:\nCERTIFICATION\nCompTIA A+ ce, CompTIA Network+ ce, Systems Security Certified Practitioner (SSCP), or other related certifications.\n\n\n Qualifications\n\nResumes must include information which demonstrates experience and knowledge, skills, and ability (KSAs) as they relate to this position. Applicants are encouraged to be clear and specific when describing their experience level and KSAs.\n\nA qualified candidate possess the following:\n\nSkill in supporting Windows 7 and 10 as well as Mac OSX 10.9 and above in a heterogeneous environment.\nKnowledge of computer servers and workstations, as well as printers, fax, copy machines and phone systems.\nAbility to take direction well and request assistance when needed.\nAbility to evaluate issues and use discretion in recognizing priority issues and escalate accordingly.\nAbility to apply customer support principles, in order to appropriately receive, respond to, and resolve help desk calls.\nAbility to maintain strict confidentiality standards and successfully pass a background check to maintain a position of trust.\nAbility to communicate effectively both orally and in writing.\nMust meet Department of Defense (DoD) Directive 8140.1 and SECNAV M-5239.2 Cybersecurity Workforce Requirements for Specialty Area 41, Early/Apprentice. \nThis is a Non-Critical Sensitive Position that requires the completion of a favorable T-3 background investigation. \n\n\n\n\nEducation\n\n\nWhen education is a basic requirement for the position, or when substituting education for experience, applicants MUST submit a copy of your high school transcripts, college transcript, or a list of courses, which includes grades earned, completion dates, and quarter, and/or semester hours earned as part of your application package.\nForeign education must include evidence that it is comparable to education received at accredited educational institutions in the United States.\nTranscripts from foreign colleges must be evaluated for U.S. equivalency in order to be considered. Applicants are responsible to obtain and submit proof of creditability of education as evaluated by a credentialing agency, which is a private U.S. organization. Credential evaluations are not free and applicants are responsible for the cost of the selected service.\nAll substitutions of education for experience will be made in accordance with OPM approved qualification standards.\nTo receive consideration for a non-related degree or eligibility based on a combination of education AND experience, a college transcript is required.\nAll transcripts MUST show student's name and the name of the awarding university or educational institution, degree type, awarded/conferred date, and the field of study.\n\t\n*If your degree has not been awarded/conferred, you must provide a copy of your HS Diploma or equivalent along with transcript(s).\n\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education are acceptable to meet positive education requirements or to substitute education for experience.\nFor additional information, please go to the Office of Personnel Management (OPM) and the U.S. Department of Education websites at http://www.opm.gov/qualifications and http://www.ed.gov/admins/finaid/accred/index.html\n\n\n\n\nAdditional information\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nProvides timely help desk support by responding to end user questions and problems via online helpdesk, phone, e-mail and-in person.\nInitiates and enters work order entries accurately and completely as a Tier 1 responder.\nDetermines source of computer problems (e.g., hardware, software, user error), assigns priority, then resolves or refers to the appropriate specialist or technician for resolution.\nTranslates technical terms into non-technical language for users so they can better understand the issue and the solutions.\nTroubleshoots routine or minor software and hardware problems.\nAssists specialist or technicians by performing a segment of their work ( e.g., installation, repair).\nAssists end-users with software features, applications, functionality and escalates more complex problems to the appropriate specialist or technician.\nServes as designated IT representative for ONE-NET for N9 programs. Manages and routes ONE­NET requests (e.g., System Authorization Access Request-Navy (SAAR-N), Request's for Change (RFC), Information Assurance Training).\nIdentifies help requests that are attributable to other support agencies and refers user to the appropriate helpdesk or support department (e.g., ONE-NET, Systems Applications and Products (SAP), KRONOS).\nProcesses employee check-out notifications and ensures program accounts are terminated or transferred upon separation from N9.\nTracks Accounting and Information Management System (AIMS) Network and ONE-NET user account status, documentation and required trainings.\nManages AIMS and MIS/POS system user accounts.\nAssists specialists with the management and patching of Unofficial Quality of Life and Business computers.\nAssists specialists with the development, testing and deployment of new software packages and images.\nAssists specialist with regional and local projects, refreshes and system upgrades.\nAssists with maintaining IT asset inventory.\n\n\n"}, {"jobID": "702769200", "origin_search": "https://www.usajobs.gov/", "posted": "01/27/2023", "jobTitle": "Information Technology Specialist Direct Hire 12 month (Public Notice)", "companyName": "InternalRevenueService", "link": "https://www.usajobs.gov/job/702769200", "jobLocation": {"remote": "not specified", "city": "Birmingham", "state": "AL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 46696, "max": 183500}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nIf you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 200-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.\nMust be a U.S. Citizen or National and provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240))\nUndergo a review of prior performance/conduct and an income tax verification. Refer to \"Get Your Tax Record\" at http://www.irs.gov/(https://www.irs.gov/individuals/get-transcript) to check the status of your account, balance owed, payment history, make a payment, or review answers to tax questions. If you are not in compliance, you will be determined unsuitable for employment with IRS.\nMust successfully complete a background investigation, including a FBI criminal history record check (fingerprint check).\nComplete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency.\nGo through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpired original or certified copies. \n\n\n\n Qualifications\n\r\n                                        Federal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-time work is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.\n\nYou must meet the following requirements by the closing date of this announcement OR time of referral:\n\nBASIC REQUIREMENT:Experience must include Information Technology (IT) related experience that demonstrates each of the following four competencies: 1) Attention to Detail, 2) Customer Service, 3) Oral Communication and 4) Problem Solving.\n\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\n\nSPECIALIZED EXPERIENCE: GS-7 LEVEL: To be eligible for this position at this grade level, you must meet one of the following requirements. Applicants must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-05 level in the Federal Service. Specialized experience for this position must have been in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Interviewing subject-matter personnel to get facts regarding work processes, and synthesizing the resulting data into charts showing information flow; operating computer consoles where this involved choosing from among various procedures in responding to machine commands or unscheduled halts; scheduling the sequence of programs to be processed by computers where alternatives had to be weighed with a view to production efficiency; preparing documentation on cost/benefit studies where this involved summarizing the material and organizing it in a logical fashion; working directly with customers in obtaining information needed to establish or change accounts; translating detailed logical steps developed by others into language codes that computers accept where this required understanding of procedures and limitations appropriate to use of a programming language.\n\nOR\nEDUCATION: 1 full academic year of graduate education at an accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics or technology management.\n\nOR 1 full academic year of graduate education in one or more of the fields identified above that required the development or adaption of applications, systems or networks.\n\nOR Superior Academic Achievement may be met by having a bachelor's degree, with one of the following: A GPA of 2.95 or higher on a 4.0 scale for all completed undergraduate courses or those completed in the last 2 years of study, or a GPA of 3.45 or higher on a 4.0 scale for all courses in the major field of study or those courses in the major completed in the last 2 years of study, or rank in the upper one third of the class in the college, university, or major subdivision, or membership in a national honor society recognized by the Association of College Honor Societies. Note: Grade point averages should be rounded to one decimal point. For example, 2.95 is rounded to 3.0, and 2.94 is rounded to 2.9. If more than 10 percent of your undergraduate course work (credit hours) was taken on a pass/fail or similar basis, your claim must be based on class standing or membership in an Honor Society.\nOR \nCOMBINATION OF EXPERIENCE AND EDUCATION: You may qualify by a combination of experience and education. At least 1 year of combined graduate education and experience as defined in paragraphs above. Options for qualifying based on a combination will be identified in the online questions.\n\nSPECIALIZED EXPERIENCE: GS-9 LEVEL: To be eligible for this position at this grade level, you must meet one of the following:\nYou must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-7 grade level in the Federal service. Specialized experience for this position includes: Experience in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Analysis of the interrelationships of pertinent components of the system; Planning the sequence of actions necessary to accomplish the assignment; and Personal responsibility for at least a segment of the overall project.\nOR\nEDUCATION: A master's or equivalent graduate degree or two full years of progressively higher-level graduate education leading to a master's or equivalent graduate degree in computer science, engineering, information science, information systems management, mathematics, statistics, operations research, engineering or technology management. OR A master's or equivalent graduate degree or two full years of progressively higher-level graduate education leading to a master's or equivalent graduate degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: At least 1 year of combined graduate education and experience as defined in paragraphs above.\n\nSPECIALIZED EXPERIENCE: GS-11 LEVEL: To be eligible for this position at this grade level, you must meet one of the following:\nYou must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-9 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrated an accomplishment of computer project assignments that required a range of knowledge of computer requirements and techniques. For example, assignments would show experience in developing modifications to parts of a system that required significant revisions in the logic or techniques used in the original development. Must have been in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Knowledge of the customary approaches, techniques, and requirements appropriate to an assigned computer applications area or computer specialty area in an organization; planning the sequence of actions necessary to accomplish the assignment where this entailed coordination with others outside the organizational unit and development of project controls; adaptation of guidelines or precedents to the needs of the assignment.\nOR\nEDUCATION: You may substitute education for specialized experience as follows: a Ph.D. or equivalent doctoral degree or 3 full years of progressively higher-level graduate education leading to a Ph.D. OR equivalent doctoral degree in computer science, information science, information systems management, mathematics, statistics, operations research, engineering or technology management; OR equivalent doctoral degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: At least 1 year of combined graduate education and experience as defined in paragraphs above.\n\nSpecialized experience continued in Education\nFor more information on qualifications please refer to OPM's Qualifications Standards.\r\n                                    \n\n\nEducation\n\nSPECIALIZED EXPERIENCE:GS-12 LEVEL: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-11 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. This knowledge is generally demonstrated through assignments that required the ability to analyze a number of alternative approaches in the process of advising management concerning major aspects of IT system design. This would include defining what system interrelationships must be considered, or what operating mode, system software, and/or equipment configuration is most appropriate for a given project.\n\nSPECIALIZED EXPERIENCE: GS-13 LEVEL: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-12 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. This knowledge is generally demonstrated through assignments that required the ability to analyze a number of alternative approaches in the process of advising management concerning major aspects of IT system design. This would include defining what system interrelationships must be considered, or what operating mode, system software, and/or equipment configuration is most appropriate for a given project.\n\nSPECIALIZED EXPERIENCE: GS-14 LEVEL: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-13 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. This knowledge is generally demonstrated through assignments that required the ability to analyze a number of alternative approaches in the process of advising management concerning major aspects of IT system design. This would include defining what system interrelationships must be considered, or what operating mode, system software, and/or equipment configuration is most appropriate for a given project. \n\nSPECIALIZED EXPERIENCE: GS-15 LEVEL: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-14 grade level in the Federal service: Specialized experience for this position includes: Experience that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. This knowledge is generally demonstrated through assignments that required the ability to analyze a number of alternative approaches in the process of advising management concerning major aspects of IT system design. This would include defining what system interrelationships must be considered, or what operating mode, system software, and/or equipment configuration is most appropriate for a given project.\n\nFor positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.\n\nA college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Click here for Foreign Education Credentialing instructions.\r\n                                        \n\n\nAdditional information\n\n\nA 1-year probationary period is required.\nHave your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.\nIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.\nWe may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled.\nThe salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages.\nThis announcement will be used to hire bargaining and non-bargaining unit positions.\nTour of Duty:\n\t\nDay Shift-Start and stop times between 6:00am and 6:00pm.\nSwing Shift-Start and stop times between 10:00am and 2:00am.\nNight Shift-Start and stop times between 6:00pm and 6:00am.\n\n\nAlternative work schedule, staggered work hours or telework may be available.\nObtain and use a Government-issued charge card for business-related travel.\n\n\nPlease consider each location carefully when applying. If you are selected for a position at one of your location selections, that location will become your official post of duty.\n\n\nThis is an open continuous announcement which allows applicants to apply up to the closing date of the announcement, 01/26/2024. This announcement will establish an inventory of applicants. Contingent upon funding and space requirements, one or more vacancies may be filled at the locations listed in this announcement as they come available.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nWHAT IS THE INFORMATION TECHNOLOGY (IT) DIVISION?\n\nA description of the business units can be found at: https://www.jobs.irs.gov/about/who/business-divisions\n\nVacancies will be filled in the following Information Technology specialty areas, such as:\n\nNetwork Services\nData Management\nCustomer Support\nProject Management\nSystems Analysis/Applications Software, Relational Database Development\nSystems Analysis/Applications Software, ALC Applications Development\nSystems Analysis/Applications Software, COBOL Applications Development\nSystems Analysis/Applications Software, Java Applications Development\nSystem Analysis\nPolicy and Planning and Operating Systems\n\n\nThe following are the duties of this position at the full working level. If this vacancy includes more than one grade and you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and receive training to help you grow in this position.\n\nAnalyzes and evaluates the full asset control life cycle, acquisition, and utilization of Information Technology services and equipment.\nServes as a point-of-contact with vendors on IT services installations, movement, maintenance, and acceptance testing of new IT services.\nProvide advice and assistance to customers on a large local problem to troubleshoot complex problems; and provide support in a manner that minimizes interruptions in customers' ability to carry out critical business activities.\nProvide technical guidance during a significant project in designing, coding, testing, debugging, and maintaining programs.\nPlan, develop, schedule, and test COBOL software applications in support of IRS modernization and production systems using established standards and system lifecycles.\nDefines site objectives by envisioning system features and functionality. Arranges project requirements in programming sequence by analyzing user's requirements; prepares a workflow chart and diagram using knowledge of computer capabilities, subject matter, programming language, and logic.\nAssessment of new systems design methodologies to improve software quality, accurately represent customer requirements, effectively measure software development risk, present recommendations for adoption of new methodologies, and lead the implementation of the improvement project.\n\n\nVacancies filled under this public notice may have varying levels of promotion potential and supervisory level. Some jobs have the potential for noncompetitive promotion depending on how the position is structured. If you are selected at a lower grade level for a job with promotion potential, you will receive training to help you grow in the position. For jobs with promotion potential, promotions may occur after you have:\n\n\nmet time-in-grade requirements\nperformed at an acceptable level of competence; and\ndemonstrated your ability to perform work at the next higher grade level.\n\n\n"}, {"jobID": "716235100", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "IT SPECIALIST (CUSTSPT/NETWORK)", "companyName": "SecretaryoftheNavyOffices(SECNAV)", "link": "https://www.usajobs.gov/job/716235100", "jobLocation": {"remote": "not specified", "city": "NavalStationComplex", "state": "SanDiego", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nYou must acknowledge in writing that you are accepting an appointment in the excepted service which does not confer competitive status, prior to appointment.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final TOP SECRET/SCI security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.\n\n\n Qualifications\n\r\n                                        One year of information technology related experience in the federal service or private or public sector demonstrating the following four competencies, as defined:\n\n1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Providing technical and operational support for all network, system, and technical operation issues and concerns.\n\n2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. IT-related experience demonstrating this competency includes: Providing technical drawings (e.g., network architecture), technical advice, guidance, and recommendations to management and other technical specialists on IT issues affecting all data networks, data processing, and telecommunications facilities.\n\n3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Ability to communicate orally and in writing in order to recommend hardware/software solutions and present highly technical and complex briefings on short or long range automation/telecommunications objectives to all levels of management and co-workers.\n\n4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Knowledge of information management policies, concepts and systems to provide advice to reduce costs and simplify maintenance, and hardware capabilities to meet changing requirements.\n\nIn addition to the experience demonstrating the four competencies above, you must have one year of specialized experience equivalent to the next lower grade level (GS-12) or pay band in the federal service or equivalent experience in the private or public sector installing, configuring, maintaining computer systems, local area networks and wide area networks; providing hardware and software maintenance for Microsoft Windows systems; AND performing analysis and conducting information management studies.\n\nAdditional qualification information can be found from the following Office of Personnel Management website: http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp.\n\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nThis position is in the excepted service and does not confer competitive status.\n\nThis position is eligible for part time, substantial or ad-hoc telework at the discretion of management.\n\nThis position is designated as a Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area 411-Technical Support level III within 12 months of appointment.\n\nThis position is covered under the DoD Information Assurance Workforce Improvement Act. The incumbent must obtain Information Assurance Technical (IAT) Level III certification within 6 months of appointment and maintain such certification.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP does not apply to Excepted Service positions.\n\n Military Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive  referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will serve as a IT Specialist within the Information Systems Department responsible for a broad subject matter area which include information technology, database management, and/or life cycle system development.\nYou will serve as a IT specialist with responsibility for the installation, configuration, maintenance and management of NCIS computer systems, Local Area Network(s), and Wide Area Network(s).\nYou will perform computer hardware and software maintenance, troubleshooting and resolution, Microsoft Windows desktop support and systems administration, systems analysis and programming, and computer operations.\nYou will provide advice, guidance, training and assistance to users on the capabilities and use of internal and external computer resources comprising applications, networks and computer devices such as desktops, laptops, wireless communication.\nYou will perform analysis and conduct information management studies.\nYou will prepare information management standard operating procedures (SOPs). Develop internal controls and quality assurance.\n\n"}, {"jobID": "716235200", "origin_search": "https://www.usajobs.gov/", "posted": "03/29/2023", "jobTitle": "IT SPECIALIST (CUSTSPT/NETWORK)", "companyName": "SecretaryoftheNavyOffices(SECNAV)", "link": "https://www.usajobs.gov/job/716235200", "jobLocation": {"remote": "not specified", "city": "NavalStationComplex", "state": "SanDiego", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 112015, "max": 145617}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nYou must acknowledge in writing that you are accepting an appointment in the excepted service which does not confer competitive status, prior to appointment.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final TOP SECRET/SCI security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.\n\n\n Qualifications\n\r\n                                        One year of information technology related experience in the federal service or private or public sector demonstrating the following four competencies, as defined:\n\n1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Providing technical and operational support for all network, system, and technical operation issues and concerns.\n\n2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. IT-related experience demonstrating this competency includes: Providing technical drawings (e.g., network architecture), technical advice, guidance, and recommendations to management and other technical specialists on IT issues affecting all data networks, data processing, and telecommunications facilities.\n\n3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Ability to communicate orally and in writing in order to recommend hardware/software solutions and present highly technical and complex briefings on short or long range automation/telecommunications objectives to all levels of management and co-workers.\n\n4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Knowledge of information management policies, concepts and systems to provide advice to reduce costs and simplify maintenance, and hardware capabilities to meet changing requirements.\n\nIn addition to the experience demonstrating the four competencies above, you must have one year of specialized experience equivalent to the next lower grade level (GS-12) or pay band in the federal service or equivalent experience in the private or public sector installing, configuring, maintaining computer systems, local area networks and wide area networks; providing hardware and software maintenance for Microsoft Windows systems; AND performing analysis and conducting information management studies.\n\nAdditional qualification information can be found from the following Office of Personnel Management website: http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp.\n\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nThis position is in the excepted service and does not confer competitive status.\n\nThis position is eligible for part time, substantial or ad-hoc telework at the discretion of management.\n\nThis position is designated as a Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area 411-Technical Support level III within 12 months of appointment.\n\nThis position is covered under the DoD Information Assurance Workforce Improvement Act. The incumbent must obtain Information Assurance Technical (IAT) Level III certification within 6 months of appointment and maintain such certification.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP does not apply to Excepted Service positions.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will serve as a IT Specialist within the Information Systems Department responsible for a broad subject matter area which include information technology, database management, and/or life cycle system development.\nYou will serve as a IT specialist with responsibility for the installation, configuration, maintenance and management of NCIS computer systems, Local Area Network(s), and Wide Area Network(s).\nYou will perform computer hardware and software maintenance, troubleshooting and resolution, Microsoft Windows desktop support and systems administration, systems analysis and programming, and computer operations.\nYou will provide advice, guidance, training and assistance to users on the capabilities and use of internal and external computer resources comprising applications, networks and computer devices such as desktops, laptops, wireless communication.\nYou will perform analysis and conduct information management studies.\nYou will prepare information management standard operating procedures (SOPs). Develop internal controls and quality assurance.\n\n"}, {"jobID": "716064100", "origin_search": "https://www.usajobs.gov/", "posted": "03/30/2023", "jobTitle": "IT SPECIALIST (INFOSEC)", "companyName": "NavalSeaSystemsCommand", "link": "https://www.usajobs.gov/job/716064100", "jobLocation": {"remote": "not specified", "city": "NavalSurfaceWarfareCenter", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis is a designated Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area 411 - Technical Support Specialist Advanced level within 12 months of appointment.\nThis is a designated Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area 441 - Network Operations Specialist Advanced level within 12 months of appointment.\nSuccessful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or fail the test. You will be subject to random testing.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\r\n                                        I have one year of information technology related experience in the federal service or private or public sector demonstrating the following four competencies, as defined: 1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail. IT-related experience demonstrating this competency include: Implementing and integrating new Information Assurance (IA) technologies and developing concepts, principles, standards, and methods to ensure vulnerability and IA compliance of information system security. 2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.  IT-related experience demonstrating this competency include: Resolving various IT issues involving all aspects of technology and advanced signal processing techniques. 3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. IT-related experience demonstrating this competency include: Interface with managers of the department business office and engineers to capture requirements for software scripts and tools. 4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. IT-related experience demonstrating this competency include: Developing policies and procedures to prevent against unauthorized access to business systems and data. In addition to my experience demonstrating the four competencies above, I have one year of specialized experience equivalent to the next lower grade level or NT-04 (GS-11/12 equivalent) pay band in the federal service or equivalent experience in the private or public sector developing and planning cybersecurity and customer support of information systems that anticipate, identify, evaluate, and mitigate risks associated with information systems and network vulnerabilities.\n\n\nAdditional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/ \n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher.  ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will perform as Deputy DIO (Department Information Officer).\nYou will assist IT/IA Group Manager and Department Information Officer on IT/IA initiatives and matters.\nYou will assist IT/IA Group Manager and Department Information Officer in Information System Security Officer responsibilities.\nYou will lead to provide end users tiered-level customer support by coordinating software, hardware, network, and security issue resolution.\nYou will lead to identify end-user requirements for software and hardware solutions.\nYou will provide Program Managers cost estimates for Information Assurance (IA) certification requirements.\nYou will track processes and provide metrics for Department 70 Accreditation and Authorization packages.\n\n"}]