[{"jobID": "693803300", "origin_search": "https://www.usajobs.gov/", "posted": "12/08/2022", "jobTitle": "Biomedical Equipment Support Specialist (Biomedical Info Systems)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/693803300", "jobLocation": {"remote": "not specified", "city": "Wilmington", "state": "NC", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 107680}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nSelective Service Registration is required for males born after 12/31/1959.\nMust be proficient in written and spoken English.\nYou may be required to serve a probationary period.\nSubject to background/security investigation.\nSelected applicants will be required to complete an online onboarding process.\nMust pass pre-employment physical examination.\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP).\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\nBasic Requirements:\n\nUnited States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\n\nExperience and Education:\n\nAssociate's degree in Biomedical Electronics Technology, Biomedical Equipment Technology or Biomedical Engineering Technology or in a related technical field such as Electronic Technology or Information Technology and two years of experience as a Biomedical Equipment Support Specialist, Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer, or Information Technology Specialist.\n\nOR\n\nBachelor's degree in Biomedical Engineering Technology or in a related field such as Electronics Engineering Technology (EET) or Information Technology.\n\nOR\n\nCompletion of a military training program in biomedical equipment and two years of experience as a Biomedical Equipment Support Specialist or Biomedical Equipment Technician, Field Service Engineer, Medical Equipment Repairer, or Information Technology Specialist.\n\nEnglish Language Proficiency: Proficient in written and spoken English.\n\nLicensure/Certification/Registration: None\n\nGrade Determinations (GS-12) In addition to meeting the basic requirements listed above, applicants must meet the grade requirements for GS-12 Biomedical Equipment Support Specialist (Biomedical Information Systems).GS-12 Experience: At least one year of specialized experience equivalent to the GS-11 grade level.\n\nDemonstrated Knowledge, Skills, and Abilities (KSAs). In addition to the experience above, the candidate must demonstrate all of the following KSAs:(a) Current knowledge of computer virus protection software, available software patches and upgrades, and information security tools.(b) Expert knowledge of electronics, computer and networking theory with experience maintaining, interfacing and troubleshooting networked medical equipment to include VLAN configuration, IP addressing, sub-netting, and network security.(c) Ability to utilize and maintain computer and server based medical equipment, medical record databases, and proprietary and generic software, Experience with TCP/IP, HL7, networking, network security, and DICOM standards.(d) Ability to interpret, identify, and apply network engineering principles and practices where there often times is no previous example to follow, or precedence.(e) Skill to distinguish networking problems from non-networking problems and discuss various options with IT networking and operations staff members.\n\nPreferred Certification: Certification as a Certified Biomedical Equipment Technician (CBET), Net+, and A+ are highly desirable but not required.\n\nReferences: VA Handbook 5005, Part II, Appendix G49 Biomedical Equipment Support Specialist Qualification Standard\n\nPhysical Requirements: Must be able to perform heavy lifting of up to 45 pounds; normal depth perception; ability to stoop, reach, kneel, crouch, and maintain intense concentration for long periods of time under most adverse conditions, such as troubleshooting, repairing and/or calibrating life-saving equipment while it is monitoring and/or supporting the life of a patient; walk and stand for a maximum of 5 hours; crawl and kneel for a maximum of 2 hours; ability to distinguish basic colors; circuit repairs require adequate eyesight and dexterity for working on high-density boards.\r\n                                    \n\n\nEducation\n\nIMPORTANT: A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nThis position is in the Excepted Service and does not confer competitive status.\n\nVA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38, and are not covered by the Schedule A excepted appointment authority.\n\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nAs a Biomedical Equipment Support Specialist (Biomedical Info Systems), you will maintain networks, networked medical equipment and associated systems using established local, regional and national policies and procedures designed to meet criteria and standards from multiple accrediting agencies and governing bodies. Your duties will include, but are not limited to:\n\nLifecycle management of network equipment including network switches, servers, routers, and related infrastructure for any and all networked complex medical devices and systems such as imaging, life support, dialysis, and monitoring.\nComplete routine and complex assignments that involve identifying and troubleshooting issues related to VLAN configuration, IP addressing, sub-netting, HL7, DICOM, Access Control List, and network security across the medical device network.\nUtilize advanced network test equipment and software such as tracers, wireless spectrum analyzers, network traffic monitors, command prompt, physical and virtual server software.\nManage, troubleshoot, and maintain complete systems of computerized networks, databases and servers including, but not limited to, biomedical information systems that store or facilitate patient information. These biomedical information systems include, but are not limited to, Picture Archiving Communication Systems, physiological monitoring systems, Clinical Information Systems, Anesthesia Record Keeping, and other systems for which Medical Device Isolation Architecture (MDIA) would apply.\nImplement and plan for new and emerging technologies including diagnostic modalities, network management and storage, and virtual data centers.\nDesign, implement, and manage network incident response due to infection, loss of service, or regional andlocal policy changes. Ensure proper security configuration for assigned devices and networks. Review and install approved software updates and virus definitions for applicable networked medical devices. Lead development of disaster recovery procedures for critical systems to be enacted in the event of device failure. Adhere to MDIA guidelines in both pre-procurement and during system implementation. Load operating system and clinical application software as needed.\nLifecycle management of medical devices and systems such as imaging, life support, dialysis, and monitoring to include physical and network support. Complete routine and complex assignments involved in the installation, maintenance, modification, troubleshooting, repair, and calibration of complex therapeutic, diagnostic, and life support medical devices and systems. Utilize common test equipment such as electrical safety analyzers, oscilloscopes, patient simulators, pulse generators, network analyzers, and multimeters.\nMaintain functional knowledge of relevant safety codes and standards of regulatory bodies including, but not limited to, The Joint Commission, National Fire Protection Association, Food and Drug Administration, Nuclear Regulatory Commission, Association for the Advancement of Medical Instrumentation, American College of Radiology, Federal Information Processing Standards.\nDocument all work performed in the computerized maintenance management system. Maintain documentation of biomedical information systems covering ePHI requirements, VLAN, IP address, anti-virus software, security, and other required information.\nFunction as a Contracting Officer Representative and keep appropriate certification levels. Use knowledge of government contract procedures and documentation requirements to develop statements of work, sole source justifications, and other applicable documentation, and to oversee vendor work. Collaborate with Logistics and Contracting to procure parts and services. Function as a purchase card holder.\nInvestigate, remediate, and document recalls and safety alerts within established timeframes. Participate in local safety improvement processes such as Root Cause Analysis, safety work groups, and Environment of Care Rounds. Identify hazards during routine job performance and take action to ensure they are addressed and corrected.\nRepresent Biomedical/Clinical Engineering department on committees and in meetings as delegated by supervisor.\n\nWork Schedule: Full-Time / 8 hour shift or 10 hour shift\nTelework: Available as determined by agency policy\nVirtual: This is not a virtual position.\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "678421000", "origin_search": "https://www.usajobs.gov/", "posted": "09/20/2022", "jobTitle": "Applications Developer", "companyName": "U.S.Courts", "link": "https://www.usajobs.gov/job/678421000", "jobLocation": {"remote": "not specified", "city": "Washington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 57222, "max": 145641}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\r\n                                        Only those applicants selected for an interview will be contacted and must travel at their own expense if an on-site interview is necessary. The court reserves the right to modify the conditions of this announcement, commence interviews immediately, withdraw the announcement, or fill the position at any time, any of which actions may occur without notice.\n\nThis position is on-site in Washington, DC with some telework opportunities per the Court's guidelines. This is an Excepted Appointment and At-Will position. Federal government civil service classifications or regulations do not apply. As a condition of employment, applicants must successfully complete an FBI fingerprint and background check. This position is subject to EFT (direct deposit of earnings).\n\nMust be a U. S. citizen or eligible to work in the United States. Non-citizens may be interviewed and considered for employment, but employment offers will only be made to individuals who qualify under one of the exceptions in 8 U.S.C.§ 1324b(a)(3)(B). Under 8 U.S.C.§1324b(a)(3)(B), a lawful permanent resident seeking citizenship may not apply for citizenship until he or she has been a permanent resident for at least five years (three years if seeking naturalization as a spouse of a citizen), at which point he or she must apply for citizenship within six months of becoming eligible and must complete the process within two years of applying (unless there is a delay caused by the processors of the application). Non-citizens who have not been permanent residents for five years will be required to execute an affidavit that they intend to apply for citizenship when they become eligible to do so.\r\n                                    \n\n Qualifications\n\nEntry Level Candidates\nEntry Level candidates will receive tailored training and experience necessary for the incumbent to develop the knowledge, skills, and abilities required to progressively assume increasing responsibilities.\n\nCL-26 ($57,222 - $92,955): To be considered at this level, candidates must possess a bachelor's degree in computer science or a closely related field from an accredited college and hands-on experiences with one of the major programming languages (e.g., C#, Java, Python, JavaScript, etc.). Additionally, candidates must possess one or more of the following superior academic achievements:\n\t\nAn overall \"B\" grade point average equaling 2.90 or better of a possible 4.0; AND/OR\nStanding in the upper third of the class; AND/OR\n\"3.5\" average or better in the major field of study, such as Computer Science or a related field that would prepare a candidate well to perform in this position; AND/OR\nElection to membership in Phi Beta Kappa, Sigma XI, or one of the National Honorary Scholastic Societies meeting the minimum requirements of the Association of College Honor Societies, other than Freshman Honor Societies.\n\n\n\nExperienced Candidates\nExperienced candidates must have a minimum of two years of specialized experienced, which is defined as progressively responsible technical experience directly related to the position responsibilities listed above. Examples may include experience designing, implementing, programming, and maintaining operational systems or applications; performing system testing and analysis; and/or implementing system improvement initiatives, integrations, and updates.\n\nCL-27 ($62,852 - 102,201): To be considered at this level, candidates must possess two years of specialized experience.\nCL-28 ($75,343 - $122,483): To be considered at this level, candidates must possess a minimum of five years of specialized experience, which includes mentoring other developers, leading technical teams, or providing deep subject matter expertise used to advise leadership on the technical direction of the organization.\n\nSenior Level Candidates\nSenior Level candidates must have a minimum of eight years of specialized experience, which is defined as progressively responsible technical experience directly related to the position responsibilities listed above. Examples may include experience designing, implementing, programming, and maintaining operational systems or applications; performing system testing and analysis; and/or implementing system improvement initiatives, integrations, and updates.\n\nCL-29 ($89,598 - $145,641): To be considered at this level, candidates must possess as minimum of eight years of specialized experience, which includes technical lead responsibilities such as representing a development effort to management, proposing and vetting plans for implementation, and guiding the sequence of steps required to ensure on-time and under-budget feature delivery.\n\nEntry Level, Experienced, and Senior Level candidates must possess the following competencies:\n\nHands-on experience in architecting, developing, testing, supporting, and documenting software deployed on a variety of platforms such as desktop applications, command-line interfaces, web-based applications or websites, or mobile applications.\nKnowledge of the latest programming technologies, frameworks, and source control methods.\nProgramming experience with one or more of the following languages: C#.Net, Java, JavaScript, Linux shell scripts, JSP and/or Spring MVC (client and server-side Java programming).\nKnowledge of and experience with HTML, CSS, and SQL, including complex SQL queries and scripting.\nExcellent working knowledge of software development trends and a proven track record of delivering high quality solutions that meet or exceed business needs.\nThe ability to exercise innovative and creative skills to solve challenging issues.\nExcellent communication (both oral and written) and organizational skills.\nThe ability to prioritize, manage multiple tasks, and work effectively under pressure, as well as the ability to work both independently and in a team environment.\n\nFor Entry Level candidates only: The above required knowledge and experience may be demonstrated through relevant coursework, internships, other non-professional, or unpaid experience, and/or professional experience.\n\nPreferred Competencies\n\nKnowledge of and experience with Microsoft Office 365, Power Platform, and Azure DevOps.\nKnowledge of and experience with both Windows Server 2019/2022 and Red Hat Linux Server 7/8 operating systems.\n\nExperience working in the information technology field for the federal judiciary.\r\n                                    \n\n\nEducation\n\r\n                                            Candidates must possess a bachelor's degree from an accredited college or university.\r\n                                        \n\n\nAdditional information\n\nBenefits\n\nA generous benefits package is available to full-time permanent court employees including:\n\nPaid vacation and sick leave, paid parental leave, and 11 paid federal holidays per year.\nOptional participation in Federal Employees Health Benefits plans (health, dental and vision); Federal Employees Group Life Insurance; Flexible Benefits Program; Long-Term Care Insurance; Health Care Reimbursement (HCRA) and Dependent Care Reimbursement (HCRA).\nPublic transportation subsidy, on-site fitness center, Employee Assistance Program (EAP).\nParticipation in the Federal Employees Retirement System (FERS). Optional participation in Thrift Savings Plan (up to 5% employer matched contributions).\nPublic Service Loan Forgiveness program pursuant to the term of the (PSLF) program.\nFor more benefit information visit the Judiciary's Benefits Page.\n\nThe court reserves the right to modify the conditions of this announcement, commence interviews immediately, withdraw the announcement, or fill the position at any time, any of which actions may occur without notice.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Responsibilities include, but are not limited to:\n\nLeverage Microsoft Azure hosting and Office 365 automation to enhance the business processes of the court using technologies such as Power Apps, Microsoft Graph API, Power Automate, and Power BI with SharePoint Online. Review, update, and maintain the court's public website using a WordPress content management system.\nParticipate in all phases of the Software Development Life Cycle (SDLC), including the planning, systems analysis, systems design, implementation, integration, testing, deployment, and maintenance of the court's applications. Collaborate with ITO staff members and other court employees to solicit user requirements, expectations, project schedules, and enhancements.\nHelp maintain and troubleshoot relational databases in Microsoft SQL Server and Informix using complex SQL queries, SQL scripting, and stored procedures/functions, as well as maintain reports in SQL Server Reporting Services (SSRS).\nAssist with the support and maintenance of the judiciary's critical national Case Management/Electronic Case Filing system (CM/ECF) within the Federal Circuit.\nPerform other related duties and assist with projects as assigned by the Manager of Software Development and the Director of IT.\nThis position is on-site in Washington, DC with some telework opportunities per the Court's guidelines.\n\n\n"}, {"jobID": "703695200", "origin_search": "https://www.usajobs.gov/", "posted": "02/02/2023", "jobTitle": "PATENT ATTORNEY", "companyName": "NavalAirSystemsCommand", "link": "https://www.usajobs.gov/job/703695200", "jobLocation": {"remote": "not specified", "city": "PointMugu", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 66134, "max": 183500}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nPer the preliminary nationwide injunction on E.O. 14043, COVID-19 vaccinations will not be implemented or enforced.  For more information on vaccine status and workplace safety protocol requirements see Additional Information below.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\nYou will be required to complete ethics orientation within three months of appointment and submit a Confidential Financial Disclosure Report, OGE-450, within 30 days of appointment.\n\n\n Qualifications\n\r\n                                        Applicants must have graduated from a law school accredited by the American Bar Association, be a licensed patent attorney registered with the United States Patent and Trademark Office, be an active member in good standing of the bar of the highest court of a State, U.S. Commonwealth, U.S. Territory, or the District of Columbia; and be admitted to practice before a state or federal court. U.S. Citizenship is a requirement of the position (affirmatively indicate citizenship in your application materials).\n\nThis vacancy will be filled under the Science and Technology Reinvention Laboratory (STRL) personnel demonstration system, which is a pay for performance system using pay bands with salary ranges. This position will be filled in the Business and Program Management Pay Band DA-03/04/05/06 (comparable to GS-11/12/13/14/15). This position has a full potential level of DA-06 (GS-15 equivalent). Pay will be set commensurate with the successful applicant's qualifications, funding availability, and STRL pay setting guidelines.\n\nTo be eligible for selection at the DA-03 (GS-11 equivalent level): the applicant must have at least one year of professional legal experience, or be a recent law school graduate with superior law student work or activities as demonstrated by: graduating in the top third of their law school class; work or achievement of significance on an official law review or journal; or a special high-level honor, e.g., winning a moot court competition, membership on the law school's official moot court team, or membership in the Order of the Coif.\n\nTo be eligible for selection at the DA-04 (GS-12 equivalent level): the applicant must have two years of relevant professional legal experience at the GS-11 (or equivalent) level or be a current GS-12 (or equivalent) attorney within the Federal government. Note that for DA-03 (GS-11 equivalent) and DA-04 (GS-12 equivalent) positions only, a second professional law degree (LL.M.) that required at least one full academic year of graduate study may be substituted for one year of professional legal experience.\n\nTo be eligible for selection at the DA-05 (GS-13 equivalent level): the applicant must have in excess of two years of successful professional legal experience.\n\nTo be eligible for selection at the DA-06 (GS-14 equivalent level): the applicant must have at least three-and-one-half years of successful professional legal experience.\n\nTo be eligible for selection at the DA-06 (GS-15 equivalent level): the applicant must have at least five-and-one-half years of successful professional legal experience.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\nEducation Requirement:\nBS or higher degree in Electrical Engineering, or other education and work experience clearly demonstrating an ability to perform the duties of the position, and particularly as those duties relate to RF communication systems technology and signal processing. Experience in software patent application preparation and prosecution of RF communication systems technology, signal processing, and software is highly desired;\nAND\nGraduated from a law school that is accredited by the American Bar Association.\r\n                                        \n\n\nAdditional information\n\nThis position is in the excepted service and does not confer competitive status.\n\nVacancies filled from this announcement may be filled at any grade level listed.\n\nIf selected below the full performance level, you may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. Promotion is neither implied nor guaranteed.\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nSeveral vacancies may be filled.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.\n\nVeteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will draft and prosecute patent applications.\nYou will review research publications for potentially patentable material.\nYou will provide litigation support for patent infringement claims.\nYou will resolve patent and copyright administrative claims.\nYou will counsel on contract and technology transfer intellectual property matters, such as rights in inventions, patents, technical data, and computer software.\n\n"}, {"jobID": "715518100", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "Program Analyst (Informatics)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/715518100", "jobLocation": {"remote": "not specified", "city": "Indianapolis", "state": "IN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 83591, "max": 108669}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\nTelework: VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\n\n\nDue to COVID-19, VA is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement. Management officials will provide information about returning to the official, pre-pandemic worksite, when applicable. At that time, you may be eligible to request to continue to telework depending upon the terms of your organization's telework policy and the duties of the position.\n\n\n Qualifications\n\r\n                                        SPECIALIZED EXPERIENCE: Applicants must possess at least one (1) year of specialized experience equivalent to the GS-11 level in the Federal service. This experience must have equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of this position, and that is typically in or related to the work of this position. Specialized experience includes: utilizing knowledge of health care, clinical systems, information management and informational technology; providing consultative support and education related to health informatics and the electronic health record and associated clinical software; evaluating, reviewing and troubleshooting the electronic health record; developing performance management tracking tools; developing implementation plans for new software releases/applications; and developing educational programs and instructional materials.\n\nPreferred Experience: Knowledge of Microsoft Share Point with ability to teach/train others; troubleshoot basic SharePoint problems with supervision; working knowledge and expertise of Custom SharePoint/Nintex Workflows; working knowledge and expertise of Custom SharePoint/Nintex Forms; understanding of JavaScript/jQuery Code solutions; basic understanding of CDW architecture, BISL and reporting software.\n\nYou will be rated on the following Competencies as part of the assessment questionnaire for this position:\nCustomer Service (Clerical/Technical)Database Management SystemsEducation and TrainingHealth InformaticsHuman Factors\n\nIMPORTANT: A full year of work is considered to be 35-40 hours of work per week. All experience listed on your resume must include the month and year start/end dates. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\nThere is no educational substitution at this grade level.\n\n\n\n\nAdditional information\n\nPhysical Requirements: The work is sedentary, however, there may be some walking, standing, bending, carrying of light items such as papers, books, small parts or driving an automobile, etc. No special physical demands are required to perform the work.\n\nReceiving Service Credit for Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities (i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities), and/or disabled veterans with a compensable service-connected disability of 30% or more. For more information on how to apply using this appointment authority via the Selective Placement Coordinator within the office, contact the facility Human Resources Department at (317) 554-0000.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation and be found well-qualified (have a final rating of 85 or more before any Veterans preference points) for this vacancy. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a VA job announcement includes language requiring applicants to be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply to this Job Announcement. VA may request information regarding your vaccination status, if selected, for the purposes of implementing other workplace safety protocols, such as masking, physical distancing, testing, travel, and quarantine.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        ***THIS IS NOT A VIRTUAL POSITION, YOU MUST LIVE WITHIN OR BE WILLING TO RELOCATE WITHIN A COMMUTABLE DISTANCE OF THE DUTY LOCATION***\n\nDuties include, but may not be limited to the following:\n\nProvides consultative support and education related to health informatics and the electronic health record and associated clinical software.\nEvaluates, reviews and troubleshoots the electronic health record.\nConsults, advises and educates employees on methods and means to make health care operations more effective and efficient.\nDevelops clinical decision support systems for uses of the electronic health record and ensures systems meet regulations.\nExtracts, analyzes and provides data to assess treatment impacts such as: clinical endpoints, health status outcomes, characteristics of treating designated populations, etc.\nDevelops performance management tracking tools.\nIntegrates knowledge of clinical and information processes to achieve successful adoption and application of new technologies to support health care operations and systems.\nCollaborates with technical, clinical and administrative staff to develop system requirements, while understanding system capabilities and limitations.\nIdentifies end-user educational requirements and training needs.\nProvides users and staff with consultative support and education.\nServes as a leader in change management, analyzing and evaluating clinical and administrative processes related to information flow.\nDevelops implementation plans for new software releases/applications and updates.\nPerform other related duties as required.\n\n\nWork Schedule: Monday - Friday, 7:00 am - 3:30 pm\n\nRecruitment & Relocation Incentives: Not authorized\n\nTelework: VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\n\nFinancial Disclosure Report: Not Required.\r\n                                    \n"}, {"jobID": "713340200", "origin_search": "https://www.usajobs.gov/", "posted": "03/16/2023", "jobTitle": "Information Technology Specialist (Systems Administration)", "companyName": "IndianHealthService", "link": "https://www.usajobs.gov/job/713340200", "jobLocation": {"remote": "not specified", "city": "Gallup", "state": "NM", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 83634, "max": 108724}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nSelectee may be subject to a probationary/trial period\nESEP appointees typically serve a two year trial period\nU.S. Citizenship is required\nSelective Service Registration is required for males born after 12/31/1959\n\nYou will need to set up direct deposit so we can pay you.\n\nThis is a designated position covered by Public Law 101-630, requiring contact or control over Indian children. Due to this requirement, the agency must ensure that persons hired for these positions have not been found guilty of or pleaded nolo contendere or guilty to certain crimes.\n\nConfidential Financial Disclosure Form required.\n\nMeasles and Rubella immunization required for selectees born after 1957 and seasonal influenza immunization is required for all staff working in Indian Health Service health care facilities.\n\nCOVID-19 vaccination is required for all selectees prior to entrance on duty.\n\nYou may be required to wok on a regular assigned basis; however, also may be required to be on call back, or to work second or third shift when necessary. \n\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.\n\nBackground Investigation: If you are selected for this vacancy, you must undergo a pre-employment fingerprint check and background investigation. Fingerprint results and background investigation documentation must be cleared prior to hire. After you begin your employment, your continued employment is contingent upon the outcome of a complete background investigation as determined by the sensitivity level of your position. The investigation must find that you are suitable for Federal employment in your position. If you are found not suitable, you will be terminated after you begin work. If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or subject to possible criminal charges. You may be subject to a credit check as a part of the background investigation process.\r\n                                    \n\n Qualifications\n\r\n                                        To qualify for this position, your resume must state sufficient experience and/or education, to perform the duties of the specific position for which you are applying.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; social). You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nBASIC REQUIREMENT(S):\nEducation: All academic degrees and coursework must be from accredited or pre-accredited institutions\nUndergraduate or Graduate Education: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\nExperience: Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate.\nGS-5 through GS-15 (or equivalent): For all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nIn addition to the Basic Requirements, you must also meet the Minimum Qualifications stated below.\n\nMINIMUM QUALIFICATIONS:\nGS-12: Your resume must demonstrate at least one (1) year of specialized experience equivalent to at least the next lower grade level in the Federal service obtained in either the private or public sector performing the following type of work and/or tasks: Work experience for RPMS Admin is ensemble experience: not limited to setup & configure, create ensemble users, configure instances, etc.; AIX experience: not limited to creating AIX users, ability to navigate with AIX commands, comfortable with changing routines & globes, etc.; setup RPMS printers, install RPMS patches, load client installs, load fee schedules; general knowledge, comfortable and experience working with all RPMS packages; working with implementing RPMS Interfaces for difference programs; general knowledge of Radiology/Dentrix/lab/optometry/pharmacy equipment; knowledge in RPMS Backup, system restore; and be able to work with Tier 2, and Tier 3 support.\n\nTime In Grade\nFederal employees in the competitive service are also subject to the Time-In-Grade Requirements: Merit Promotion (status) candidates must have completed one year of service at the next lower grade level. Time-In-Grade provisions do not apply under the Excepted Service Examining Plan (ESEP).\n\nYou must meet all qualification requirements within 30 days of the closing date of the announcement. \n\n\n\nEducation\n\r\n                                            This position has an education requirement. You are strongly encouraged to submit a copy of your transcripts or a list of your courses including titles, credit hours completed, and grades. Unofficial transcripts will be accepted in the application package. Official transcripts will be required from all selectees prior to receiving an official offer.\n\nOnly attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education may be credited. Applicants can verify accreditation at the following website: https://www.ed.gov/accreditation.\n\nIf you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nPer IHS policy (SGM 21-04) IHS selectees to positions located in Federally operated hospitals, health centers, and clinics must be fully vaccinated for COVID-19 before entry on duty or have IHS approve a medical or religious exemption. If an exemption is approved then wearing a face mask and regular testing for COVID-19 will be required. Your Human Resources Specialist will provide a list of documents acceptable as vaccination proof and instructions on how to submit your vaccination documentation or how to request a medical or religious exemption, if needed.\n\nThis position is eligible for workplace flexibilities which may include remote work or telework options, and/or flexible work scheduling. These flexibilities may be requested in accordance with the HHS Workplace Flexibilities policy. https://www.hhs.gov/about/agencies/asa/ohr/hr-library/990-1/index.html.\n\nAdditional selection(s) of candidates may be possible within 240 days from the date the certificate of eligibles was issued for this announcement.\n\nFederal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. IHS may offer newly-appointed Federal employees credit for their directly related previous non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave.\n\nThis position is covered by a Bargaining Unit.\nNo recruitment or relocation incentives authorized.\nThis position has no promotion potential.\nNo government housing. \n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nServes as primary contact regarding the Service Unit Resource Patient Management System (RPMS), and Electronic Health Record (EHR) systems including hardware, software, and application programs. Determines what support system software is required, performs, feasibility studies, advises supervisor of the benefits of (and resources needed for) alternate approaches, and recommends a course of action.\nInitiates, designs, and conducts feasibility studies to determine optimal approaches for the application of information technology to the support of the Service Unit health care delivery and management.\nProvides technical support and consultation to Service Unit users and management to achieve the implementation of new applications and the maintenance of previous applications. This includes maintaining the current installation of RPMS Alpha, Beta, and/or the latest version of released patches.\nProvides technical support and maintenance for Windows 2008, 2012 and Unix AIX servers to achieve the implementation of upgraded applications, database files, users files, and installation of network printers.\nProvides technical support, maintenance and administration for RPMS servers, new RPMS servers, VMWare virtual servers/desktops, printers, print servers, networking equipment, etc\n\n\n"}, {"jobID": "713988700", "origin_search": "https://www.usajobs.gov/", "posted": "03/20/2023", "jobTitle": "Information Technology Specialist (SysAdm)", "companyName": "FederalEmergencyManagementAgency", "link": "https://www.usajobs.gov/job/713988700", "jobLocation": {"remote": "not specified", "city": "RoundHill", "state": "VA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 94199, "max": 122459}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. citizen to apply for this position.\nYou must successfully pass a background investigation.\nSelective Service registration required.\nCurrent federal employees must meet time-in-grade requirements.\nYou must be able to obtain and maintain a Government credit card.\nPlease review \"Other Information\" section for additional key requirements.\n\n\nTo ensure the accomplishment of our mission, DHS requires every employee to be reliable and trustworthy. To meet those standards, all selected applicants must undergo, successfully pass, and maintain a background investigation for a TOP Secret/SCI clearance as a condition of placement into this position. This may include a credit check after initial job qualifications are determined, a review of financial issues, such as delinquency in the payment of debts, child support and/or tax obligations, as well as certain criminal offenses and illegal use or possession of drugs (please visit: Mythbuster on Federal Hiring Policies for additional information). For more information on background investigations for Federal jobs please visit OPM Investigations.\nPlease ensure you meet the qualification requirements described below.\n\n\n Qualifications\n\nCurrent Federal employees must have served 52 weeks at the next lower grade or equivalent grade band in the Federal service. The time-in-grade and qualification requirements must be met within 30 days of the closing date of this announcement.\nYou qualify for this position at the GS-12 level (starting salary $94,199) if you possess the following: One full year of specialized experience equivalent to the next lower grade (GS-11) in the Federal Service. This experience may have been gained in the federal government, a state or local government, a non-profit organization, the private sector, or as a volunteer; however, your resume must clearly describe at least one year of specialized experience. Specialized experience for this position includes: \n\nPlanning the delivery and maintenance of software applications AND;\nTesting, implementing, and maintaining new or modified hardware and software environments (e.g. Microsoft Windows, RCC Client Software, Image servers) AND;\nIdentifying vulnerabilities with system performance, availability, and/or recoverability.\n\nAND\nIn addition to the minimum qualifications described above (specialized experience statement), you must have IT-related experience demonstrating each of the four competencies listed below:\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, considering the audience and nature of the information; makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g. Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills, and provides valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.NOTE: Qualifications are based on breadth/level of experience. In addition to describing duties performed, applicants must provide federal grade levels to positions listed in Federal Government; the exact dates of each period of employment (from MM/YY to MM/YY) and the number of hours worked per week if part time. As qualification determinations cannot be made when resumes do not include the required information, failure to provide this information will result in disqualification. Applicants are encouraged to use the USAJOBS Resume Builder to develop their federal resume. For a brief video on How to Create a Federal Resume, click here.Current or former FEMA Reservists/DAE employees: To accurately credit your experience for these intermittent positions, make sure to list the dates (from MM/YY to MM/YY) of each deployment, along with the job title and specific duties you were responsible for during each deployment.  Failure to provide this information may result in disqualification.The Office of Personnel Management (OPM) must authorize employment offers made to current or former political appointees.  If you are currently, or have been within the last 5 years, a political Schedule A, Schedule C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office. \n\n\n\nEducation\n\r\n                                            This job does not have an education qualification requirement.\r\n                                        \n\n\nAdditional information\n\n\nIf you receive a conditional offer of employment for this position, you will be required to complete an Optional Form 306, Declaration for Federal Employment, and to sign and certify the accuracy of all information in your application, prior to entry on duty. False statements on any part of the application may result in withdrawal of offer of employment, dismissal after beginning work, fine, or imprisonment.\nDHS uses E-verify, an internet based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about E-Verify, including your rights and responsibilities.\nThe Department of Homeland Security encourages persons with disabilities to apply, to include persons with intellectual, severe physical or psychiatric disabilities, as defined by 5 CFR § 213.3102(u), and/or Disabled Veterans with a compensable service-connected disability of 30 percent or more as defined by 5 CFR § 315.707. Veterans, Peace Corps/VISTA volunteers, and persons with disabilities possess a wealth of unique talents, experiences, and competencies that can be invaluable to the DHS mission. If you are a member of one of these groups, you may not have to compete with the public for federal jobs. To determine your eligibility for non-competitive appointment and to understand the required documentation, click on the links above or contact the Servicing Human Resources Office listed at the bottom of this announcement.\nThis announcement may be used to fill one or more vacancies.\nAll candidates must be able to deploy with little or no advance notice to anywhere in the United States and its territories for an extended period of time.\nA one year probationary period is required for new Federal competitive service employees and new supervisors and managers. \nIf selected for this position, and you have not previously completed these requirements, you are subject to (1) completion of a 2 day onboarding program at your primary duty location; and, (2) completion of a subsequent, multiple day orientation program within 90-120 days of hire, at a location to be determined.  Travel associated with the orientation portion of this requirement may be at FEMA’s expense.\nThis is a Non-Bargaining Unit position.\nDue weight will be given to performance appraisals and incentive awards in merit promotion selection decisions in accordance with 5 CFR 335.103(b)(3).\nApplying to this announcement certifies that you give permission for DHS to share your application with others in DHS for similar positions.\nIf this position has been identified as a Testing Designated Position (TDP) because of its security, public health, and/or public safety sensitivity, you are subject to random drug testing under FEMA's Drug-Free Workplace Plan (DWP). Refusal to be tested will result in disciplinary action up to and including removal from federal service. \n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \nDHS offers competitive salaries and an attractive benefits package, including: health, dental, vision, life, and long-term care insurance; retirement plan; Thrift Savings Plan [similar to a 401(k)]; Flexible Spending Account; Employee Assistance Program; personal leave days; and paid federal holidays. Other benefits may include: flexible work schedules; telework; tuition reimbursement; transportation subsidies; uniform allowance; health and wellness programs; and fitness centers. DHS is committed to employee development and offers a variety of employee training and developmental opportunities. For more information, go to the DHS Careers website and select Benefits. Disabled veteran leave will be available to any Federal employee hired on or after November 5, 2016, who is a veteran with a service-connected disability rating of 30 percent or more.\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThe Department of Homeland Security (DHS) is calling on those who want to help protect American interests and secure our Nation. DHS Components work collectively to prevent terrorism; secure borders and our transportation systems; protect the President and other dignitaries; enforce and administer immigration laws; safeguard cyberspace; and ensure resilience to disasters. We achieve these vital missions through a diverse workforce spanning hundreds of occupations. Make an impact; join DHS.\nWhen disaster strikes, America looks to the Federal Emergency Management Agency (FEMA). Now FEMA looks to you. Join our team and use your talent to support Americans in their times of greatest need. FEMA prepares the nation for all hazards and manages Federal response and recovery efforts following any national incident. We foster innovation, reward performance and creativity, and provide challenges on a routine basis with a well-skilled, knowledgeable, high performance workforce. Please visit www.fema.gov for additional information.EMERGENCY ASSIGNMENT: Every FEMA employee has regular and recurring emergency management responsibilities, though not every position requires routine deployment to disaster sites. All positions are subject to recall around the clock for emergency management operations, which may require irregular work hours, work at locations other than the official duty station, and may include duties other than those specified in the employee's official position description. Travel requirements in support of emergency operations may be extensive in nature (weeks to months), with little advance notice, and may require employees to relocate to emergency sites with physically austere and operationally challenging conditions.In this position, you will serve as an IT Specialist (SYSADMIN) responsible for planning and coordinating the installation, testing, operation, troubleshooting and maintenance of hardware and software systems. Typical assignments include: \n\nPlanning and scheduling the installation of new or modified hardware and software operating systems and applications.\nManaging systems accounts, network rights, and access to systems and equipment, system resources, installation and integrations of system fixes, updates and enhancements.\nDeveloping, documenting, and implementing systems administration standard operating procedures, security procedures and tools.\nResolving of hardware/software interface and interoperability problems and maintenance of system configuration.\nDeveloping test data and appropriate testing procedures; providing analysis and evaluation reports.\n\nPromotion Potential: Future promotions will be dependent on your ability to perform the duties at a higher level, the continuing need for an employee assigned to the higher level, and administrative approval. \n\n"}, {"jobID": "714496100", "origin_search": "https://www.usajobs.gov/", "posted": "03/23/2023", "jobTitle": "IT SPECIALIST (APPSW)", "companyName": "DefenseFinanceandAccountingService", "link": "https://www.usajobs.gov/job/714496100", "jobLocation": {"remote": "not specified", "city": "Indianapolis", "state": "IN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 82830, "max": 112477}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship or National\nSuitable for Federal Employment\nRegistered for Selective Service (if applicable)\nThis national security position, which may require access to classified information, requires a favorable suitability review and security clearance as a condition of employment. Failure to maintain security eligibility may result in termination.\n\n\n Qualifications\n\r\n                                        Resumes for federal government positions need more detailed work descriptions and accomplishments than a typical private sector resume. Please be sure to clearly describe the full scope of your work experiences in your resume.\n\nBasic Requirement: Applicants must have IT-related experience demonstrating the following competencies appropriate to, or above, the level of this position. Your resume and work experience should clearly support your ability to meet these competencies and will be evaluated as part of the entire application process.\n\nAttention to Detail- experience reviewing my own information technology-related work or data and have been asked by others to review their work or data to ensure accuracy, completeness, and consistency with standards\nCustomer Service- experience maintaining relationships with customers, assessing current information technology needs of customers, and developing or identifying information technology products and services that are tailored to meet customer needs\nOral Communication- briefing mid-level management and IT staff on the status of information technology systems, projects, or daily operations, including the communication of technical information to a non-technical audience\nProblem Solving- identifying alternatives to address complex information technology-related issues by gathering and applying information from a variety of sources that provide a number of potential solutions\n\nIn addition to the Basic Competency Requirements listed above, one year of specialized experience equivalent in level of difficulty and responsibility to that of the next lower grade (GS-11) in the federal service, which demonstrates the ability to perform the duties of the position, is required.\n\nSpecialized experience is defined as evaluating and customizing software for Automated Information Systems; supporting all functions of the life cycle of IT systems to include development, implementation, operation, and modification of automated information systems and software; participating in system requirement reviews and testing; and providing advice and counsel to functional analysts on the capabilities of a specific system and/or application; experience with: Common Business Oriented Language (COBOL) and/or Integrated Database Management System (IDMS).\n\nVolunteer Experience: Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nEducation is not substitutable for specialized experience at this grade level.\n\n\n\nAdditional information\n\n\nCOVID-19 WORKPLACE SAFETY PROTOCOLS: To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the COVID-19 vaccination mandate is not presently being enforced as a condition of employment for this position.\nMoving expenses will be paid.\nTelework availability will be based upon the mission requirements and supervisory determination.\nSelections are subject to restrictions resulting from the DoD Program for Stability of Civilian Employment.\nEmployment with DFAS means access to generous benefits such as: health, vision, and dental insurance, retirement benefits, paid time off, and educational benefits.\nA one year probationary period may be required.\nWe may use this announcement to fill additional vacancies within 90 days of the closing date.\nThis position is Exempt from the Fair Labor Standards Act.\nTravel requirement is occasional\nThis position is covered by a bargaining unit.\nThis position is being filled under the Direct Hire Authority for Certain Personnel of the Department of Defense via delegated authority by the Office of the Secretary of Defense. Positions may be filled as permanent or term with a full-time or part-time work schedule. Pay will vary by geographic location. We reserve the right to close this announcement early or to extend, as appropriate, based upon the needs of the Agency. Qualified application packages may be referred to management at various points in the selection process depending on the number and timing of applications received. Selections may be made at any point during the announcement open period.\nVeteran's Preference: Veteran's preference does not apply under this Direct Hire Authority (DHA).\nDFAS recognizes the value of competencies gained through formal education and professional certifications. To ensure that consistent credit is given for these credentials in the selection process DFAS has developed standard selection criteria to be used when filling positions in professional and administrative series. Selections for professional and administrative positions will be based on four categories of selection criteria: Experience, Other, Education, and Certifications.\nMales born after 12-31-59 must be registered or be exempt from Selective Service (see http://www.sss.gov).\nRetired Civil Service Employee: Employment of retired Federal employees receiving an annuity is subject to the requirements of the Department of Defense (DoD) policy guidance. (See DoD Instruction 1400.25, Volume 300, here).\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAnalyzes functional and technical requirements of proposed or existing IT systems to determine avenues of development or modification necessary to meet mission objectives.\nParticipates in systems requirement reviews and coordinates with customer/functional representatives and other technical personnel to clarify requirements.\nPrepares system change/programming specifications, and specifies programming instructions, inputs and outputs, structures, and other analytical products to document the functional and technical requirements.\nIdentifies alternative approaches to the design of current or proposed systems.\nPrepares and executes tests for system or subsystem software validation.\n\n"}, {"jobID": "714845800", "origin_search": "https://www.usajobs.gov/", "posted": "03/23/2023", "jobTitle": "Dietitian (Informatics)", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/714845800", "jobLocation": {"remote": "not specified", "city": "JohnsonCity", "state": "TN", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 46696, "max": 89835}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job.\nSelective Service Registration is required for males born after 12/31/1959.\nMust be proficient in written and spoken English.\nYou may be required to serve a probationary period.\nSubject to background/security investigation.\nSelected applicants will be required to complete an online onboarding process.\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP).\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\nBasic Requirements:\n\nUnited States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.\nRegistered Dietitian Nutritionist (RDN) or Registered Dietitian (RD) - Must be registered with the Commission on Dietetic Registration (CDR) the credentialing branch of the Academy of Nutrition and Dietetics formerly known as the American Dietetic Association (ADA).\n\t\nException for GS-07 and GS-09 Only: Dietitians who do not possess the RDN/RD credential. Non-credentialed Dietitians who otherwise meet the basic qualification requirements and have fulfilled the requirements below, but do not possess the RDN credential, may be given a full-time temporary appointment not to exceed one year under the authority of 38 U.S.C. § 7405(c)(2). May only be appointed at the GS-07 or GS-09 level and may not be promoted/converted until they obtain their RDN credential.\n\t\t\nNon-credentialed Dietitians must have fulfilled each of the following:\n\t\t\t\nEarned a bachelor's or higher degree from a U.S. regionally accredited college or university or foreign equivalent. Foreign Education: To be creditable, college and/or university degrees earned outside the U.S and its territories must be evaluated by ACEND® and meet ACEND®'s International Dietitian Education standards which are designed to provide graduates with the knowledge and competencies to sit for the CDR credentialing exam. ~AND~\nCompleted an ACEND® accredited experiential or supervised practice program and provide a verification statement from the program director that conveys eligibility to take the CDR registration exam as a prospective RDN. A list of ACEND® accredited programs are located on the ACEND® website or at ACEND Accredited Programs Directory.\n\n\n\n\n\n\n\nCurrent VHA Dietitians that qualify based on being covered by the Grandfathering Provision may not be promoted to a higher grade if they do not meet the current RDN/RD requirements.\n\nGrade Determinations:\nEntry Level GS-7; none beyond basic requirements listed above.\n\nExperience at the GS-9 grade level; Experience or Education:\nAt least 1 year of experience equivalent to the next lower grade level (GS-7) Or possess a Masters degree from a regionally accredited university or college in the field of dietetics or closely related field.\nIn addition to qualify for the GS-09 ability to demonstrate the following Knowledge, Skills and Abilities.\n-Knowledge of nutritional standards and requirements.\n-Ability to manage computer software programs relative to food service systems.\n-Ability to develop training and reference materials.\n-Ability to evaluate data to improve outcomes.\n-Ability to provide training related to food service systems technology.\n-Ability to collaborate with stakeholders.\n\nExperience at theGS-11 Dietitian (Informatics) (Full Performance Level) Experience Requirement:\nAt least 1 year of experience as an RDN/RD equivalent to the next lower grade level (GS-09) which demonstrates the following Knowledge, Skills and Abilities.\n- Skill in managing computer software programs relative to food service systems.\n- Skill in applying nutritional knowledge to develop menus ensuring nutritional standards are met.\n- Skill in developing training and reference materials.\n- Skill in evaluating data to improve outcomes.\n- Skill in providing training related to food service systems technology.\n- Skill in collaborating with stakeholders.\n\nPreferred Experience:\nThe Informatics Dietitian is the subject matter expert responsible for Nutrition and Food Services (NFS) computer systems. This position manages VHA supported software programs and/or Commercial off the Shelf Systems (COTS) that focus in Nutrition and Food Services to include food production & food service operations; training and education of computer systems; collection and analysis of data, such as customer experience surveys, nutrient analysis, staffing and workload statistics. The Informatics Dietitian is responsible for solicitation, evaluation and recommendation of COTS software; integration, training and alignment of technology functions throughout the section. The position is responsible for planning, coordinating, implementing and evaluating informatics within the service. The Informatics Dietitian works in collaboration with the NFS management team, supervisors, and staff in supporting NFS program goals and facility mission. Coordinates integration of administrative and clinical nutrition activities within the department and other services and units, clinics and local community.\n\nReferences: VA Handbook 5005 Part II Appendix G20The full performance level of this vacancy is GS-11.\n\nPhysical Requirements: The position requires intermittent walking and standing. Carrying normal amounts of written/reference materials is routinely done. Occasionally, duties may require the movement of audio-visual equipment, charts and arrangement of classroom areas.\r\n                                    \n\n\nEducation\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\n\nACEND® accredited programs are located on the ACEND® website or at ACEND Accredited Programs Directory.\r\n                                        \n\n\nAdditional information\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nThis position is in the Excepted Service and does not confer competitive status.\n\nVA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38, and are not covered by the Schedule A excepted appointment authority.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Informatic Dietitians are thoroughly knowledgeable of and responsible for planning, coordinating, and implementing food service technology as well as ensuring continuous evaluation and improvement within the service.\n\nMajor duties include but are not limited to:\n- Uses available technology to enhance the work of all employees within NFS.\n- Manages VHA supported software programs and/or commercial off-the-shelf software (COTS) to support the effective management of food operations and patient meal services.\n- Enters and maintains ingredients, recipes, nutritional information and menus.\n- Oversees the technology used for meal production, meal service and temperature control.\n- Leads a menu committee.\n- Ensures recipes are standardized.\n- Costs out recipes and assures that they are within budgetary constraints.\n- Creates and revises menus, considering VA established guidelines, policy, patient preference, and religious and cultural considerations.\n- Completes nutrient analyses of regular and modified menus and ensures menus follow required diet guidelines.\n- Develops and maintains training and reference materials for the Nutrition Communication Center (NCC).- Manages productivity reports for the NCC.\n- Completes audits for the NCC, determining action plans when results require corrective measures.\n- Coordinates and supports downtime procedures for the NCC, ensuring procedures remain up to date.\n-Coordinates all aspects of training related to computer systems, menus and informatics for NFS employees.\n- Collaborates with the clinical nutrition section and leadership to ensure the enhancement of the Veterans dining experience.\n- Supports patient satisfaction within NFS.\n- Acts as a department Automated Data Processing Application Coordinator (ADPAC) between administration, food services, clinical staff, and the Office of Information Technology (Ol&T) regarding clinical information system processes.\n- Manages and updates the service SharePoint site.\n- May perform other related duties as assigned which are appropriate for this grade and assignment.\n\nWork Schedule: Potential tour of duties include 7:00 am to 3:45 pm, 7:15 am to 4:00 pm, 7:45 am to 4:30 pm. The service is open to Compressed tours of duty as long as the needs of the service is met.\n\nCompressed/Flexible:Eligible at the needs of the service\nTelework: Available at the needs at the hiring service\nVirtual: This is not a virtual position.\nFunctional Statement #: PD99526S\nRelocation/Recruitment Incentives: Not authorized\nPermanent Change of Station (PCS): Not authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "713211000", "origin_search": "https://www.usajobs.gov/", "posted": "03/17/2023", "jobTitle": "CLERK", "companyName": "AirForceMaterielCommand", "link": "https://www.usajobs.gov/job/713211000", "jobLocation": {"remote": "not specified", "city": "EdwardsAFB", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 39012, "max": 50715}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMust be registered for Selective Service, see Legal and Regulatory Guide\nThis posn is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nCategory rating and selection procedures will be utilized\nVeterans must submit required documents to receive Veteran's preference\nPosition to be filled through Delegated Examining Authority\nSECURITY CLEARANCE:  INCUMBENT MUST BE ABLE TO OBTAIN AND MAINTAIN AN APPROPRIATE LEVEL SECURITY CLEARANCE AS A CONDITION OF EMPLOYMENT.\nA qualified typist is not required.\nPHYSICAL EFFORT: The work is sedentary. May require some walking, standing, bending, carrying and/or lifting of light items like papers or books. No special physical demands are required to perform the work.\nWORKING CONDITIONS:  The work is performed in a typical office setting, requiring the use of normal safety precautions necessary for an office environment. The work area is adequately lighted, heated, and ventilated.\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the general experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support Positions.\n\nONLY EXPERIENCE OBTAINED BY THE CLOSING DATE OF THIS ANNOUNCEMENT WILL BE CONSIDERED.\n\nGENERAL EXPERIENCE:  Applicants must have one year of general experience at a level close to the work of this position. Typically, we would find this experience in work within this field that is closely related. General experience is described as progressively responsible clerical, office, or other work that indicates the ability to acquire the particular knowledge and skills to perform the duties of this position.\n\nOR EDUCATION SUBSTITUTION:  Applicant must have successfully completed 2 years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college or university. This education must have been obtained in an accredited institution. NOTE: YOU MUST SUBMIT COPIES OF YOUR UNOFFICIAL TRANSCRIPTS WITH YOUR APPLICATION IF USING EDUCATION AS A SUBSTITUTION OF EXPERIENCE.\n\nOR COMBINING EDUCATION AND EXPERIENCE: Applicants must have equivalent combinations of successfully completed post-high school education and experience that may be used to meet total experience requirements. NOTE: YOU MUST SUBMIT COPIES OF YOUR UNOFFICIAL TRANSCRIPTS WITH YOUR APPLICATION PACKAGE WHEN USING EDUCATION SUBSTITUTION FOR EXPERIENCE.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of word processing automation software functions to support office operations and produce a variety of textual documents, such as letters, reports, memos, and form letters.\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\n3. Knowledge of rules, procedures, or operations applied to clerical assignment to perform the routine, procedural work of the office, such as preparing and editing documents, maintaining files/records, screening telephone calls and visitors, and processing mail.\n4. Knowledge of filing systems and procedures and the subject matter content of the materials being processed.\n5. Ability to locate, assemble, and compose routine, nontechnical information for recurring reports and inquiries.\n\nAGE REQUIREMENT:\n(1) Applicants must be at least 18 years of age, OR (2) at least 16 years of age AND (a) have graduated from high school or been awarded a certificate equivalent to graduating from high school; or (b) have completed a formal vocational training program; or (c) have received a statement from school authorities agreeing with their preference for employment rather than continuing their education; or (d) be currently enrolled in a secondary school and work ONLY during school vacation periods. \n\nIF YOU ARE YOUNGER THAN 18 YEARS OF AGE AND ARE APPLYING FOR THIS ANNOUNCEMENT UNDER ONE OF THE ABOVE CONDITIONS, YOU MUST PROVIDE PROOF THAT YOU MEET ONE OF THE ABOVE CRITERIA AT THE TIME YOU APPLY.  FAILURE TO DO SO WILL RESULT IN AN INELIGIBLE RATING.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nA list of eligible candidates is being established and may be used to fill multiple vacancies for a period of 6 months (or more).\n\nIMPORTANT NOTE:  THESE POSITIONS WILL BE FILLED TEMPORARY NOT TO EXCEED 30 SEPTEMBER 2023. A temporary appointment does not confer eligibility for noncompetitive movement to other positions or for reappointment after separation from employment. If you are an employee on a temporary appointment (appointment limited to one year or less); and you are expected to work 130 hours per month and for at least 90 days, you are eligible to enroll in Federal Employee Health Benefits (FEHB) with a full government contribution, provided you are not covered under the Part-time Career Act. Temporary employees are not eligible to participate in the Thrift Savings Plan.\n\nInteragency Career Transition Assistance Program (ICTAP):  For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\nTemporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current Federal Civilian employees may apply for temporary and term positions and if selected, a break in service may be required prior to appointment to the position.\n\nSelective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11888826\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        -Use varied and advanced functions of word processing software to create, format, modify, edit, and print a variety of letters, reports, memos, and other textual documents.\n-Prepare a wide variety of recurring correspondence, internal reports, and other documents from information obtained from the staff, files, and other sources and review and finalize documents prepared by others.\n-Review and process incoming and outgoing correspondence, materials, publications, regulations, and directives.\n-Receive and direct telephone calls or visitors.\n-Establish, update, and maintain office records of various types that may be needed or will assist in the efficient operation of the office.\r\n                                    \n"}, {"jobID": "712568700", "origin_search": "https://www.usajobs.gov/", "posted": "03/14/2023", "jobTitle": "Aviation Technical Systems Specialist", "companyName": "FederalAviationAdministration", "link": "https://www.usajobs.gov/job/712568700", "jobLocation": {"remote": "not specified", "city": "Oberlin", "state": "OH", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 87526, "max": 1356512169}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nUS Citizenship is required.\nSelective Service Registration is required for males born after 12/31/1959.\nMust submit an SF50 (See Required Documents)\n\n\n Qualifications\n\nTo qualify for this position you must demonstrate in your application that you possess at least one year of specialized experience equivalent to FV-H, FG/GS-10-12. Specialized experience is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position.Specialized experience is: Experience with aviation computer systems and software analysis programs in support of the National Airspace System, to include performing analysis and testing of automation systems adaptation.Applicants should include examples of specialized experience in their work history.Qualifications must be met by the closing date of this vacancy announcement.If the Agency decides to interview any qualified employee on the selection list, then all on the list who are qualified must be interviewed. If the selection list is shortened to a best qualified list through a comparative process, then the best qualified list shall be considered to be the selection list.\n\n\n\n\r\n                                            Preview Job Questionnaire\r\n                                        \n\r\n                                            Make sure your resume includes detailed information to support your qualifications and answers to the job questionnaire.\r\n                                        \n\n\nAdditional information\n\nWe may use this vacancy to fill other similar vacant positions.Position may be subject to a background investigation.A one-year probationary period may be required.The person selected for this position may be required to file a financial disclosure statement within 30 days of entry on duty. FAA policy limits certain outside employment and financial investments in aviation-related companies. www.faa.gov/jobs/working_here/financial_disclosure_requirementsThe U.S. Department of Transportation strives to ensure that equity, transparency, accountability, collaboration, and communication permeate all that we do for the betterment of the Department, the traveling public, and our nation. As such, DOT values a highly diverse workforce of persons who promote a culture of belonging by respecting the personal dignity and worth of each individual and fostering a positive environment where all feel safe and welcome. If these commitments coincide with your personal ideals and professional aspirations, please consider joining the DOT family.As a part of the Federal-Wide Hiring Reform Initiative (streamlining the hiring process), the FAA is committed to eliminating the use of the Knowledge, Skills and Ability (KSA) narratives from the initial application in the hiring process for all announcements. Therefore, as an applicant for this announcement, you are NOT required to provide a narrative response in the text box listed below each KSA.\n\nIn lieu of providing a KSA narrative response in the text box listed below each KSA, in your work history, please include information that provides specific examples of how you meet the response level or answer you chose for each KSA. Your work history examples should be specific and clearly reflect the highest level of ability. Your KSA answers will be evaluated further to validate whether the level that you selected is appropriate based on the work history and experience you provided. Your answers may be adjusted by a Human Resource Specialist as appropriate.Eligible applicants meeting the minimum qualification requirements and selective factor(s), if applicable, may be further evaluated on the KSAs listed in the announcement. Based on this evaluation, applicants will be placed in one of the following categories: score order, category grouping, or alphabetical and referred to the selecting official for consideration.Please ensure you answer all questions and follow all instructions carefully. Errors or omissions may impact your rating or may result in you not being considered for the job.This is a bargaining unit position. This position is represented by NATCA: Automation Specialists.Links to Important Information: Locality Pay , COLA \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThe Specialist applies technical knowledge of NAS equipment, procedure, and safety interventions, in order to design, develop, modify and evaluate the NAS. Participates in inter-disciplinary technical teams which design, develop, modify, or evaluate the NAS. Applies multidisciplinary and interdisciplinary scientific principles, qualitative methods, and modeling to study and analyze complex NAS systems and programs, to provide alternative courses of action in the acquisition, management, and deployment of major aviation-related systems or programs.The Specialist participates as a technical team member and is responsible for supporting the oversight and analysis of all facets of the automation systems related to Air Traffic Control (ATC) activities within the facility. This position supports multiple, varying, and complex assignments under the direction of a Field Manager, project manager, team leader, or more experienced technical specialist. The Specialist provides support to a project team leader for large work activities. Typical duties include (1) performing required research to identify, analyze, and resolve operational automation discrepancies; (2) ensuring the adequacy of automation support based on knowledge of air traffic control procedures and a general knowledge of facility traffic flows; (3) developing, maintaining, testing, and modifying adaptation databases to ensure that maximum effectiveness is achieved and that data is processed in a precise and timely manner; (4) coordinating with staff at local and other air traffic facilities regarding automation decisions and activities that could impact operations.The Specialist alerts management or team lead of potential problems, issues, or concerns that could cause an operational impact to current and future systems. Works continuously with second level engineering personnel and appropriate levels of management to provide information and data with respect to national system planning, configuration management, and technological considerations and adaptations that have a major impact on air traffic.The Specialist participates on special and projects or teams to evaluate the effectiveness of automation and aviation services. Performs technical analysis, documentation, and related tasks in direct support of the air traffic operations. Provides technical assistance to operational personnel for the resolution of aviation system malfunctions.Contacts are internal and external. The Specialist communicates with Technical Operations, Air Traffic representatives, and the National Adaptation Team to analyze software and adaptation requirements and to support second level engineering activities. May coordinate air traffic software adaptation changes and requirements with multiple air traffic control facilities, military base operations, airlines and international air traffic control organizations. Communicates results to all levels internally and externally. Contributes to the preparation of reports or technical documents.The Specialist works at a field site with direction and guidance provided by the Second Level Engineering Field Manager. The Specialist works in a team environment and works with a team lead or manager to support the decisions related to the maintenance of adaptation and software systems critical to the safe operation of the NAS. The work is reviewed periodically, typically at major milestones and at completion, for technical compliance and alignment with the requirements of the project or other work activity.\n\n"}, {"jobID": "699796500", "origin_search": "https://www.usajobs.gov/", "posted": "01/13/2023", "jobTitle": "IT Specialist", "companyName": "DeputyAssistantSecretaryforInformationandTechnology", "link": "https://www.usajobs.gov/job/699796500", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 99908, "max": 129878}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. citizen to apply for this job.\nSelectees are subject to a background/suitability investigation.\nDesignated and/or random drug testing may be required\nSelectees may be required to serve a probationary period.\nSelective Service Registration is required for males born after 12/31/1959.\nA complete application package, i.e., Resume, Transcripts, etc., as required by the job announcement.\nSelected applicants will be required to complete an online onboarding process.\nParticipation in the Seasonal Influenza Prevention Program for VHA Health Care Personnel (HCP) is a requirement for all Department of Veterans Affairs HCP.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nMust be proficient in written and spoken English.\nPre-employment physical evaluation may be required.\n\n\n Qualifications\n\nPlease read this public notice in its entirety before submitting your application. Vacancies may not presently exist but may become available at any point during the opening period of this vacancy announcement. We will not review applicant resumes until there is a request to fill a vacancy.\n\nYou are applying to a public notice to fill current and future vacancies. Please note, that there may or may not be actual/projected vacancies when you submit your application. Your resume and supporting documentation will be retained with other applicants and reviewed as vacancies occur. You will not receive a notice regarding your application's status other than the initial acknowledgment until a request is received to fill a position.\n\nThis announcement will remain open until the December 29, 2023. The cut-off date is January 20, 2023, OR the point at which the first 100 applications are received, whichever comes first.  Due to the potential of a high volume of applicants, not all applicants may receive consideration.\n\nAfter the initial cut-off period, once additional requests to fill a vacancy are received, applications will be reviewed in increments of 100 applications in date order.\n\nNote: Submitting multiple applications will change the order in which your application is reviewed.\n\nWe will refer qualified applicants to the selecting official for consideration. The organization's hiring needs will determine the referral of additional applicants. Applicants will be notified about their application's status if referred or if we fill all vacancies.\n\nThis position is primarily aligned to the following NICE Cybersecurity Workforce Framework work roles:\n\nOPM Cyber Code 801 - Program Manager\n\nFor more information about these work roles, where they fit within the larger Cyber Workforce, and how they can support your unique career journey, please visit the Cyber Career Pathways tool on the National Initiative for Cybersecurity Careers and Studies website:https://niccs.us-cert.gov/workforce-development/cyber-career-pathways\n\nYou may qualify based on your experience as described below.\n\nExperience - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate.\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nAND\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-13 in the normal line of progression for the occupation in the organization. Specialized experience is defined as experience with leading, coordinating, and ensuring the overall success of an IT program or products; ensuring alignment with agency priorities; and lifecycle management.\n\nSuch experience is typically gained in the IT field or through the performance of work where the primary concern is IT.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nPer Office of Personnel Management General Schedule Qualification Policies, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not normally be part of the employee's position is creditable when documented by satisfactory evidence (e.g., a memorandum from the manager, human resources director, or official documentation such as SF-52, SF-50 documenting an official detail/assignments, or other comparable documentation). The documentation must indicate whether the employee performed the duties full time or, if part-time, the percentage of times the employee performed the additional duties.\n\nTo receive credit for experience in your resume that is not within the official series and grade level of your position, you must provide official documentation of such experience as indicated above.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment. For more information on these qualification standards, please visit OPM's web site at http://www.opm.gov/qualifications/standards/indexes/alph-ndx.asp. \r\n                                    \n\n\nEducation\n\nThere is no education substitute or requirement for the GS-14 level.\n\n\n\nAdditional information\n\nCurrent Openings\n\nNew and emerging technologies are changing how preexisting products and services work or creating new ones. We need more technologists serving in the ranks of our technology teams. These positions are vital in helping us understand the constantly evolving needs of Veterans and their families.\n\nTechnologists will work alongside financial analysts, healthcare researchers, human resources experts, and more to provide quality IT products and services using various technical or design methods to inform how best to deliver care and benefits to Veterans. Technologists will support the cross-pollination of key ideas in emerging technology fields to ensure the federal government can keep pace with the private sector.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be well-qualified, applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors if applicable, and must be proficient in most of the requirements of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website which can be found at https://www.opm.gov/.\n\nReceiving Service Credit for Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. VA may offer newly-appointed Federal employee's credit for their job-related non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nOPM General Schedule (GS) & Locality Pay Tables: The salary range listed reflects the GS base rate (not including locality). Upon selection, the salary will be adjusted to include locality. Please see OPM GS & Locality Pay Tables.\n\nSuperior Qualifications and Special Needs Pay-Setting: Agencies may set the rate of basic pay of a newly-appointed employee at a rate above the minimum rate of the appropriate General Schedule (GS) grade because of-\n\nthe superior qualifications of the candidate; or\na special need of the agency for the candidate's services.\n\nAn agency must approve each determination to use this authority before the employee enters on duty - the determination cannot be made retroactively - and is not guaranteed. OPM Superior Qualifications and Special Needs Pay-Setting Authority Fact Sheet.This job opportunity announcement may be used to fill additional vacancies.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nDo you want an opportunity to improve the lives of millions of Veterans? Use your technical expertise to develop and deliver cutting-edge digital capabilities to Veterans and those who care for them!\n\nWe're looking for experts in data science, software engineering, product design, product management, and user experience (UX) who are passionate about using their skills to ensure Veterans and their families receive seamless care and services to join our team of technologists. Our technologists help develop cutting-edge technology, advocate for Veteran needs, and ensure the Department of Veterans Affairs can provide Veterans' home loans, G.I. Bill, healthcare, and other services.\n\nWe are committed to building a team that reflects the communities we serve and strongly encourage people of color, LGBTQ+ individuals, women, minorities, people with disabilities, system-impacted people, Veterans, and people of all ages to apply.\n\nAbout Our Technologist Teams\n\nIf selected, technologists will be appointed to serve in our Office of Chief Technology Officer (CTO).\n\nYou can work from home anywhere in the United States, or at VA headquarters in Washington, D.C.\n\nAt OIT, you will be working on a wide variety of projects that are relevant to your specific area of expertise. Possible projects could include:\n\nWorking on small, cross-functional teams with healthcare, education, and financial analysts to perform technical investigative research for projects that affect millions of Veterans.\nAnalyzing computational models implemented by financial institutions that inform what benefits Veterans and their families are eligible for. Ex. Healthcare, home loan guarantees, and educational benefits\nResearching how electronic healthcare data can be utilized to deliver better care and services to Veterans.\nAnticipating risks and acting fast to support Veterans when IT systems fail.\nServe as a technical expert and advisor to support VA mission.\n\n\n\nWork Schedule: Monday - Friday, 8:00 am - 4:30 pm\nCompressed/Flexible Schedule: Available with supervisory approval\nDuty Location Status: Will work remotely from home location\nPosition Description Title/PD#: IT Specialist/ PD18520A\nRelocation/Recruitment Incentives: Not Authorized\nFinancial Disclosure Report: Not required\nPhysical Demands: The work is largely sedentary. The incumbent must possess the flexibility and versatility of mind necessary to defend and negotiate matters involving significant controversial issues. May be required to work under stressful conditions, such as long hours, to complete sensitive and urgent work assignments.\n\n\n\nWhat We're Looking For\n\nWe want people excited about building technology and embracing the VA's mission.We are looking for skilled technologists with experience in any of the following areas:\n\nData Science & Strategy: Examine large datasets using scripting languages or modern statistical analyses and computational languages (e.g., Python, R, SQL, Azure Synapse, Power BI, Databricks, Azure ML, Kubernetes, Oracle, Enterprise Data Lake, Azure Data Factory and hosting solutions on cloud environments to include AWS and Azure) to provide seamless care and services to Veterans and their caregivers. Use artificial intelligence (AI) and machine learning technologies, logistic and linear regression models, or natural language processing (NLP) to detect, anticipate and prevent potential Veteran harm or inability to access VA benefits and services.\nSoftware Engineering: Design, create, and test systems to dig into how to best deliver IT products and services. Use front-end, back-end, and full-stack engineering to develop and support new technical strategies that could help effectively serve Veterans and VA employees. This could include API design and development, furthering open-source policies while prioritizing maintainability and software reusability in all product development. Programming languages, e.g., Python, SQL, R, Java, JS, Go, Scala, C, C++, Julia, or MatLab.\nProduct Management: Coordinate across stakeholders and use agile or lean approaches to align cross-functional teams around a common vision or strategy and user needs. Monitor Veteran and market trends and develop environmental analyses. Use expertise to advance the use of emerging technologies within government.\nDesign & UX: A user experience designer at Veteran's Affairs will have a direct impact on the VA's ability to provide its customers - Veterans of the US military and other members of the public that support those Veterans - with an exceptional customer experience, comparable with the experience they have with top tier commercial products and services. They may work on public-facing, clinical, or staff facing initiatives in various design practice areas. A user experience designer can advance through multiple levels in their design career at VA and have a significant impact on improving VA products, processes, and best practices.\n\n\n"}, {"jobID": "714681800", "origin_search": "https://www.usajobs.gov/", "posted": "03/22/2023", "jobTitle": "Program Applications Specialist", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/714681800", "jobLocation": {"remote": "not specified", "city": "Livermore", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 57778, "max": 91873}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/12/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS 07 position you must have served 52 weeks at the GS 07. For a GS 09 position you must have served 52 weeks at the GS 07.The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade. Note: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\n\nYou may qualify based on your experience and/or education as described below:\n\nGS 07 Minimum Qualification\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS 05 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: provides\n\ttechnical supervision as a subject matter expert to clinics, ensures the accuracy of reports related to both inpatient and outpatient scheduling and clinic profile efficiencies/utilization, provides training for individual users on daily operational tasks and trains new users.\nOR\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have one full year of graduate level education or superior academic achievement (SAA). S.A.A. is based on (1) class standing, (2) grade-point average, or (3) honor society membership. 1. Class standing -- Applicants must be in the upper third of the graduating class in the college, university, or major subdivision, such as the College of Liberal Arts or the School of Business Administration, based on completed courses. 2. Grade-point average (G.P.A.) -- Applicants must have a grade-point average of:\n\t- 3.0 or higher out of a possible 4.0 (\"B\" or better) as recorded on their official transcript, or as computed based on 4 years of education, or as computed based on courses completed during the final 2 years of the curriculum; or\n\t- 3.5 or higher out of a possible 4.0 (\"B+\" or better) based on the average of the required courses completed in the major field or the required courses in the major field completed during the final 2years of the curriculum. 3. Election to membership in a national scholastic honor society -- Applicants can be considered eligible based on membership in one of the national scholastic honor societies recognized by the Association of College Honor Societies. (TRANSCRIPT REQUIRED).\nOR\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an combination of specialized experience and education beyond .\n\nGS 09 Minimum Qualification\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS 07 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to: provides business oversight for a variety of software programs integral to the overall administration and operations of clinical and clinical support services, problem solver with the special ability to integrate overall knowledge of the service system with VISTA applications and to be innovative in the process, possesses an in-depth understanding of the complexities of application software, clinic set up, and provide technical direction and education, establishes and maintains clinics in kiosks adding new clinics and updating clinic information as required, conducts business process modeling, projects and studies that will impact on the overall functions of the services.\nOR\nEducation: Applicants may substitute education for the required experience. To qualify based on education for this grade level you must have master's or equivalent graduate degree or 2 full years of progressively higher level graduate education leading to such a degree or LL.B. or J.D., if related  (TRANSCRIPT REQUIRED).\nOR\nCombination: Applicants may also combine education and experience to qualify at this level. You must have an combination of specialized experience and education beyond .\n\nYou will be rated on the following Competencies for this position:\nAdministration and ManagementCommunicationsTechnology Application\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: Regular and recurring work is mostly sedentary involving sitting at a desk, although the position requires the ability to move from one geographic location of the facility to another. The incumbent works with a computer screen and keyboard. Some physical effort such as standing, walking, bending or prolonged sitting may be required. The incumbent may be exposed to walking to outlying areas. The work places no special physical demands on the employee.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\r\n                                        Duties to include but not limited to the following:\nApplication Oversight 40%\n\nProvides business oversight for a variety of software programs integral to the overall administration and operations of clinical and clinical support services.\nResponsible for the coordination and training for service and facility staff in business and functional areas for various information technology VISTA packages and additional business office programs\nResearches and validates all requests from services and will coordinate with Managerial Cost Accounting (MCA) and/or Compliance staff, or other technical consultants, to ensure information accuracy.\nProvides technical supervision as a subject matter expert to clinics with and without service-level clinic profile builders; assisting services with clinic establishment requests\nCoordinates with the responsible office(s) for medical center workload to ensure the accuracy of the data in VISTA. Ensures the accuracy of reports related to both inpatient and outpatient scheduling and clinic profile efficiencies/utilization. \nBusiness point of contact for business implementation of new software or devices that use the applications. \nproblem solver with the special ability to integrate overall knowledge of the service system with VISTA applications and to be innovative in the process.\n\nApplication Setup and Management 40%\n\nResponsible for all aspects of application software for establishing, modifying, or improving clinic establishment in VistA and provide expert direction to Leadership and their support staff, including the application as it affects other software. \nHas ownership of the clinic profile request process for the creation of new clinic builds and direct responsibility for grid creation of services without service-line clinic profile builders.\nExpected to have an in-depth understanding of the complexities of application software, clinic set up, and provide technical direction and education, as necessary, to ensure clinics operate as required for patient care, that they accurately reflect clinician availability, and provide audit for potential compliance issues as clinics are reviewed, modified, or created. Incumbent is responsible for ensuring optimal supply and demand is accurately reflected in the finished product.\nEstablishes and maintains clinics in kiosks adding new clinics and updating clinic information as required. \nEliminates inactivated clinics from kiosks. Provides oversight of clinic updates and exclusion for the automated telephonic appointment reminder (Audiocare) and text messaging appointment reminder system.\n\nProcess Improvement - 10%\n\nParticipates in the establishment of administrative qualitative standards; the objective of which is intended to improve programs, facilities and operations. \nMaintains a close working relationship with various program officials. This, in addition to his/her knowledge based on personal observation and understanding of management practices, results in effective and practical qualitative standards. \nCoordinates and provides recommendations in the application of standards that affect the service.\nCoordinates ongoing data collection and basic analysis and uses knowledge of System Redesign principles to determine organization performance.\n\nTraining and Education - 10%\n\nProvides training and troubleshooting for clinical and administrative staff in business processes and associated supporting software.\nProvides training for individual users on daily operational tasks and trains new users.\nTrains service employees and facility employees in the use and application of the programs, such as in grid management and scheduling, to ensure that information is entered and managed correctly to provide institutional improvements, such as optimizing clinic utilization.\nTrains users in resolving minor processing and application problems.\n\n\nPromotion Potential: The selectee may be promoted to the full performance level without further competition when all regulatory, qualification, and performance requirements are met. Selection at a lower grade level does not guarantee promotion to the full performance level.\n\nWork Schedule: Monday thru Friday 8:00 am to 4:30 pm\nTelework: VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\nVirtual: This is not a virtual position.\nPosition Description/PD#: Program Applications Specialist/PD00992A and PD02365A\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nFinancial Disclosure Report: Not required\r\n                                    \n"}, {"jobID": "712280500", "origin_search": "https://www.usajobs.gov/", "posted": "03/13/2023", "jobTitle": "Air Traffic Control Specialist", "companyName": "FederalAviationAdministration", "link": "https://www.usajobs.gov/job/712280500", "jobLocation": {"remote": "not specified", "city": "Longmont", "state": "CO", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 92819, "max": 1438562905}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nUS Citizenship is required.\nSelective Service Registration is required for males born after 12/31/1959.\nMust submit an SF50 (See Required Documents)\n\n\n Qualifications\n\nTo view the complete qualification standard, applicants should reference – U.S. Office of Personnel Group Coverage Qualification Standard for Air Traffic Control Series, 2152:https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2100/air-traffic-control-series-2152/To qualify for this position you must demonstrate in your application that you possess at least one year of specialized experience equivalent to FV-H / FG/GS-10/11/12, as an air traffic controller in a military or civilian air traffic facility that demonstrated possession of the knowledge, skills and abilities required to perform the level of work of the specialization for which application is made. This experience must have provided a comprehensive knowledge of appropriate air traffic control laws, rules and regulations. Creditable experience must have equipped applicants with the knowledge, skills and abilities to perform the full range of duties of the position for which application is being made.Specialized experience is: Experience working with various aviation related automation systems, flight data processing, surveillance data processing, and traffic flow management techniques.Applicants should include examples of specialized experience in their work history.Qualifications must be met by the closing date of this vacancy announcement.If the Agency decides to interview any qualified employee on the selection list, then all on the list who are qualified must be interviewed. If the selection list is shortened to a best qualified list through a comparative process, then the best qualified list shall be considered to be the selection list.\n\n\n\n\r\n                                            Preview Job Questionnaire\r\n                                        \n\r\n                                            Make sure your resume includes detailed information to support your qualifications and answers to the job questionnaire.\r\n                                        \n\n\nAdditional information\n\nWe may use this vacancy to fill other similar vacant positions.Position may be subject to a background investigation.A one-year probationary period may be required.The person selected for this position may be required to file a financial disclosure statement within 30 days of entry on duty. FAA policy limits certain outside employment and financial investments in aviation-related companies. www.faa.gov/jobs/working_here/financial_disclosure_requirementsThe U.S. Department of Transportation strives to ensure that equity, transparency, accountability, collaboration, and communication permeate all that we do for the betterment of the Department, the traveling public, and our nation. As such, DOT values a highly diverse workforce of persons who promote a culture of belonging by respecting the personal dignity and worth of each individual and fostering a positive environment where all feel safe and welcome. If these commitments coincide with your personal ideals and professional aspirations, please consider joining the DOT family.As a part of the Federal-Wide Hiring Reform Initiative (streamlining the hiring process), the FAA is committed to eliminating the use of the Knowledge, Skills and Ability (KSA) narratives from the initial application in the hiring process for all announcements. Therefore, as an applicant for this announcement, you are NOT required to provide a narrative response in the text box listed below each KSA.\n\nIn lieu of providing a KSA narrative response in the text box listed below each KSA, in your work history, please include information that provides specific examples of how you meet the response level or answer you chose for each KSA. Your work history examples should be specific and clearly reflect the highest level of ability. Your KSA answers will be evaluated further to validate whether the level that you selected is appropriate based on the work history and experience you provided. Your answers may be adjusted by a Human Resource Specialist as appropriate.Eligible applicants meeting the minimum qualification requirements and selective factor(s), if applicable, may be further evaluated on the KSAs listed in the announcement. Based on this evaluation, applicants will be placed in one of the following categories: score order, category grouping, or alphabetical and referred to the selecting official for consideration.Please ensure you answer all questions and follow all instructions carefully. Errors or omissions may impact your rating or may result in you not being considered for the job.This is a bargaining unit position. This position is represented by NATCA: Automation Specialists.Links to Important Information: Locality Pay , COLA \n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThe specialist is responsible for completing complex, specialized air traffic control assignments maintaining and performing analyses of all facets of the automation systems related to Air Traffic Control (ATC) activity within the facility. Typical duties include (1) performs required research to identify, analyze, and resolve operational automation discrepancies, (2) ensures the adequacy of automation support based on an advanced knowledge of air traffic control procedures and knowledge of facility traffic flows, flight data requirements, radar data, and intra facility and inter-facility coordination procedures, (3) maintains, tests, and modifies the adaptation database to assure that maximum effectiveness is achieved and that data is processed in a precise and timely manner, (4) coordinates with staff at local and other facilities regarding automation decisions and activities that affect operations.Analyzes symptoms of, and define solutions to problems associated with modern network-based distributed real-time automation systems. He/she gathers information, analyzes, evaluates, and recommends a course of action to resolve adaptation problems with a system, subsystem or support system. Analyzes system performance and fault information to identify causes of adaptation problems or system failures and recommends corrective action.Performs as a contributing specialist in the assessment/analysis of proposed policies and programs related to the development and deployment of Air Traffic automation, surveillance data processing, and other facility projects. Participates on special project teams to evaluate the effectiveness of automation services. He/she performs technical analysis, documentation, and related tasks in direct support of the air traffic operations. Provides technical assistance to operational personnel for the resolution of system malfunctions. Applies experience and advanced air traffic knowledge, as well as an understanding of new technologies and methodologies, to solve complex problems and develop improved technical processes or systems. Work contributes directly to the success of regional or national programs, the integrated NAS, as well as research, development and testing efforts, FAA Academy instruction, or other program areas.Contacts are internal and external. He/she communicates with Technical Operations and Air Traffic representatives to monitor software and adaptation requirements and to support second level engineering activities. Integrates and implements air traffic software adaptation changes and requirements with multiple air traffic control facilities both internal and external to the FAA to include military base operations, airlines and international air traffic control organizations.Established policies and procedures cover most assignments, but allow considerable discretion to select an optimum approach or recommend a new approach. Must make extensive technical judgments when interpreting and implementing policy and procedures governing the assigned area. Provides recommendations to improve work processes. Acts as a contributing specialist in his or her area of expertise on broad work activities or may be individually responsible for projects or activities.\nThe specialist works independently at a field site with limited direction and guidance provided by the Program Operations Field Manager. Resolves most technical problems independently and informs management of problems that require their attention. Often develops and recommends techniques to address problem situations. Work is reviewed periodically for technical compliance.\n\n"}, {"jobID": "714197200", "origin_search": "https://www.usajobs.gov/", "posted": "03/21/2023", "jobTitle": "IT Specialist (APPSW)", "companyName": "FarmProductionandConservation(FPAC)BusinessCenter", "link": "https://www.usajobs.gov/job/714197200", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 71099, "max": 92429}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National\nMales born after 12/31/1959 must be Selective Service registered or exempt\nSubject to satisfactory adjudication of background investigation and/or fingerprint check\nSuccessful completion of one-year probationary period, unless previously served.\nDirect Deposit: Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit E-Verify at https://www.e-verify.gov/\nYou must possess a Java certification.  (Failure to submit the JAVA Certification will result in an ineligible rating.)\n\n\n Qualifications\n\r\n                                        Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement including specialized experience and/or education, as defined below.\n\nFor this position, individuals must have IT-related experience demonstrating each of the four competencies listed below:\n1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. -AND-\n\nSPECIALIZED EXPERIENCE: One full time year of Information Technology experience equivalent to the GS-11 level in the Federal service or private sector that demonstrates experience applying systems design and programming techniques, operating systems software, file management services, and database facilities required to develop more efficient application software; utilizing programming languages JAVA, HTML and other web-based application programming languages including Uniform Modeling Language (UML) for object-oriented design; identifying problems and making recommendations during development or production cycles. -AND-\n\nSelective Placement Factor: Must possess a Java Programming Certification. The certification must be submitted with the application packet. (Failure to submit the JAVA Certification will result in an ineligible rating.)\n\nApplicants must meet all qualifications and eligibility requirements by the 04/03/2023 of the announcement including specialized experience as defined above.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\r\n                                            SUBSTITUTION OF EDUCATION IS NOT APPLICABLE AT THIS GRADE LEVEL.\r\n                                        \n\n\nAdditional information\n\n\nCareer Transition Assistance Plan (CTAP), Reemployment Priority List (RPL), or Interagency Career Transition Assistance Plan (ICTAP): Visit the OPM website for information on how to apply as a CTAP, RPL, or ICTAP eligible. To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.\nThis position is being concurrently announced under Merit Promotion Announcement Number FPAC-23-11884758-MP-RJ. Current or former Federal employees or other eligible applicants may apply to both announcements to expand all possibilities of consideration since different referral criteria apply to each type of announcement. See the above announcement for more information.\nThis position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.\nRelocation and/or Recruitment incentives may be authorized.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAnalyzes, develops, and maintains computer application systems and documentation for various Information Solutions Division (ISD) program and administrative functions.\nServes as the application programmers during the programming and testing phases of development.\nAssists in the design and personally codes, tests, and debugs the critical portions of the applications for which responsible.\nDiagnoses application system failures to isolate the source of the problems to equipment, system software, or application programs.\nDirects and confers with other Information Technology Specialists and operating personnel in determining causes of the problems and in preparing solutions which will overcome the problem.\nResearches and simulates under test conditions proposed computer processes to determine computer resources required in reference to hardware, efficiency, time and other factors related to determining total cost of operation.\nEvaluates rapidly changing information technology and agency environment; and developing design specifications, technical advisories, and guides for applications programmers/analysts and users of agency systems.\n\n"}, {"jobID": "714203400", "origin_search": "https://www.usajobs.gov/", "posted": "03/22/2023", "jobTitle": "IT Specialist (APPSW)", "companyName": "FarmProductionandConservation(FPAC)BusinessCenter", "link": "https://www.usajobs.gov/job/714203400", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 71099, "max": 92429}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a US Citizen or US National\nMales born after 12/31/1959 must be Selective Service registered or exempt\nSubject to satisfactory adjudication of background investigation and/or fingerprint check\nSuccessful completion of one-year probationary period, unless previously served.\nDirect Deposit: Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit E-Verify at https://www.e-verify.gov/\nYou must possess a Java certification.  (Failure to submit the JAVA Certification will result in an ineligible rating.)\n\n\n Qualifications\n\r\n                                        Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement including specialized experience and/or education, as defined below.\n\nFor this position, individuals must have IT-related experience demonstrating each of the four competencies listed below:\n1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail.\n2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\n3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\n4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. -AND-\n\nSPECIALIZED EXPERIENCE: One full time year of Information Technology experience equivalent to the GS-11 level in the Federal service or private sector that demonstrates experience applying systems design and programming techniques, operating systems software, file management services, and database facilities required to develop more efficient application software; utilizing programming languages JAVA, HTML and other web-based application programming languages including Uniform Modeling Language (UML) for object-oriented design; identifying problems and making recommendations during development or production cycles. -AND-\n\nSelective Placement Factor: Must possess a Java Programming Certification. The certification must be submitted with the application packet. (Failure to submit the JAVA Certification will result in an ineligible rating.)\n\nApplicants must meet all qualifications and eligibility requirements by the 04/04/2023 of the announcement including specialized experience as defined above.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\r\n                                            SUBSTITUTION OF EDUCATION IS NOT APPLICABLE AT THIS GRADE LEVEL.\r\n                                        \n\n\nAdditional information\n\n\nCareer Transition Assistance Plan (CTAP), Reemployment Priority List (RPL), or Interagency Career Transition Assistance Plan (ICTAP): Visit the OPM website for information on how to apply as a CTAP, RPL, or ICTAP eligible. To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.\nThis position is being concurrently announced under Delegated Examining Announcement Number FPAC-23-11884757-DE-RJ. Current or former Federal employees or other eligible applicants may apply to both announcements to expand all possibilities of consideration since different referral criteria apply to each type of announcement. See the above announcement for more information.\nThis position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.\nRelocation and/or Recruitment incentives may be authorized.\nFor Washington, DC, this is a AFSCME Bargaining Unit position.\n\tFor Kansas City, MO, this is a NTEU Bargaining Unit position.\n\tFor St. Louis, MO and Ft Worth, TX this is a AFGE Bargaining Unit position.\n\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nAnalyzes, develops, and maintains computer application systems and documentation for various Information Solutions Division (ISD) program and administrative functions.\nServes as the application programmers during the programming and testing phases of development.\nAssists in the design and personally codes, tests, and debugs the critical portions of the applications for which responsible.\nDiagnoses application system failures to isolate the source of the problems to equipment, system software, or application programs.\nDirects and confers with other Information Technology Specialists and operating personnel in determining causes of the problems and in preparing solutions which will overcome the problem.\nResearches and simulates under test conditions proposed computer processes to determine computer resources required in reference to hardware, efficiency, time and other factors related to determining total cost of operation.\nEvaluates rapidly changing information technology and agency environment; and developing design specifications, technical advisories, and guides for applications programmers/analysts and users of agency systems.\n\n"}, {"jobID": "663524100", "origin_search": "https://www.usajobs.gov/", "posted": "07/05/2022", "jobTitle": "IT Specialist (APPSW)", "companyName": "SmithsonianInstitution", "link": "https://www.usajobs.gov/job/663524100", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 77738, "max": 144034}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nPre and Post background Investigation.\nMay be required to serve a one year probationary period.\nDirect deposit/electronic funds transfer required for salary payment.\nSelection may be  made at either the grade   11, 12 or 13\nThis is a career ladder opportunity with promotion potential to grade 13\n\n\r\n                                        For qualification standards please check: http://www.opm.gov/qualifications/Standards/IORs/gs2200/2210-altA.asp\n\n\n Qualifications\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below.1. Attention to Detail - Is thorough when performing work and conscientious about attending to detail.2. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.3. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.4. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\nAND    Candidates for grade 11 must possess minimum of one year of specialized  experience equivalent to at least the grade 9 in the normal line of progression for this occupation. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position such as knowledge of the Linux operating system, shell programming, and of a high-level programming language such as python; ability to manage reliable and scalable IT infrastructure, in particular on cloud computing platforms such as Amazon Web Services; knowledge of code versioning tools and repositories such as Git and Github; knowledge of the technologies used by the project: Nginx, Docker, PostgreSQL, SOLR; and knowledge of authentication and authorization systems.   Candidates for grade 12 must possess a minimum of one year of specialized experience equivalent to at least the grade 11 in the normal line of progression for this occupation. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position such as proficient knowledge of the Linux operating system, shell programming, and a high-level programming language such as python; proficient knowledge of code versioning tools and repositories such as git and Github; knowledge of continous integration and testing environments. Candidates for grade 13 must possess a minimum of one year of specialized experience equivalent to at least the grade 12 in the normal line of progression for this occupation. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position such as skill in managing and enhancing reliable and scalable IT infrastructure; and skill in data collection and integration to support analytics and business intelligence.  OR\nEducation:All academic degrees and coursework must be from accredited or pre-accredited institutions. Undergraduate or Graduate Education: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.  Grade 11: Ph.D. or equivalent doctoral degreeor3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree. \n\n\n\nAdditional information\n\nThe Smithsonian does not pay relocation expensesThe Smithsonian embraces diversity and equal employment opportunity.\nFor the latest information on the COVID-19 vaccination requirements and its impact on your application, click on Smithsonian Institution’s Frequently Asked Questions\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThe ADS built a highly scalable and feature-rich platform using a modern development stack: a custom build of the open-source search engine Solr, a highly responsive UI engineered on top of React, a high performance distributed brokerage system, and cloud-based hosted services with Kubernetes in Amazon Web Services. The primary programming languages are Python, Java, and JavaScript. The employee is a highly-motivated system developer experienced in administering key components of software infrastructure, including search engines, relational databases, and cloud-based microservices. The developer is part of a small, agile team of talented, like-minded individuals who are solving difficult problems as a team.\n       1. Manage ADS’s cloud-based computing infrastructure and system operations, ensuring the security, stability and scalability of the ADS services and its data\n       2.  Work with team members to ensure software modules are production-ready, manage their deployment and monitoring\n       3. Collect metrics about system operations and service usage to support system monitoring, usage tracking and reporting4.\n       4. Collaborate with other team members and stakeholders in the design and development of new capabilities and the maintenance of existing functionality\n       5. Perform other duties as may be required\n\n"}, {"jobID": "715450800", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "IT Specialist", "companyName": "DeputyAssistantSecretaryforInformationandTechnology", "link": "https://www.usajobs.gov/job/715450800", "jobLocation": {"remote": "not specified", "city": "AnywhereintheU.S.(remotejob)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 59319, "max": 92429}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nYou must be a U.S. citizen to apply for this job.\nSelectees are subject to a background/suitability investigation.\nDesignated and/or random drug testing may be required\nSelectees may be required to serve a probationary period.\nSelective Service Registration is required for males born after 12/31/1959.\nA complete application package, i.e., Resume, Transcripts, etc., as required by the job announcement.\nSelected applicants will be required to complete an online onboarding process.\nParticipation in the Seasonal Influenza Prevention Program for VHA Health Care Personnel (HCP) is a requirement for all Department of Veterans Affairs HCP.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nMust be proficient in written and spoken English.\nPre-employment physical evaluation may be required.\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 09/29/2023.\n\nSelective Placement Factor: This position includes a skill, knowledge, ability or other worker characteristic basic to -and essential for- satisfactory performance of the job. Selective Placement Factors are a prerequisite to appointment and represent minimum requirements for a position. Applicants who do not meet it are ineligible for further consideration. Evidence of the Selective Placement Factor must be reflected in your resume.\n\nThe Selective Placement Factor for this position is: experience supporting Kernel Infrastructure VistA applications, Clinical VistA applications or Financial/Administrative VistA applications.\n\nAND\n\nYou may qualify based on your education or experience as described below.\n\nA transcript must be submitted with your application if you are basing our qualifications on education.\n\nEducation: Degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks.\n\nGS-11 Education: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree;\n\nOR\n\nExperience - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate.\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nAND\n\nGS-11 Specialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-09 in the normal line of progression for the occupation in the organization. Specialized experience is defined as:\n\n\nSupporting accounts, network rights, and access to systems and equipment;\nResolving hardware/software interface and interoperability problems;\nInstalling and configuring new or modified hardware and operating systems and applications software;\nMonitoring server performance using performance monitoring tools;\nApplying security rules to complete tasks and protect IT systems.\n\nGS-12 Specialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-11 in the normal line of progression for the occupation in the organization. Specialized experience is defined as:\n\n\nPlanning and scheduling the installation and configuration of new or modified hardware and operating systems and applications software;\nManaging systems resources including performance, capacity, availability, serviceability, and recoverability in the event of system failures; implementing security procedures and tools;\nIdentifying and anticipating system/server performance, availability, capacity, or configuration problems.\n\nSuch experience is typically gained in the IT field or through the performance of work where the primary concern is IT.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nPer Office of Personnel Management General Schedule Qualification Policies, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not normally be part of the employee's position is creditable when documented by satisfactory evidence (e.g., a memorandum from the manager, human resources director, or official documentation such as SF-52, SF-50 documenting an official detail/assignments, or other comparable documentation). The documentation must indicate whether the employee performed the duties full time or, if part-time, the percentage of times the employee performed the additional duties.\n\nTo receive credit for experience in your resume that is not within the official series and grade level of your position, you must provide official documentation of such experience as indicated above.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment. For more information on these qualification standards, please visit OPM's web site at http://www.opm.gov/qualifications/standards/indexes/alph-ndx.asp. \r\n                                    \n\n\nEducation\n\nThere is no education substitute or requirement for the GS-12 level.\n\n\nPLEASE NOTE: Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications (particularly positions with a positive education requirement). Therefore, applicants must report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html. All education claimed by applicants will be verified by the appointing agency accordingly. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education.\r\n                                        \n\n\nAdditional information\n\nCOVID-19 Pandemic Expanded Telework Program - Due to COVID-19, VA is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement. Management officials will provide information about returning to the official, pre-pandemic worksite, when applicable. At that time, you may be eligible to request to continue to telework depending upon the terms of your organization's telework policy and the duties of the position.VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be well-qualified, applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors if applicable, and must be proficient in most of the requirements of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website which can be found at https://www.opm.gov/.\n\nSpecial Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator.\n\nReceiving Service Credit for Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. VA may offer newly-appointed Federal employee's credit for their job-related non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThis job opportunity announcement may be used to fill additional vacancies.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nThis is a bargaining unit position. \n\nPlease read this public notice in its entirety before submitting your application.\n\nVacancies may not presently exist but may become available at any point during the opening period of this vacancy announcement. We will not review applicant resumes until there is a request to fill a vacancy.\n\nYou are applying to a public notice to fill current and future vacancies. Please note, that there may or may not be actual/projected vacancies when you submit your application. Your resume and supporting documentation will be retained with other applicants and reviewed as vacancies occur. You will not receive a notice regarding your application's status other than the initial acknowledgment until a request is received to fill a position.\n\nThis announcement will remain open until September 29, 2023. The initial cut-off date is April 4, 2023 OR the point at which the first 100 applications are received, whichever comes first. Applications submitted after 4/4/2023 may not receive consideration.\n\nIn addition, due to the potential of a high volume of applicants, not all applicants may receive consideration.\n\nAfter the initial cut-off period, once additional requests to fill a vacancy are received, applications will be reviewed in increments of 100 based upon the date in which the application was received..\n\nNOTE: Submitting multiple applications will change the order in which your application is received and reviewed. We will refer qualified applicants to the selecting official for consideration. The organization's hiring needs will determine the referral of additional applicants. Applicants will be notified about their application's status if referred or if we fill all vacancies.\n\nThis position is primarily aligned to the following NICE Cybersecurity Workforce Framework work roles:\n\nOPM Cyber Code 451- System Administrator\n\nFor more information about these work roles, where they fit within the larger Cyber Workforce, and how they can support your unique career journey, please visit the Cyber Career Pathways tool on the National Initiative for Cybersecurity Careers and Studies website: https://niccs.us-cert.gov/workforce-development/cyber-career-pathways\n\n\nWork Schedule: Monday - Friday, 8:00 am - 4:30 pm\nCompressed/Flexible Schedule: Available\nDuty Location Status: Will work remotely from home\nPosition Description Title/PD#: IT Specialist/PD10103A, PD10102A, PD10103A, and PD10102a\nRelocation/Recruitment Incentives: Not Authorized\nFinancial Disclosure Report: Not Required\nPhysical Requirements: The work is sedentary, but may involve intermediate periods of walking, bending, stooping, lifting, carrying, moving (up to 50 pounds) computer components and supplies, reaching, pulling, and working at a keyboard and monitor. Subject to call back outside tour of duty.\nPromotion Potential: The selectee may be promoted to the full performance level without further competition when all regulatory, qualification, and performance requirements are met. Selection at a lower grade level does not guarantee promotion to the full performance level. Selection(s) can be made at any advertised grade.\n\nMajor Duties:\n\nSupport Clinical, Financial/Administrative, and/or Kernel Infrastructure Centric VistA Applications at one or more facilities within the assigned Software Product Management office.\nCreate and maintain documentation on IT systems and infrastructure to include configuration standards, as-built diagrams and historical and trending information.\nPlan, execute, and maintain IT systems, infrastructure, and operations.\nOversee or conduct backup and recovery tasks.\nImplement operational and technical security controls.\nParticipate as a team or project leader with others in a virtual environment accountable to the division chief.\n\n\n"}, {"jobID": "716308700", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "Visual Information Specialist", "companyName": "ForestService", "link": "https://www.usajobs.gov/job/716308700", "jobLocation": {"remote": "not specified", "city": "SanDimas", "state": "CA", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 46696, "max": 74250}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a U.S. Citizen or National.\nMales born after 12/31/1959 must be Selective Service registered or exempt.\nSubject to satisfactory adjudication of background investigation and/or fingerprint check.\nSuccessful completion of one year probationary period, unless previously served.\nPer Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution.\nSuccessfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the eligibility and qualifications requirements as defined below by the closing date of the announcement. For more information on the qualifications for this position, visit the Office of Personnel Management's General Schedule Qualification Standards.\n\nYour application and resume must clearly show that you possess the experience requirements. Transcripts must be provided for qualifications based on education. Provide course descriptions as necessary.\n\nBasic Requirement for Visual Information Series (1084)\n\nEducation:Undergraduate and Graduate Education: Major study in commercial art, fine arts, art history, industrial design, architecture, drafting, interior design, photography, visual communication, or other fields related to the position. Some positions may also require subject-matter knowledge of medicine, science, or technical equipment.\n\nOR\n\nExperience: Specialized Experience: Experience in the actual type of work for which application is made. Unpaid experience is creditable, provided the work done was of a quality level and demonstrated the ability required for the position. This includes planning the preparation and use of photographs, illustrations, drawings, and other art work, charts, diagrams, dioramas, maps, slides, overlays, and other kinds of visual material for use in communicating information through visual means.\n\nSpecialized Experience Requirement:\n\nGS-07: One year of specialized experience that is equivalent to the GS-05 grade level. Specialized experience is defined as a majority of the following: Participate in the planning and preparation and use of photographs, illustrations, drawings, and other artwork, charts, diagrams, dioramas, maps, slides, overlays, and other kinds of visual material for use in communicating information through visual means; Shooting and editing video and still photography in a variety of formats and settings; consulting with clients to develop technical suggestions and develops a production outline and/or script that most effectively transmits the desired information and meets acceptable standards; designing and preparing a wide range of visual and multi-media presentations and products by providing photography and video support using computer graphics software (Adobe Creative Cloud).\n\nOR\n\nOne (1) full year of graduate level education (18 semester/27 quarter hours) in related coursework such as commercial art, fine arts, art history, industrial design, architecture, drafting, interior design, photography, visual communication, or other fields related to the position.\n\nOR\n\nAn appropriate combination of specialized experience and graduate level education that demonstrates the knowledge, skills, and abilities necessary to do the work.\n\nOR\n\nSuperior Academic Achievement (go to this site determine if you are eligible: http://www.opm.gov/qualifications/policy/ApplicationOfStds-04.asp). The education must have been obtained in an accredited college or university and demonstrate the knowledge, skills, and abilities necessary to do the work with major study in commercial art, fine arts, art history, industrial design, architecture, drafting, interior design, photography, visual communication, or other fields related to the position.\n\nGS-09: One year of specialized experience that is equivalent to the GS-07 grade level. Specialized experience is defined as a majority of the following: Planning and/or designing the production of visual materials including photographs, illustrations, drawings, and other artwork, charts, diagrams, dioramas, maps, slides, overlays, or other kinds of visual material for use in communicating information through visual means utilizing computer graphics software such as Adobe Creative Cloud; directing and/or editing of productions that incorporate multiple visual or audio elements and special effects/graphics; designing and preparing a wide range of visual and multimedia presentations and products, providing photography and video support; consulting with others and key stakeholders to determine intent of publication(s) and appropriateness of overall visual information; gathering pertinent data to analyze issues or identify significant factors and recommend solutions.\n\nOR\n\nA master's or equivalent graduate degree or 2 full years of progressively higher-level graduate education leading to such a degree or LL.B. or J.D., with major study in commercial art, fine arts, art history, industrial design, architecture, drafting, photography, visual communication, graphic design, or other fields related to the position.\n\nOR\n\nAn appropriate combination of specialized experience and graduate level education that demonstrates the knowledge, skills, and abilities necessary to do the work.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nTIME IN GRADE REQUIREMENT: If you are a current federal employee in the General Schedule (GS) pay plan and applying for a promotion opportunity, you must meet time-in-grade (TIG) requirements of 52 weeks of service at the next lower grade level in the normal line of progression for the position being filled. This requirement must be met by the closing date of this announcement.\r\n                                    \n\n\nEducation\n\r\n                                            This position has a basic educational requirement, for more information please see: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1000/visual-information-series-1084/\n\n\n\nAdditional information\n\nThis vacancy is limited to the first 150 applications received and will close at 11:59 pm ET on the closing date identified above or the day we receive the 150th application, whichever occurs first.\n\nCareer Transition Assistance Plan (CTAP), Reemployment Priority List (RPL) or Interagency Career Transition Assistance Plan (ICTAP): To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.\n\nVeterans who are preference eligible or who have been separated from the armed forces under honorable conditions after three years or more of continuous active service are eligible for consideration under the Veteran's Employment Opportunity Act (VEOA).  \n\nLand Management Workforce Flexibility Act (LMWFA) provides current or former temporary or term employees of federal land management agencies opportunity to compete for permanent competitive service positions. Individuals must have more than 24 months of service without a break between appointments of two or more years. Service must be in the competitive service and have been at a successful level of performance or better. Part-time and intermittent service will be credited only for time actually worked. Non-pay status such as leave without pay is credited for up to six months in a calendar year; anything beyond six months is not credited. Applicants are responsible for providing sufficient information/documentation to determine if the 24 month criteria is met.\n\nFarm Service Agency (FSA) County Employees: Permanent County employees without prior Federal tenure who are selected for a Civil Service position under Public Law 105-277 will be given a career-conditional appointment and must serve a 1-year probationary period.\n\nFor more information on applying under special hiring authorities such as the Veteran's Recruitment Act (VRA), 30 percent disabled veterans, certain military spouses, Schedule A Disabled, etc., explore the different Hiring Paths on the USAJOBS website.\n\nPROMOTION POTENTIAL: If you are selected for a position with further promotion potential, you will be placed under a career development plan, and may be non-competitively promoted if you successfully complete the requirements and if recommended by management. However, promotion is neither implied or guaranteed.\n\nThis position may be eligible to telework up to four days per week, based upon the duties of the position. This position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.\n\nThe Forest Service may use certain incentives and hiring flexibilities, currently offered by the Federal government, to attract highly qualified candidates. Additional information is available at https://www.opm.gov/policy-data-oversight/pay-leave/pay-and-leave-flexibilities-for-recruitment-and-retention/\n\nThe position filled from this announcement may be a bargaining or a non-bargaining unit position represented by either NFFE, AFGE or NAGE.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nDuties listed are at the full performance level GS-9.\nShoots and edits video and still photography in a variety of formats and settings.\nDesigns, develops, formats and prepares, coordinates, and/or recommends prospective media.\nConfers with installation specialists and representatives, including project managers and staff personnel, and faculties to determine currency of visual presentations and recommends additional visual materials if appropriate.\nOrganizes and develops visual presentation material and graphics required on both recurring and one-time projects.\nUtilizes the latest automated graphics and computer graphic software techniques for photography and video production.\nPlans for maximum effectiveness by considering focal point of presentation, subject matter, size of viewing areas, and desired impact to be made.\nPlans and develops ideas for format, layout design, and treatment of prototype visual presentations including format changes for ensuing presentations.\n\n"}, {"jobID": "715168000", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (SYSADMIN)", "companyName": "NavalEducationandTrainingCommand", "link": "https://www.usajobs.gov/job/715168000", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": "NC", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 61226, "max": 79595}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nGenerally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade.  Time-in-grade requirements must be met by the closing date of this announcement.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nYou will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.\nThis position is designated as a Cyber IT/Cybersecurity Workforce position. You must obtain and maintain the credentials as described in SECNAV M-5239.2 for specialty area B level 2 within 6 months of appointment.\nThis position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.\n\n\n Qualifications\n\r\n                                        Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-07 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: 1) Applying information technology principles and practices to provide technical support to personnel, 2) Troubleshooting information technology problems, 3) Managing networks and systems, performing preventive maintenance of hardware, 4) Maintaining inventories of IT equipment, 5) Assisting with tracking user accounts, 6) Installing/replacing hardware and software, 7) Maintaining a current inventory database to include hardware and software systems.\n\nAdditional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/ \n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\r\n                                    \n\n\nEducation\n\n\nSuccessful completion of a master's degree or equivalent graduate degree\nor\nSuccessful completion of 2 full years of progressively higher level graduate education leading to a master's degree or equivalent graduate degree\r\n                                        \n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will maintain information systems configuration by overseeing the installation and integration of system fixes and updates.\nYou will troubleshoot database malfunctions to determine if errors are caused by hardware, software, or operator.\nYou will integrate new software assets to meet changes in organizational business processes.\nYou will manage the government IT assets for all substations and personnel in the command.\n\n"}, {"jobID": "696710600", "origin_search": "https://www.usajobs.gov/", "posted": "12/27/2022", "jobTitle": "Information Technology Specialist (SYSANALYSIS/APPSW) 12 Month Register", "companyName": "InternalRevenueService", "link": "https://www.usajobs.gov/job/696710600", "jobLocation": {"remote": "not specified", "city": "Birmingham", "state": "AL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 44740, "max": 126742}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement/enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\nIf you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 200-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.\nMust be a U.S. Citizen or National and provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240))\nA 1-year probationary period is required.\nHave your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.\nUndergo a review of prior performance/conduct and an income tax verification. Refer to \"Get Your Tax\nMust successfully complete a background investigation, including a FBI criminal history record check (fingerprint check). Record\" at http://www.irs.gov/(https://www.irs.gov/individuals/get-transcript) to check the status of your account, balance owed, payment history, make a payment, or review answers to tax questions. If you are not in compliance, you will be determined unsuitable for employment with IRS.\n\n\n\n Qualifications\n\n\nComplete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency.\nIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.\nGo through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpired original or certified copies. \nThe employment of any candidate, including a current employee or a new hire, selected for this position may be conditional upon classification and/or audit of federal tax returns. This audit may include up to 2 years of returns.\nObtain and use a Government-issued charge card for business-related travel.\n\nFederal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-timework is considered on a prorated basis.\nTo ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.\n\nYou must meet the following requirements by the closing date of this announcement:\n\nBASIC REQUIREMENTS All GRADES:\nExperience must include Information Technology (IT) related experience that demonstrates each of the following four competencies: 1) Attention to Detail, 2) Customer Service, 3) Oral Communication and 4) Problem Solving.\n\nGS-7 LEVEL: To be eligible for this position at this grade level, you must meet one of the following requirements.\n\nSPECIALIZED EXPERIENCE: Specialized experience for this position must have been in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Interviewing subject-matter personnel to get facts regarding work processes, and synthesizing the resulting data into charts showing information flow; operating computer consoles where this involved choosing from among various procedures in responding to machine commands or unscheduled halts; scheduling the sequence of programs to be processed by computers where alternatives had to be weighed with a view to production efficiency; preparing documentation on cost/benefit studies where this involved summarizing the material and organizing it in a logical fashion; working directly with customers in obtaining information needed to establish or change accounts; translating detailed logical steps developed by others into language codes that computers accept where this required understanding of procedures and limitations appropriate to use of a programming language.\n\nOR\n\nEDUCATION: 1 full academic year of graduate education at an accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics or technology management OR 1 full academic year of graduate education in one or more of the fields identified above that required the development or adaption of applications, systems or networks.\n\nOR \n\nSuperior Academic Achievement may be met by having a bachelor's degree, with one of the following: A GPA of 2.95 or higher on a 4.0 scale for all completed undergraduate courses or those completed in the last 2 years of study, or a GPA of 3.45 or higher on a 4.0 scale for all courses in the major field of study or those courses in the major completed in the last 2 years of study, or rank in the upper one third of the class in the college, university, or major subdivision, or membership in a national honor society recognized by the Association of College Honor Societies. Note: Grade point averages should be rounded to one decimal point. For example, 2.95 is rounded to 3.0, and 2.94 is rounded to 2.9. If more than 10 percent of your undergraduate course work (credit hours) was taken on a pass/fail or similar basis, your claim must be based on class standing or membership in an Honor Society.\n\nOR\n\nCOMBINATION OF EXPERIENCE AND EDUCATION At least 1 year of combined graduate education and experience as defined in paragraphs above\n\nGS-9 LEVEL:  To be eligible for this position at this grade level, you must meet one of the following:\n\nSPECIALIZED EXPERIENCE: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-7 grade level in the Federal service. Specialized experience for this position includes: Experience in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Analysis of the interrelationships of pertinent components of the system; Planning the sequence of actions necessary to accomplish the assignment; and Personal responsibility for at least a segment of the overall project.\n\nOR\n\nEDUCATION: A master's or equivalent graduate degree or two full years of progressively higher-level graduate education leading to a master's or equivalent graduate degree in computer science, engineering, information science, information systems management, mathematics, statistics, operations research, engineering or technology management. OR A master's or equivalent graduate degree or two full years of progressively higher-level graduate education leading to a master's or equivalent graduate degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks.\n\nOR\n\nCOMBINATION OF EXPERIENCE AND EDUCATION: At least 1 year of combined graduate education and experience as defined in paragraphs above\n\nGS-11 LEVEL: To be eligible for this position at this grade level, you must meet one of the following:\n\nSPECIALIZED EXPERIENCE: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-9 grade level in the Federal service. Specialized experience for this position includes: Experience that demonstrated an accomplishment of computer project assignments that required a range of knowledge of computer requirements and techniques. For example, assignments would show experience in developing modifications to parts of a system that required significant revisions in the logic or techniques used in the original development. Must have been in an IT field or work where the primary concern was the subject matter of the IT application. The assignments must have shown completion of the following, or the equivalent: Knowledge of the customary approaches, techniques, and requirements appropriate to an assigned computer applications area or computer specialty area in an organization; planning the sequence of actions necessary to accomplish the assignment where this entailed coordination with others outside the organizational unit and development of project controls; adaptation of guidelines or precedents to the needs of the assignment.\n\nOR\n\nEDUCATION: You may substitute education for specialized experience as follows: a Ph.D. or equivalent doctoral degree or 3 full years of progressively higher-level graduate education leading to a Ph.D. OR equivalent doctoral degree in computer science, information science, information systems management, mathematics, statistics, operations research, engineering or technology management; OR equivalent doctoral degree in one or more of the fields identified above that provided a minimum of 24 semester hours in the development or adaptation of applications, systems or networks. OR\n\nCOMBINATION OF EXPERIENCE AND EDUCATION At least 1 year of combined graduate education and experience as defined in paragraphs above.\n\n\n\n\nEducation\n\nGS-12 LEVEL: You must have one year of specialized experience at a level of\ndifficulty and responsibility equivalent to the GS-11 grade level in the Federal service.\n\nSPECIALIZED EXPERIENCE: Specialized experience for this position includes: Experience that demonstrates accomplishment of computer project assignments that required a wide range of knowledge of computer requirements and techniques pertinent to the position to be filled. This knowledge is generally demonstrated through assignments that required the ability to analyze a number of alternative approaches in the process of advising management concerning major aspects of IT system design. This would include defining what system interrelationships must be considered, or what operating mode, system software, and/or equipment configuration is most appropriate for a given project. At this level, your experience must be sufficient to demonstrate the ability to: Plan and coordinate an agency-wide implementation of process improvement methods and concepts to improve the quality of software products; serving as the principal advocate within the agency/organization for the application of process improvement concepts and practices; and consulting with senior specialists and IT managers throughout the agency in the implementation of process improvement practices.\n\nAND\n\nMEET TIME IN GRADE (TIG) REQUIREMENT: For positions above the GS-05, applicants must meet applicable time-in-­grade requirements to be considered eligible. One year (52 weeks) at the next lower grade level is required to meet the time-in-grade requirements for the grade you are applying for.\n\nAND\nTIME AFTER COMPETITIVE APPOINTMENT: By the closing date (or if this is an open continuous announcement, by the cut-off date) specified in this job announcement, current civilian employees must have completed at least 90 days of federal civilian service since their latest non-temporary appointment from a competitive referral certificate, known as time after competitive appointment. For this requirement, a competitive appointment is one where you applied to and were appointed from an announcement open to \"All US Citizens\".\n\nFor more information on qualifications please refer to OPM's Qualifications Standards.\n\nFor positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.\nA college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Click here for Foreign Education Credentialing instructions.\r\n                                        \n\n\nAdditional information\n\n\nWe may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled.\nThe salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages.\nThis is a Bargaining unit position.\nTour of Duty: Day Shift - Start and stop times between 6:00am and 6:00pm.\nAlternative work schedule, staggered work hours or telework may be available.\nRelocation expenses - NO\n\nThis is an open continuous announcement which allows applicants to apply up to the closing date of the announcement 10/30/2023. The register will be used to fill an anticipated 6 vacancies. Selections may be made from certificates issued up to 12 months after the 1st cut-off date listed below. Contingent upon funding and space requirements, one or more vacancies may be filled at the locations listed in this announcement as they become available. Applicants need to apply and/or update their applications by 11:59 pm ET at the close of each of the following cutoff dates to be considered Cutoff 1) 01/10/2023; Cutoff 2) 5/3/2023; Cutoff 3) 8/1/2023; Cutoff 4) 10/30/2023 Closing date. This announcement may be amended to include additional cut-off dates within the 12-month period if needed, not later than 5 workdays prior to the cut-off date or the final selection date.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nWHAT IS THE INFORMATION TECHNOLOGY (IT)DIVISION?\nA description of the business units can be found at: https://www.jobs.irs.gov/about/who/business-divisions\n\nVacancies will be filled in the following specialty areas: Information Technology (IT).\n\nThe following are the duties of this position at the full working level. If this vacancy includes more than one grade and you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and receive training to help you grow in this position.\n\nDevelop and test Assembler Language (ALC) software applications on a mainframe platform.\nProvide technical guidance during a significant project in designing, coding, testing, debugging, and maintaining programs.\nTranslate and interpret functional requirements involved with the local phase of a national project.\nApply Computer Assisted Software Engineering (CASE) tools to the design and development process.\n\n\n"}, {"jobID": "715362300", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "INFORMATION TECHNOLOGY SPECIALIST (SYSANALYSIS/APPSW)", "companyName": "UnitedStatesFleetForcesCommand", "link": "https://www.usajobs.gov/job/715362300", "jobLocation": {"remote": "not specified", "city": "Kittery", "state": "ME", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 77738, "max": 121128}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nMust be a US Citizen.\nMust be determined suitable for federal employment.\nMust participate in the direct deposit pay program.\nNew employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit e-verify.gov\nGenerally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade.  Time-in-grade requirements must be met by the closing date of this announcement.\nWithin the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.\nMales born after 12-31-59 must be registered for Selective Service.\nWork is performed in areas where potentially harmful physical and chemical agents are present (e.g. fumes, dust, heat, ionizing and non-ionizing radiation and chemicals). You will be required to participate in medical surveillance programs.\nThis position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.  This position may require rotating shift work.\nThis position may require travel from normal duty station and travel on military and commercial aircraft for extended periods of time.\nSelectee will be required to sign an Information Privacy Access Agreement.\nCertain incentives (such as Recruitment, Relocation or Student Loan Repayment) may be authorized to eligible selectees.\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.\n\n\n Qualifications\n\r\n                                        In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience.\n\nCyberspace Workforce Role Code: 422 DATA ANALYST\n\nMINIMUM QUALIFICATIONS FOR GS-12 POSITION: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:\n\nExperience, Performing complex systems analysis, testing, maintenance and enhancement of assigned corporate and local software applications;\nExperience, Utilizing analytical processes to plan, design and implement new and/or improve information systems to meet business requirements, (i.e. planning, scheduling and performing the installation, testing and implementation of new or modified applications software);\nExperience, Assuring software and systems quality functionality;\nExperience, Appling Project Management Principles, methods, and practices including developing plans and schedules, estimating resource requirements, defining milestones, monitoring activities, and evaluating and reporting accomplishments; AND\nExperience, Creating and maintaining data structures using Oracle Database Management System running on SUN Solaris/RedHat operating system or Microsoft SQL Server running on Microsoft Windows operating system.\n\n\nMINIMUM QUALIFICATIONS FOR GS-11 POSITION: Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:\n\n\nExperience, Designing, building and maintaining applications and databases using the latest Shipyard-adopted technologies and techniques;\nExperience, Creating and maintaining data structures using Oracle, SQL Server, and Access databases. Knowledge of PL/SQL, stored procedures, query optimization;\nExperience, using /utilizing Visual Studio for VB.NET/ASP.NET/C#, and Eclipse IDE for ColdFusion with FuseBox;\nExperience, Operating and maintaining software applications and using programming languages (e.g., Visual Basic.Net, C#, HTML, VBA, XML, Java Scripting, SharePoint Designer, Unix scripting) and Microsoft (MS) Office software; AND\nExperience, Developing plans/schedules, estimates resource requirements, defining milestones and deliverables, monitoring activities, and evaluating and reporting on accomplishments.\n\nAND\n\nYou must have IT-related experience demonstrating each of the four competencies listed below:\n\n1. Attention to Detail - Coordinates and accomplishes multiple tasks and projects requiring substantial analysis, organization and coordination.\n2. Customer Service - Makes contacts to exchange technical information, coordinates and advises on work efforts and resolves problems.\n3. Oral Communication - Interfaces effectively with senior management and diverse user groups to include oral and visual presentations.\n4. Problem Solving - Diagnose and resolves information assurance problems in response to customer reported incident.\n\nAdditional qualification information can be found from the following Office of Personnel Management website:https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment..\r\n                                    \n\n\nEducation\n\nSUBSTITUTION OF EDUCATION FOR EXPERIENCE FOR GS-11:\n\nApplicants may substitute the following education for the required experience for the GS-11 position, provided it demonstrates the knowledge, skills and abilities necessary to do the work of the position:\n\nSuccessful completion of Ph.D. or equivalent doctoral degree - Or Three \"3\" full years of progressively higher level graduate education leading to a Ph.D. or equivalent doctoral degree in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems or networks. (Must submit transcripts)\n\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/\n\nForeign Education: Education completed in foreign colleges or universities may be used to meet the qualification requirements if the applicant can provide documentation indicating that the foreign education is comparable to that received in an accredited educational institution in the United States. It is the responsibility of the applicant to provide such evidence when applying for further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html\n\n\n\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher. ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/\n\nMilitary Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.\n\n\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nYou will perform system analysis, testing, maintenance and enhancement of software applications and other information systems to meet the needs of shipyard customer organizations.\nYou will plan, schedule and perform the installation, testing and implementation of new or modified applications software.\nYou will troubleshoot and resolve technical problems with the design and delivery of all assigned applications, as well as ensuring the integration of all system components.\nYou will consult with customers to identify and specify requirements, conduct business process reengineering and develop estimates for new or modified systems.\n\n"}, {"jobID": "715225800", "origin_search": "https://www.usajobs.gov/", "posted": "03/28/2023", "jobTitle": "IT SPECIALIST (CUSTSPT/SYSADMIN)", "companyName": "U.S.ArmyContractingCommand", "link": "https://www.usajobs.gov/job/715225800", "jobLocation": {"remote": "not specified", "city": "RedstoneArsenal", "state": "AL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 86001, "max": 132945}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nAppointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.\nThis position has a Temporary Duty (TDY) or business travel requirement of 10% of the time.\nThis position requires a Secret Security Clearance.\nThis position requires an IAT Certification II.\nThis position is a Designated Key Position.\nThis position is Mission Essential position.\n\n\n Qualifications\n\nWho May Apply: US Citizens\nExternal Recruitment Military Spouse Preference (External MSP)\nInteragency Career Transition Assistance Plan (ICTAP)\n\nOnly applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities.\n\n\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.\n\nSpecialized Experience: One year of specialized experience which includes providing customer support services for IT equipment and software; performing systems configuration management plan; maintaining existing systems, including troubleshooting, problem solving, and upgrading.\n\nThe specialized experience must include, or be supplemented by, information technology related experience (paid or unpaid experience and/or completion of specific, intensive training, as appropriate) which demonstrates each of the four competencies, as defined:\n\n1) Attention to Detail-being thorough when providing oversight of information technology and attending to detail in application of IT information security policies and procedures. Examples of IT-related experience demonstrating this competency include: completing thorough and accurate work independently, even in the most difficult or stressful situations; occasionally review work completed by others.\n\n2) Customer Service-Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies or organizations outside the Government); knowledgeable about IT products and services and committed to providing quality products and services. Examples of IT-related experience demonstrating this competency include: resolving routine and non-routine problems, questions, or complaints; developing and maintaining strong, mutually supportive working relationships with customers; conducting evaluation of support to determine quality of services and customer satisfaction, and recommending procedural changes based on customer need or changes in policy and/or regulation.\n\n3) Oral Communication-Expresses information by keeping the organization informed of Information Technology regulatory procedures. Examples of IT-related experience demonstrating this competency include: convincingly conveying complex information to customers; presenting thoughts that are well-organized and demonstrating confidence in the facts and ideas; adjusting style when working with individuals with different levels of understanding; using various methods to explain and convey information.\n\n4) Problem Solving-Identifies problems; provide support and resolution of IT problems. Examples of IT-related experience demonstrating this competency include: solving complex or sensitive problems by developing and proposing strategic alternatives; identifying possible conflicts and shared benefits; helping team anticipate problems and identifying and evaluating potential sources of information; providing feedback and coaching to others to help solve problems; engaging appropriate stakeholders when developing solutions in order to understand and incorporate multiple perspectives and needs; evaluating the effectiveness of decisions and adjusting future decisions as appropriate.\n\n\nYou will be evaluated on the basis of your level of competency in the following areas:\n\nInformation Technology Customer SupportSystem AdministrationTechnology Management\n\n\n\nAdditional information\n\n\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.\nYou will be required to provide proof of U.S. Citizenship.\nTwo year trial/probationary period may be required.\nDirect deposit of pay is required.\nSelection is subject to restrictions resulting from Department of Defense referral system for displaced employees.\nIf you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.\nThis is a Career Program (CP) 34 - Information Technology/Cyber Management position.\nMultiple positions may be filled from this announcement.\nSalary includes applicable locality pay or Local Market Supplement.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\nPayment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest.\nDue to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.\n\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nCoordinate the activities of a technical team composed of both government and contractor personnel.\nEnsure that access to systems/data is properly controlled.\nDiagnose and resolve customer reported system incidents, problems, and events.\nIdentify problems and troubleshoots systems capabilities to ensure Information Technology systems satisfy customer and mission requirements.\nInstall, and configure hardware, software, and peripheral equipment for system users in accordance with organizational standards\n\n"}, {"jobID": "714622400", "origin_search": "https://www.usajobs.gov/", "posted": "03/24/2023", "jobTitle": "Supervisory IT Specialist", "companyName": "U.S.CensusBureau", "link": "https://www.usajobs.gov/job/714622400", "jobLocation": {"remote": "not specified", "city": "Suitland", "state": "MD", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 132368, "max": 172075}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nApplicants must meet all qualification requirements by the closing date of this announcement.\nU.S. Citizen\nSuitable for Federal employment.\nRegistered for Selective Service if applicable. (www.sss.gov)\nTime-in-grade/band requirements must be met by closing date.\nA one-year probationary period may be required.\nA supervisory probationary period may be required.\nThis is a NON-BARGAINING unit position.\nYou may be required to complete a financial disclosure (OGE-450).\n\n\n Qualifications\n\nThis vacancy is advertised under 2 different announcements. Please read the 'This Job Is Open To' section carefully to determine your eligibility. If you are not eligible under this announcement, please see 23-ADSD-11892989-DE-JLK, Supervisory IT Specialist, GS-2210-14.\n\nSpecialized Experience: For the GS-14, you must have one year of experience at a level of difficulty and responsibility equivalent to the GS-13 in the Federal service. Experience for this position includes: Assigning and reviewing employee work; leading teams in advanced systems software/hardware project efforts; evaluating software and systems to identify and solve problems; managing Federal resources and contractors; and managing budgets and contracts.\nIn addition to specialized experience, individuals must have IT-related experience demonstrating each of the four competencies listed below:\n\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer.\n\n\n\nAdditional information\n\nThe following links provide information on various hiring authorities that may enable you to apply through merit assignment procedures, or be eligible for a non-competitive appointment.\n\nVEOA (permanent positions)\n30% or more disabled\nPersons with Disabilities\nCTAP\nICTAP\n\nThe Department of Commerce provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the Human Resources Office. The decision on granting reasonable accommodation will be on a case-by-case basis. TTY users can contact the Human Resources Office via the Federal Relay Service, 1-800-877-8339.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\n\nReview our benefits\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\nLeads task forces/project teams in advanced systems software/hardware project efforts to maximize efficient management and use of personnel, fiscal and contractual resources.\nSupports subject matter users by developing or designing applications for computers and/or in selecting or assisting in selecting computer equipment.\nResponds to and resolves problems with software, hardware, and systems management.\nIntegrates, schedules, and plans operational implementation of coverage measurement programs; monitors implementation and reports progress senior staff for related programs including headquarters data processing and software testing.\n\n"}, {"jobID": "713936500", "origin_search": "https://www.usajobs.gov/", "posted": "03/20/2023", "jobTitle": "Program Specialist - (ADPAC) Medical Administration Service", "companyName": "VeteransHealthAdministration", "link": "https://www.usajobs.gov/job/713936500", "jobLocation": {"remote": "not specified", "city": "NewOrleans", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 57118, "max": 74250}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\n\n\n\nYou must be a U.S. Citizen to apply for this job\nSelective Service Registration is required for males born after 12/31/1959\nYou may be required to serve a probationary period\nSubject to background/security investigation\nSelected applicants will be required to complete an online onboarding process\nParticipation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP)\nParticipation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.\n\n\n\n Qualifications\n\r\n                                        To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 04/07/2023.\n\nTime-In-Grade Requirement: Applicants who are current Federal employees and have held a GS grade any time in the past 52 weeks must also meet time-in-grade requirements by the closing date of this announcement. For a GS-9 position you must have served 52 weeks at the GS-7. The grade may have been in any occupation, but must have been held in the Federal service. An SF-50 that shows your time-in-grade eligibility must be submitted with your application materials. If the most recent SF-50 has an effective date within the past year, it may not clearly demonstrate you possess one-year time-in-grade, as required by the announcement. In this instance, you must provide an additional SF-50 that clearly demonstrates one-year time-in-grade. Note: Time-In-Grade requirements also apply to former Federal employees applying for reinstatement as well as current employees applying for Veterans Employment Opportunities Act of 1998 (VEOA) appointment.\n\nYou may qualify based on your experience and/or education as described below:\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-7 in the normal line of progression for the occupation in the organization. Examples of specialized experience would typically include, but are not limited to:\n\nExperience planning, organizing, and carrying out to completion a wide variety of studies, programs, end products, etc.\nSkilled in applying analytical, statistical, and evaluative methods to plan, schedule, and conduct studies to evaluate and recommend ways to improve the effectiveness and efficiency of Service operations is essential.\nExperience establishing and maintaining effective relationships with and gain the cooperation of clinic chiefs, supervisors, managers, professionals, technical staff, and co-workers on complex or controversial issues is essential to the success of the service and organization.\nSkilled in written and oral communication sufficient to prepare and present findings and recommendations, carry out specific actions regarding controversial issues, and implement new issues and concepts.\nExperience with information technology, cyber-security procedures, policies, and requirements, basic hardware and software [CPU, hard drives, monitor, keyboard, and operating systems (Windows, MAC, JAVA, C++, etc.).\n\nOR\n\nEducation: Substitution of a master's or equivalent graduate degree or 2 full years of progressively higher level graduate education leading to such a degree or LL.B. or J.D., if related\n\nOR\n\nCombination of Specialized Experience and Education: Combination of specialized experience as described above and graduate education as described above which totals at least one year. [To compute the percentage, divide your total months of qualifying experience by 12. Then divide your semester hours of graduate education beyond one year by 18. Add the two percentages. The total percentage must equal at least 100 percent to qualify.]\n\nYou will be rated on the following Competencies for this position:\nAdministration and ManagementAnalysis and Problem SolvingLeadershipOrganizational Performance AnalysisTechnical Documentation\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment.\n\nPhysical Requirements: Work is primarily administrative but requires incumbent to go across geographically separated locations in accomplishing job elements. Occasional lifting of small equipment items and squatting and is required.\n\nFor more information on these qualification standards, please visit the United States Office of Personnel Management's website at https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/.\r\n                                    \n\n\nEducation\n\r\n                                            A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.\r\n                                        \n\n\nAdditional information\n\nThe Career Transition Assistance Plan (CTAP) provide eligible displaced VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nDue to COVID-19, VA is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement. Management officials will provide information about returning to the official, pre-pandemic worksite, when applicable. At that time, you may be eligible to request to continue to telework depending upon the terms of your organization's telework policy and the duties of the position.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nCoordinate the Service's information technology requirements, all facets of Record support and communication with Information Management.\nImplementing or recommending solutions, initiating appropriate work orders, minor hardware issues, software installation and maintenance, troubleshooting problems.\nResponsible for the preparation and implementation of the business contingency plans for system failure specifically addressing manual system backup plans.\nAssesses individual needs to determine appropriate level of menu access for staff.\nPlan IT equipment needs, maintaining for the Service.\nUtilize studies within functional areas for the service for placement of computer equipment and phones; develops, organizes and coordinates space moves.\nPrepare, analysis, or interpretation of special analytical reports and surveys using accepted quality improvement methods such as control charts.\nDeterminate as to data source, methodology of collection of data, analysis techniques applied and display of findings, conclusions and recommendations are generated across sub-organizational.\nProvide staff-specific orientation and computer training to staff. Determines appropriate menus options and file access of MAS Service software package to be given to staff in other Services.\nDevelops establishes, or provides Service training programs and in-services, and training activities on software packages crossing Services.\n\n\nWork Schedule: Monday - Friday; 7:30am - 4pm\nTelework: VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\nVirtual: This is not a virtual position.\nPosition Description/PD#: Program Specialist - (ADPAC) Medical Administration Service/PD07538A\nRelocation/Recruitment Incentives: Not Authorized\nPermanent Change of Station (PCS): Not Authorized\nFinancial Disclosure Report: Not required\n\nThis position is covered by AFGE bargaining unit. Per the AFGE Master Agreement, the Area of Consideration will be: 1st Area of Consideration - Current Facility and CBOC employees; 2nd Area of Consideration - VA Nationwide applicants.\n\n"}, {"jobID": "716099400", "origin_search": "https://www.usajobs.gov/", "posted": "03/31/2023", "jobTitle": "SECRETARY (OFFICE AUTOMATION)", "companyName": "DepartmentoftheAirForce-AgencyWide", "link": "https://www.usajobs.gov/job/716099400", "jobLocation": {"remote": "not specified", "city": "PortCharlotte", "state": "FL", "country": "US"}, "educationRequirement": {"education": null, "major": null}, "jobType": {"internship": false, "partTime": false, "fullTime": false, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": false}, "visaSponsorship": {"none": true, "cpt_opt": false, "h1b": false, "eb": false}, "salary": {"min": 37696, "max": 49009}, "benefits": null, "requirements": "\n\n Help\r\n                                \nRequirements\n Conditions of Employment\n\nU.S. Citizenship Required\nMales must be registered for Selective Service, see www.sss.gov\nThis position is subject to provisions of the DoD Priority Placement Program\nDisclosure of Political Appointments\nAdvance in hire may be authorized if there is demonstrable proof provided on your resume\nLeave accrual may be authorized upon request\nTRAVEL AND RELOCATION EXPENSES WILL NOT BE PAID\nThe incumbent must have the ability to type a minimum of 40 WPM\nTravel by military and/or commercial aircraft or vehicle is required when providing assistance to subordinate\nunits or in the performance of temporary duty assignments\nAll federal employees are required to have direct deposit\nMust be able and willing to submit to a background investigation to verify suitability for employment\n\n\n Qualifications\n\r\n                                        In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Clerical and Administrative Support positions.\n\nSPECIALIZED EXPERIENCE:  Applicants must have at least one (1) year of specialized experience at the next lower grade GS-04, or equivalent in other pay systems. Examples of specialized experience includes independently noting and following-up on commitments made at meetings/conferences; advising others on preparing correspondence, requirements for various reports, and interpreting new instructions and procedures; or locating and summarizing information from files and documents; coordinating the work of the office with the work of other offices; recognizing need for coordination; applying correct grammar, spelling, punctuation, capitalization, and format to prepare and edit written correspondence and reports; managing programs as they relate to clerical and administrative support functions; utilizing various office automation software processing procedures and function keys to produce a wide range of documents requiring complex formats, such as graphics or tables within text, to edit and reformat electronic drafts, update and revise existing databases or spreadsheets; operating standard office equipment, such as electric/electronic typewriters, copiers, fax machines, and office automation systems, to perform a substantial range of office automation support.\n\nOR\nEDUCATION: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college, or university. NOTE: You must submit a copy of your transcripts.\n\nOR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience as described above may be used to qualify for this position. NOTE: You must submit a copy of your transcripts.\n\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n1. Knowledge of extensive rules, procedures, operations, functions, and commitments applied to secretarial and clerical assignments to perform the procedural and administrative work of the office, such as screening calls and visitors, maintaining supervisor's calendar, preparing, reviewing and editing documents, locating and assembling information for various reports, maintaining files/records, and making and preparing travel arrangements.\n\n2. Knowledge of correct grammar, spelling, punctuation, capitalization, and format to accurately prepare and edit written correspondence and reports.\n\n3. Knowledge of various office automation software programs, tools, and techniques to support office operations and produce a variety of documents such as letters, reports, spreadsheets, databases, and graphs.\n\n4. Skill in typing; a qualified typist is required.\n\n5. Ability to communicate effectively, both orally and in writing.\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\r\n                                    \n\n\nEducation\n\nIF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcriptswith the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation.\n\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.\r\n                                        \n\n\nAdditional information\n\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n\n120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\n\nMilitary Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist.\n\nDirect Deposit: All federal employees are required to have direct deposit.\n\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11907471.\n\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace.\n\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.\n\nRead more\n\n\n\n\nBenefits\n\n\n Help\r\n                                                \n\r\n                                                        A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\r\n                                                    \n\n\nReview our benefits\n\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\n\n\n\n\n", "jobDescription": "\n\n Help\r\n                                \nDuties\n\n\nPrepares a wide variety of recurring and some nonrecurring correspondence, reports, and other documents and reviews and finalizes correspondence/documents prepared by others in handwritten or electronic drafts. Composes routine nontechnical correspondence, such as instructions on office procedures, requests for information, and letters of acknowledgment or notification. Reviews and processes incoming and outgoing correspondence, materials, publications, regulations, and directives. Screens incoming mail to identify what needs to be brought to the attention of the supervisor, referred to appropriate staff, rerouted to other organizations/offices, or handled personally.\nReceives telephone calls, greets visitors, and ascertains the nature of the calls or visits. Based upon knowledge of the organization and its programs and operations, refers telephone calls and visitors to appropriate staff or office. Personally answers nontechnical requests for information such as status of reports, suspense dates for matters requiring compliance, and similar information readily available from files or from knowledge of organization.\nMaintains supervisor's calendar, coordinates meeting arrangements, and schedules meetings and/or conferences. Schedules appointments and meetings without prior approval in accordance with supervisor's policies and priorities, and coordinates with the supervisor as necessary.\nPerforms other clerical and administrative work in support of the office/organization. Establishes, updates, and maintains office records of various types that may be needed or will assist in the efficient operation of the office. Provides advice and guidance on clerical and procedural requirements and instructions to other clerical personnel and/or staff members assigned to the organization.\nUses multiple office automation software with varied functions to produce a wide range of documents that often require complex formats, such as graphics or tables within text, editing and reformatting electronic drafts, and updating or revising existing databases or spreadsheets.\n\n\n"}]